#Область РаботаСоСтрокамиЗаявок
Функция СтрокаЗаявкиЗакрыта(СтрокаЗаявки,Отказ = ложь) Экспорт
	
	ЗаявкаЗакрыта = СтрокаЗаявки.СостояниеЗаявки = Справочники.СтатусыДокументов.ЗаявкаПокупателяЗакрыт;
	Отказ = ЗаявкаЗакрыта;
	 Возврат  ЗаявкаЗакрыта;
	
КонецФункции	

Функция ЗаказЗакрыт(ДокументСсылка) Экспорт
ЗапросЗакрытых  = новый Запрос("ВЫБРАТЬ
                               |	ЗаказПоставщикуТовары.СтрокаЗаявки
                               |ПОМЕСТИТЬ ВТСтрокиДокумента
                               |ИЗ
                               |	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
                               |ГДЕ
                               |	ЗаказПоставщикуТовары.Ссылка = &ДокументСсылка
                               |
                               |ОБЪЕДИНИТЬ ВСЕ
                               |
                               |ВЫБРАТЬ
                               |	КорректировкаЗаказаПоставщикуТовары.СтрокаЗаявки
                               |ИЗ
                               |	Документ.КорректировкаЗаказаПоставщику.Товары КАК КорректировкаЗаказаПоставщикуТовары
                               |ГДЕ
                               |	КорректировкаЗаказаПоставщикуТовары.Ссылка = &ДокументСсылка
                               |;
                               |
                               |////////////////////////////////////////////////////////////////////////////////
                               |ВЫБРАТЬ РАЗЛИЧНЫЕ
                               |	МАКСИМУМ(ЗаказыПоставщикамОстатки.СтрокаЗаявки) КАК СтрокаЗаявки
                               |ИЗ
                               |	ВТСтрокиДокумента КАК ВТСтрокиДокумента
                               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.Остатки КАК ЗаказыПоставщикамОстатки
                               |		ПО ВТСтрокиДокумента.СтрокаЗаявки = ЗаказыПоставщикамОстатки.СтрокаЗаявки
                               |			И (ЗаказыПоставщикамОстатки.КоличествоОстаток > 0)
                               |
                               |ИМЕЮЩИЕ
                               |	МАКСИМУМ(ЗаказыПоставщикамОстатки.СтрокаЗаявки) ЕСТЬ NULL")	;
ЗапросЗакрытых.УстановитьПараметр("ДокументСсылка",ДокументСсылка);
Результат  = ЗапросЗакрытых.Выполнить();

Возврат не Результат.Пустой();
Конецфункции	

	
	
#КонецОбласти
