
&НаКлиенте
Процедура ТекущийСтатусПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СледующийСтатусПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Объект.Наименование = "" + Объект.ТекущийСтатус + " -> " + Объект.СледующийСтатус;
	СформироватьИмяКоманды();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИмяКоманды()
	
	ИмяКоманды = "" + Объект.ТекущийСтатус + Объект.СледующийСтатус;
	ЗапрещенныеСимволы = ";"" .,";
	ОбщегоНазначения.УбратьСимволы(ИмяКоманды, ЗапрещенныеСимволы);

	Объект.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЗаголовкиСтраниц();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьЗаголовкиСтраниц()
	
	Элементы.ГруппаТаблицаУсловий.Заголовок = "Условия ("+Объект.ТаблицаУсловий.Количество()+")";
	Элементы.ГруппаТаблицаАлгоритмов.Заголовок = "Алгоритмы ("+Объект.Обработчики.Количество()+")";
	
КонецПроцедуры

