
&НаКлиенте
Процедура ТекущийСтатусПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СледующийСтатусПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Объект.Наименование = "" + Объект.ТекущийСтатус + " -> " + Объект.СледующийСтатус;
	СформироватьИмяКоманды();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьИмяКоманды()
	Объект.ИмяКоманды = СтрЗаменить("" + Объект.ТекущийСтатус + Объект.СледующийСтатус, " ", "");
КонецПроцедуры

