Функция ЗапроситьИсториюПоПараметру(пар_Ссылка) экспорт
	
	ДтВрмФСЗ = Неопределено;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДатыФормированияЗаказовПоставщикам.ДатаФормирования
	                      |ИЗ
	                      |	РегистрСведений.ДатыФормированияСлужебныхЗаданий КАК ДатыФормированияЗаказовПоставщикам
	                      |ГДЕ
	                      |	ДатыФормированияЗаказовПоставщикам.ПараметрФормированияСЗ = &ПараметрФормированияЗаказовПоставщикам");
	Запрос.УстановитьПараметр("ПараметрФормированияЗаказовПоставщикам", пар_Ссылка);
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() > 0 тогда
		ДтВрмФСЗ = Выборка[0].ДатаФормирования;
	КонецЕсли;
	
	Возврат ?( НЕ ДтВрмФСЗ = Неопределено, ?(ДтВрмФСЗ = ДАТА(1,1,1),"Не запускалось",СокрлП(ДтВрмФСЗ)), "ошибка записи");
КонецФункции
	