Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;

	
	ДобавитьОбновитьЗаписьВРегистрДат();
	
КонецПроцедуры

Процедура ДобавитьОбновитьЗаписьВРегистрДат() экспорт
	
	НаборЗаписей = РегистрыСведений.ДатыФормированияСлужебныхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПараметрФормированияСЗ.Установить(Ссылка);
	
	НаборЗаписей.Очистить();
	
	Наб = НаборЗаписей.Добавить();
	Наб.ПараметрФормированияСЗ = Ссылка;
	Наб.ДатаФормирования = Дата(1,1,1);
	
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	лКлючАлгоритма = "Справочник_ПараметрыФормированияСлужебныхЗаданий_МодульОбъекта_ПередЗаписью";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;

	//+ Валиахметов http://jira.part-kom.ru/browse/XX-2238 17.04.2019
	//Отказ = Не ПроверитьЗаполнение();
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	МассивДней = Новый Массив;
	МассивДней.Добавить("Понедельник");
	МассивДней.Добавить("Вторник");
	МассивДней.Добавить("Среда");
	МассивДней.Добавить("Четверг");
	МассивДней.Добавить("Пятница");
	МассивДней.Добавить("Суббота");
	МассивДней.Добавить("Воскресенье");
	
	Для Инд = 1 По 7 Цикл 
		Если Не Вычислить("ДниНедели" + Инд) Тогда 
			Продолжить;
		КонецЕсли;
			
		ПроверяемоеВремяДоставки = Вычислить("ВремДоставки_Региональное" + Инд);
		ПроверяемоеВремяОтгрузки = Вычислить("ВремОтгрузки_Региональное" + Инд);
		
		Если ПроверяемоеВремяДоставки < ПроверяемоеВремяОтгрузки Тогда 
			Сообщить(МассивДней.Получить(Инд - 1) +  ": время доставки не может быть меньше времени отгрузки");
			Выполнить("ВремДоставки_Региональное" + Инд + " =  Неопределено");
		КонецЕсли;
	КонецЦикла;
	//- Валиахметов http://jira.part-kom.ru/browse/XX-2238 17.04.2019
КонецПроцедуры
	