Перем мЗарегистрироватьИзмененияДляСайта;

Процедура ПриЗаписи(Отказ)
	
	лКлючАлгоритма = "Справочник_ПараметрыФормированияСлужебныхЗаданий_МодульОбъекта_ПриЗаписи";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;

	
	ДобавитьОбновитьЗаписьВРегистрДат();
	
	//+ Валиахметов http://jira.part-kom.ru/browse/XX-2716 20.06.2019
	Если мЗарегистрироватьИзмененияДляСайта И НЕ ЭтоГруппа Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные(), "Справочник.ПараметрыФормированияСлужебныхЗаданий.МодульОбъекта.ПриЗаписи"); //Семенов И.П. 31.01.2019 XX-1768
	КонецЕсли;
	//- Валиахметов http://jira.part-kom.ru/browse/XX-2716 20.06.2019
	
КонецПроцедуры

Процедура ДобавитьОбновитьЗаписьВРегистрДат() экспорт
	
	НаборЗаписей = РегистрыСведений.ДатыФормированияСлужебныхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПараметрФормированияСЗ.Установить(Ссылка);
	
	НаборЗаписей.Очистить();
	
	Наб = НаборЗаписей.Добавить();
	Наб.ПараметрФормированияСЗ = Ссылка;
	Наб.ДатаФормирования = Дата(1,1,1);
	
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	лКлючАлгоритма = "Справочник_ПараметрыФормированияСлужебныхЗаданий_МодульОбъекта_ПередЗаписью";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;

	//+ Валиахметов http://jira.part-kom.ru/browse/XX-2238 17.04.2019
	//Отказ = Не ПроверитьЗаполнение();
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Отказ = Не ПроверитьЗаполнение();
	
	МассивДней = Новый Массив;
	МассивДней.Добавить("Понедельник");
	МассивДней.Добавить("Вторник");
	МассивДней.Добавить("Среда");
	МассивДней.Добавить("Четверг");
	МассивДней.Добавить("Пятница");
	МассивДней.Добавить("Суббота");
	МассивДней.Добавить("Воскресенье");
	
	Для Инд = 1 По 7 Цикл 
		Если Не Вычислить("ДниНедели" + Инд) Тогда 
			Продолжить;
		КонецЕсли;
			
		ПроверяемоеВремяДоставки = Вычислить("ВремДоставки_Региональное" + Инд);
		Если Не ЗначениеЗаполнено(ПроверяемоеВремяДоставки) Тогда 
			Сообщить(МассивДней.Получить(Инд - 1) +  ": время доставки не заполнено");
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		ДоставкаНаСледДень = Вычислить("ДоставкаНаСледДень" + Инд);
		Если ДоставкаНаСледДень Тогда 
			ПроверяемоеВремяДоставки = ПроверяемоеВремяДоставки + 24*60*60;
		КонецЕсли;
		ПроверяемоеВремяОтгрузки = Вычислить("ВремОтгрузки_Региональное" + Инд);
		
		Если ПроверяемоеВремяДоставки < ПроверяемоеВремяОтгрузки Тогда 
			Сообщить(МассивДней.Получить(Инд - 1) +  ": время доставки не может быть меньше времени отгрузки");
			Отказ = Истина;
			//Выполнить("ВремДоставки_Региональное" + Инд + " =  Неопределено");
		КонецЕсли;
		
	КонецЦикла;
	//- Валиахметов http://jira.part-kom.ru/browse/XX-2238 17.04.2019
	
	//+ Валиахметов http://jira.part-kom.ru/browse/XX-2716 20.06.2019
	Если ЭтоАктивнаяЗадачаJirа(Справочники.ЗадачиJira.XX2624) Тогда 
		мЗарегистрироватьИзмененияДляСайта = ОбменДаннымиКлиентСервер.НеобходимаРегистрацияИзменений(ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные(), ЭтотОбъект);
	КонецЕсли;
	//- Валиахметов http://jira.part-kom.ru/browse/XX-2716 20.06.2019
	
КонецПроцедуры

//+ Валиахметов http://jira.part-kom.ru/browse/XX-2701 19.06.2019
Функция СкладMaxoptraДоступен() Экспорт 
	Возврат ФормированиеСлужебныхЗаданийКлиентСервер.СкладMaxoptraДоступен(ТипДоставки, Склад);
КонецФункции

Функция ЕстьСкладыMaxoptra() Экспорт 
	Возврат ФормированиеСлужебныхЗаданийКлиентСервер.ЕстьСкладыMaxoptra(Склад);
КонецФункции

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив;
	Если СкладMaxoptraДоступен() Тогда 
		ПроверяемыеРеквизиты.Добавить("СкладMaxoptra");
	Иначе
		НепроверяемыеРеквизиты.Добавить("СкладMaxoptra");
	КонецЕсли;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры
//- Валиахметов http://jira.part-kom.ru/browse/XX-2701 19.06.2019

Процедура ПередУдалением(Отказ)
	
	лКлючАлгоритма = "Справочник_ПараметрыФормированияСлужебныхЗаданий_МодульОбъекта_ПередУдалением";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	
	//+ Валиахметов http://jira.part-kom.ru/browse/XX-2716 20.06.2019
	Если НЕ ЭтоГруппа  Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные(), "Справочник.ПараметрыФормированияСлужебныхЗаданий.МодульОбъекта.ПередУдалением"); //Семенов И.П. 31.01.2019 XX-1768
	КонецЕсли;
	//- Валиахметов http://jira.part-kom.ru/browse/XX-2716 20.06.2019

КонецПроцедуры

мЗарегистрироватьИзмененияДляСайта = Ложь;