Процедура ВыполнитьРегламентноеЗадание() Экспорт 
	//СоздатьПеремещения();
	СоздатьРеализации();
КонецПроцедуры

Процедура СоздатьРеализации()
	
	лКлючАлгоритма = "Обработка_АвтоматическоеВыписка_МодульОбъекта_СоздатьРеализации";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	
	//ХудинВВ  XX-3012  24072019 Добавил  ГДЕ КоличествоОстаток > 0
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РезервыТоваровОстатки.СтрокаЗаявки,
	               |	РезервыТоваровОстатки.КоличествоОстаток КАК Количество,
	               |	РезервыТоваровОстатки.СтрокаЗаявки.Заявка.НомерРозничнойЗаявки КАК НомерРозничнойЗаявки,
	               |	РезервыТоваровОстатки.Номенклатура,
	               |	РезервыТоваровОстатки.Качество,
	               |	РезервыТоваровОстатки.Склад
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	РегистрНакопления.РезервыТоваров.Остатки(
	               |			,
	               |			Склад.ФизическийСклад.АвтоматическоеПеремещение
	               |				И СтрокаЗаявки.МаршрутДоставки.Склад.ФизическийСклад = Склад.ФизическийСклад
	               |				И СтрокаЗаявки.Заявка.ИсточникЗаявки = &ИсточникЗаявки
	               |				И НЕ Склад.Заблокирован) КАК РезервыТоваровОстатки
	               |ГДЕ
	               |	РезервыТоваровОстатки.КоличествоОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкиПокупателейОстатки.СтрокаЗаявки,
	               |	ЗаявкиПокупателейОстатки.КоличествоОстаток КАК Количество
	               |ПОМЕСТИТЬ вт2
	               |ИЗ
	               |	РегистрНакопления.ЗаявкиПокупателей.Остатки(
	               |			,
	               |			СтрокаЗаявки.Заявка.НомерРозничнойЗаявки В
	               |				(ВЫБРАТЬ
	               |					вт.НомерРозничнойЗаявки
	               |				ИЗ
	               |					вт)) КАК ЗаявкиПокупателейОстатки
	               |ГДЕ
	               |	ЗаявкиПокупателейОстатки.КоличествоОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	вт2.СтрокаЗаявки.Заявка.НомерРозничнойЗаявки КАК НомерРозничнойЗаявки
	               |ПОМЕСТИТЬ втНеВыпЗаявки
	               |ИЗ
	               |	вт2 КАК вт2
	               |		ЛЕВОЕ СОЕДИНЕНИЕ вт КАК вт
	               |		ПО вт2.СтрокаЗаявки = вт.СтрокаЗаявки
	               |ГДЕ
	               |	ЕСТЬNULL(вт.Количество, 0) < вт2.Количество
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	вт.НомерРозничнойЗаявки
	               |ПОМЕСТИТЬ втНомера
	               |ИЗ
	               |	вт КАК вт
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втНеВыпЗаявки КАК втНеВыпЗаявки
	               |		ПО вт.НомерРозничнойЗаявки = втНеВыпЗаявки.НомерРозничнойЗаявки
	               |ГДЕ
	               |	втНеВыпЗаявки.НомерРозничнойЗаявки ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КорректировкаЗаявкиПокупателя.Ссылка,
	               |	МАКСИМУМ(КорректировкаЗаявкиПокупателя.Дата) КАК Дата
	               |ПОМЕСТИТЬ втКорр
	               |ИЗ
	               |	Документ.КорректировкаЗаявкиПокупателя КАК КорректировкаЗаявкиПокупателя
	               |ГДЕ
	               |	КорректировкаЗаявкиПокупателя.НомерРозничнойЗаявки В
	               |			(ВЫБРАТЬ
	               |				втНомера.НомерРозничнойЗаявки
	               |			ИЗ
	               |				втНомера)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	КорректировкаЗаявкиПокупателя.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КорректировкаЗаявкиПокупателя.Ссылка КАК Корректировка,
	               |	КорректировкаЗаявкиПокупателя.НомерРозничнойЗаявки,
	               |	КорректировкаЗаявкиПокупателя.ДокументОснование КАК Заявка
	               |ПОМЕСТИТЬ втКорр2
	               |ИЗ
	               |	втКорр КАК втКорр
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаЗаявкиПокупателя КАК КорректировкаЗаявкиПокупателя
	               |		ПО втКорр.Ссылка = КорректировкаЗаявкиПокупателя.Ссылка
	               |			И втКорр.Дата = КорректировкаЗаявкиПокупателя.Дата
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втКорр2.НомерРозничнойЗаявки,
	               |	втКорр2.Корректировка КАК ПослДокумент
	               |ПОМЕСТИТЬ втПослДок
	               |ИЗ
	               |	втКорр2 КАК втКорр2
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗаявкаПокупателя.НомерРозничнойЗаявки,
	               |	ЗаявкаПокупателя.Ссылка
	               |ИЗ
	               |	Документ.ЗаявкаПокупателя КАК ЗаявкаПокупателя
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втКорр2 КАК втКорр2
	               |		ПО (втКорр2.Заявка = ЗаявкаПокупателя.Ссылка)
	               |			И (втКорр2.НомерРозничнойЗаявки = ЗаявкаПокупателя.НомерРозничнойЗаявки)
	               |ГДЕ
	               |	ЗаявкаПокупателя.НомерРозничнойЗаявки В
	               |			(ВЫБРАТЬ
	               |				втНомера.НомерРозничнойЗаявки
	               |			ИЗ
	               |				втНомера)
	               |	И втКорр2.Заявка ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗаявкаПокупателяТовары.Ссылка.Склад КАК Склад,
	               |	ЗаявкаПокупателяТовары.СтрокаЗаявки КАК СтрокаЗаявки,
	               |	1 КАК Коэффициент,
	               |	ЗаявкаПокупателяТовары.Цена,
	               |	ЗаявкаПокупателяТовары.ЦенаСоСкидкой,
	               |	ЗаявкаПокупателяТовары.Сумма * вт.Количество / (ЗаявкаПокупателяТовары.Количество - ЗаявкаПокупателяТовары.Отмена) КАК Сумма,
	               |	ЗаявкаПокупателяТовары.СтавкаНДС,
	               |	ЗаявкаПокупателяТовары.СуммаНДС * вт.Количество / ЗаявкаПокупателяТовары.Количество - ЗаявкаПокупателяТовары.Отмена КАК СуммаНДС,
	               |	ЗаявкаПокупателяТовары.КомментарийИзСайта,
	               |	ЗаявкаПокупателяТовары.IDSite,
	               |	ЗаявкаПокупателяТовары.ПроцентСкидкиНаценки,
	               |	ЗаявкаПокупателяТовары.ЦенаЗакупки,
	               |	ЗаявкаПокупателяТовары.Количество - ЗаявкаПокупателяТовары.Отмена КАК КоличествоИзначальное,
	               |	НЕ ЗаявкаПокупателяТовары.Ссылка.УчитыватьНДС
	               |		ИЛИ ЗаявкаПокупателяТовары.Ссылка.СуммаВключаетНДС КАК СуммаВключаетНДС,
	               |	ЗаявкаПокупателяТовары.Ссылка.НомерРозничнойЗаявки КАК НомерРозничнойЗаявки,
	               |	вт.Количество,
	               |	вт.Количество КАК КоличествоПлан,
	               |	вт.Номенклатура КАК Номенклатура,
	               |	вт.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения,
	               |	вт.Качество КАК Качество,
	               |	вт.Склад КАК СкладРезерва
	               |ИЗ
	               |	Документ.ЗаявкаПокупателя.Товары КАК ЗаявкаПокупателяТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
	               |		ПО ЗаявкаПокупателяТовары.СтрокаЗаявки = вт.СтрокаЗаявки
	               |ГДЕ
	               |	ЗаявкаПокупателяТовары.Количество - ЗаявкаПокупателяТовары.Отмена > 0
	               |	И ЗаявкаПокупателяТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втПослДок.ПослДокумент
	               |			ИЗ
	               |				втПослДок)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КорректировкаЗаявкиПокупателяТовары.Ссылка.Склад,
	               |	КорректировкаЗаявкиПокупателяТовары.СтрокаЗаявки,
	               |	1,
	               |	КорректировкаЗаявкиПокупателяТовары.Цена,
	               |	КорректировкаЗаявкиПокупателяТовары.ЦенаСоСкидкой,
	               |	КорректировкаЗаявкиПокупателяТовары.Сумма * вт.Количество / (КорректировкаЗаявкиПокупателяТовары.Количество - КорректировкаЗаявкиПокупателяТовары.Отмена),
	               |	КорректировкаЗаявкиПокупателяТовары.СтавкаНДС,
	               |	КорректировкаЗаявкиПокупателяТовары.СуммаНДС * вт.Количество / КорректировкаЗаявкиПокупателяТовары.Количество - КорректировкаЗаявкиПокупателяТовары.Отмена,
	               |	КорректировкаЗаявкиПокупателяТовары.КомментарийИзСайта,
	               |	КорректировкаЗаявкиПокупателяТовары.IDSite,
	               |	КорректировкаЗаявкиПокупателяТовары.ПроцентСкидкиНаценки,
	               |	КорректировкаЗаявкиПокупателяТовары.ЦенаЗакупки,
	               |	КорректировкаЗаявкиПокупателяТовары.Количество - КорректировкаЗаявкиПокупателяТовары.Отмена,
	               |	НЕ КорректировкаЗаявкиПокупателяТовары.Ссылка.УчитыватьНДС
	               |		ИЛИ КорректировкаЗаявкиПокупателяТовары.Ссылка.СуммаВключаетНДС,
	               |	КорректировкаЗаявкиПокупателяТовары.Ссылка.НомерРозничнойЗаявки,
	               |	вт.Количество,
	               |	вт.Количество,
	               |	вт.Номенклатура,
	               |	вт.Номенклатура.ЕдиницаХраненияОстатков,
	               |	вт.Качество,
	               |	вт.Склад
	               |ИЗ
	               |	Документ.КорректировкаЗаявкиПокупателя.Товары КАК КорректировкаЗаявкиПокупателяТовары
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
	               |		ПО КорректировкаЗаявкиПокупателяТовары.СтрокаЗаявки = вт.СтрокаЗаявки
	               |ГДЕ
	               |	КорректировкаЗаявкиПокупателяТовары.Количество - КорректировкаЗаявкиПокупателяТовары.Отмена > 0
	               |	И КорректировкаЗаявкиПокупателяТовары.Ссылка В
	               |			(ВЫБРАТЬ
	               |				втПослДок.ПослДокумент
	               |			ИЗ
	               |				втПослДок)";
				   
	Запрос.УстановитьПараметр("ИсточникЗаявки", Перечисления.ИсточникиЗаявок.СайтРозница);
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		Результат = Запрос.Выполнить();
	ЗафиксироватьТранзакцию();
	
	Таблица = Результат.Выгрузить();
	СверТаблица = Таблица.Скопировать(, "НомерРозничнойЗаявки,СкладРезерва");
	
	СверТаблица.Свернуть("НомерРозничнойЗаявки,СкладРезерва");
	
	Для Каждого СтрокаСв Из СверТаблица Цикл 
		ДокРТУ = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		Строки = Таблица.НайтиСтроки(Новый Структура("НомерРозничнойЗаявки,СкладРезерва", СтрокаСв.НомерРозничнойЗаявки, СтрокаСв.СкладРезерва));
		Товары = Таблица.Скопировать(Строки);
		ДокРТУ.ДополнительныеСвойства.Вставить("ТоварыКЗаполнению", Товары);
		ДокРТУ.ДополнительныеСвойства.Вставить("СкладРезерва", СтрокаСв.СкладРезерва);
		
		ДокРТУ.Заполнить(СтрокаСв.НомерРозничнойЗаявки);
		ДокРТУ.СтатусДокумента = Справочники.СтатусыДокументов.РеализацияТоваровУслугСборка;
		Попытка
			ДокРТУ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
			Сообщить(ОписаниеОшибки);
		КонецПопытки;
	КонецЦикла;	
КонецПроцедуры

