
// Начать замер времени выполнения ключевой операции
//
// Параметры:
//  КодКлючевойОперации - Строка, код элемента справочника "КлючевыеОперации"
//
// Возвращаемое значение:
//  Число - время начала замера
//
Функция НачатьЗамерВремени(КлючеваяОперация, Описание = "",ПодключатьОбработчикОжидания = Истина) Экспорт
	лКлючАлгоритма = "ОбщийМодуль_APDEX_ОценкаПроизводительностиКлиентСервер_НачатьЗамерВремени";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////	
	
	//Семенов И.П. 18.12.2018(
	Если ПараметрыСеанса.APDEX_НастройкиЗамеров.APDEX_ОтключитьЗамер=Истина Тогда 
		Возврат 0;
	КонецЕсли;
	//)Семенов И.П.
	
	КлючеваяОперация = APDEX_ОценкаПроизводительностиСерверВызовСервера.ПолучитьОперацию(КлючеваяОперация);
	
	// 01.03.19 Строганов Роман > 
	Если ПараметрыСеанса.APDEX_АктивныеКлючевыеОперации.Найти(КлючеваяОперация) = Неопределено Тогда
		// Замер ключевой операции отключен
		Возврат 0;
	КонецЕсли;
	// 01.03.19 Строганов Роман <
	
	Если ПодключатьОбработчикОжидания тогда
		#Если Клиент Тогда
			
			ВремяНачала = APDEX_ОценкаПроизводительностиСерверВызовСервера.ЗафиксироватьВремяНачала(КлючеваяОперация, Ложь, Описание);
			ПодключитьОбработчикОжидания("APDEX_ЗакончитьЗамерВремениАвто", 0.1, Истина);
			
		#ИначеЕсли Сервер Тогда
			
			ВремяНачала = APDEX_ОценкаПроизводительностиСерверВызовСервера.ЗафиксироватьВремяНачала(КлючеваяОперация, Истина, Описание);
			
		#КонецЕсли
		
	Иначе
		
		ВремяНачала = APDEX_ОценкаПроизводительностиСерверВызовСервера.ЗафиксироватьВремяНачала(КлючеваяОперация, Истина, Описание);
		
	КонецЕсли;
	
	Возврат ВремяНачала;
	
КонецФункции

// Закончить замер времени выполнения ключевой операции
//
// Возвращаемое значение:
//  Число - время окончания замера
//
Функция ЗакончитьЗамерВремени(КлючеваяОперация = Неопределено, Описание = "", ТекстЗапроса ="", Ссылка = Неопределено) Экспорт
	лКлючАлгоритма = "ОбщийМодуль_APDEX_ОценкаПроизводительностиКлиентСервер_ЗакончитьЗамерВремени";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////	
	
	//Семенов И.П. 18.12.2018(
	Если ПараметрыСеанса.APDEX_НастройкиЗамеров.APDEX_ОтключитьЗамер=Истина Тогда 
		Возврат 0;
	КонецЕсли;
	//)Семенов И.П.
	
	КлючеваяОперация = APDEX_ОценкаПроизводительностиСерверВызовСервера.ПолучитьОперацию(КлючеваяОперация);
	
	// 01.03.19 Строганов Роман > 
	Если ПараметрыСеанса.APDEX_АктивныеКлючевыеОперации.Найти(КлючеваяОперация) = Неопределено Тогда
		// Замер ключевой операции отключен
		Возврат 0;
	КонецЕсли;
	// 01.03.19 Строганов Роман <
		
	Возврат APDEX_ОценкаПроизводительностиСерверВызовСервера.ЗафиксироватьВремяОкончания(КлючеваяОперация, Ложь, Описание, ТекстЗапроса, Ссылка);; 
	
КонецФункции

Процедура НачатьЗамерПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	лКлючАлгоритма = "ОбщийМодуль_APDEX_ОценкаПроизводительностиКлиентСервер_ЗакончитьЗамерОбработкаПроведения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////	
	
	//Семенов И.П. 18.12.2018(
	Если ПараметрыСеанса.APDEX_НастройкиЗамеров.APDEX_ОтключитьЗамер=Истина Тогда 
		Возврат;
	КонецЕсли;
	//)Семенов И.П.
	
	Если (РежимЗаписи = РежимЗаписиДокумента.Проведение) Тогда
		Описание = ""+Источник.Ссылка;
		Операция = APDEX_ОценкаПроизводительностиСерверВызовСервера.ПолучитьОперацию(Источник.Ссылка);
		
		// 01.03.19 Строганов Роман > 
		Если ПараметрыСеанса.APDEX_АктивныеКлючевыеОперации.Найти(Операция) = Неопределено Тогда
			// Замер ключевой операции отключен
			Возврат;
		КонецЕсли;
		// 01.03.19 Строганов Роман <
		
		НачатьЗамерВремени(Операция, Описание);
	КонецЕсли;

КонецПроцедуры

Процедура ЗакончитьЗамерОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	лКлючАлгоритма = "ОбщийМодуль_APDEX_ОценкаПроизводительностиКлиентСервер_ЗакончитьЗамерОбработкаПроведения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////	
	
	//Семенов И.П. 18.12.2018(
	Если ПараметрыСеанса.APDEX_НастройкиЗамеров.APDEX_ОтключитьЗамер=Истина Тогда 
		Возврат;
	КонецЕсли;
	//)Семенов И.П.
		
	Описание = ""+Источник.Ссылка;
	Операция = APDEX_ОценкаПроизводительностиСерверВызовСервера.ПолучитьОперацию(Источник.Ссылка);
	
	// 01.03.19 Строганов Роман > 
	Если ПараметрыСеанса.APDEX_АктивныеКлючевыеОперации.Найти(Операция) = Неопределено Тогда
		// Замер ключевой операции отключен
		Возврат;
	КонецЕсли;
	// 01.03.19 Строганов Роман <

	ЗакончитьЗамерВремени(Операция, Описание);
	
КонецПроцедуры

	

