
Процедура Добавить(Заявка, ДатаЗакрытия, ОбновлятьДатуЗакрытия = Ложь) Экспорт
	
	Если Не ОбновлятьДатуЗакрытия Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыЗакрытияЗаявок.ДатаЗакрытия
		|ИЗ
		|	РегистрСведений.ДатыЗакрытияЗаявок КАК ДатыЗакрытияЗаявок
		|ГДЕ
		|	ДатыЗакрытияЗаявок.Заявка = &Заявка";
		
		Запрос.УстановитьПараметр("Заявка", Заявка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если Не РезультатЗапроса.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	МЗ = РегистрыСведений.ДатыЗакрытияЗаявок.СоздатьМенеджерЗаписи();
	МЗ.Заявка 		= Заявка;
	МЗ.ДатаЗакрытия = ДатаЗакрытия;
	МЗ.Записать();
	
КонецПроцедуры