Процедура Добавить(ИмяФайла, АктРассмотренияВозврата = Неопределено, ТекстФайла = "", Ошибка = Ложь, ТекстОшибки = "", Исходящее = Ложь) Экспорт
	
	
	  МЗ 							= РегистрыСведений.ИсторияОбменаССайтомВозвраты.СоздатьМенеджерЗаписи();
	  МЗ.Период 					= ТекущаяДата();
	  МЗ.ИмяФайла 					= ИмяФайла;
	  МЗ.АктРассмотренияВозврата 	= АктРассмотренияВозврата;
	  МЗ.ТекстФайла 				= ТекстФайла;
	  МЗ.Ошибка 					= Ошибка;
	  МЗ.ТекстОшибки 				= ТекстОшибки;
	  МЗ.Исходящее 					= Исходящее;
	  МЗ.Записать();
	
КонецПроцедуры