
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВнешнийВидФормы()
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПериодДействияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры


//Прочее

&НаКлиенте
Процедура УстановитьВнешнийВидФормы()
	Элементы.ГруппаПокупка.Видимость 					= Объект.РазрешенаПокупкаУСобственныхОрганизаций;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	
	Объект.Наименование = ""+Объект.Владелец+" от "+Формат(Объект.ПериодДействия, "ДФ=dd.MM.yyyy")+"г.";	
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыПолитикиНаСервере()
	
	ПараметрыПолитики = Справочники.ПолитикиМФП.ПолучитьПараметрыПолитикиМФПДляОрганизации(ОБъект.Владелец, ТекущаяДата());
	
	Для каждого СтрокаТЗ ИЗ ПараметрыПолитики.ОрганизацииДляЗакупки Цикл
		Сообщить("Организация закупки: "+СтрокаТЗ.Организация+" приоритет: "+СтрокаТЗ.Приоритет);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПолитики(Команда)
	ПараметрыПолитикиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РазрешенаПокупкаУСобственныхОрганизацийПриИзменении(Элемент)
	УстановитьВнешнийВидФормы();
КонецПроцедуры

&НаКлиенте
Процедура СобственныеОрганизацииРазрешенаПокупкаДоговорКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	текСтрока = Элементы.СобственныеОрганизацииРазрешенаПокупка.ТекущиеДанные;
	
	ОрганизацияПродавец = текСтрока.Организация;
	
	Если Не ЗначениеЗаполнено(ОрганизацияПродавец) Тогда
		Возврат;		
	КонецЕсли;
	
	ФормаВыбораДоговора = Справочники.ДоговорыКонтрагентов.ПолучитьФормуВыбора();
	
	ОтборВладелец = ФормаВыбораДоговора.ЭлементыФормы.СправочникСписок.Значение.Отбор.Владелец;	
	ОтборВладелец.Значение = Объект.Контрагент;	
	ОтборВладелец.Использование = Истина;
	
	ОтборОрганизация = ФормаВыбораДоговора.ЭлементыФормы.СправочникСписок.Значение.Отбор.Организация;	
	ОтборОрганизация.Значение = ОрганизацияПродавец;	
	ОтборОрганизация.Использование = Истина;
	
	ОтборВидДоговора = ФормаВыбораДоговора.ЭлементыФормы.СправочникСписок.Значение.Отбор.ВидДоговора;	
	ОтборВидДоговора.Значение = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.СПокупателем");	
	ОтборВидДоговора.Использование = Истина;
	
	ВыбранноеЗначение = ФормаВыбораДоговора.ОткрытьМодально();
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		текСтрока.ДоговорКонтрагента = ВыбранноеЗначение;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция КонтрагентОрганизации(вхОрганизация, вхДатаДействия)
	
	Возврат Справочники.ПолитикиМФП.КонтрагентОрганизации(вхОрганизация, вхДатаДействия);
	
КонецФункции






