
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВнешнийВидФормы()
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПериодДействияПриИзменении(Элемент)
	СформироватьНаименование();
КонецПроцедуры


//Прочее

&НаКлиенте
Процедура УстановитьВнешнийВидФормы()
	Элементы.ГруппаПокупка.Видимость 					= Объект.РазрешенаПокупкаУСобственныхОрганизаций;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	
	Объект.Наименование = ""+Объект.Владелец+" от "+Формат(Объект.ПериодДействия, "ДФ=dd.MM.yyyy")+"г.";	
	
КонецПроцедуры

&НаСервере
Процедура ПараметрыПолитикиНаСервере()
	
	ПараметрыПолитики = Справочники.ПолитикиМФП.ПолучитьПараметрыПолитикиМФПДляОрганизации(ОБъект.Владелец, ТекущаяДата());
	
	Для каждого СтрокаТЗ ИЗ ПараметрыПолитики.ОрганизацииДляЗакупки Цикл
		Сообщить("Организация закупки: "+СтрокаТЗ.Организация+" приоритет: "+СтрокаТЗ.Приоритет);
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПолитики(Команда)
	ПараметрыПолитикиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РазрешенаПокупкаУСобственныхОрганизацийПриИзменении(Элемент)
	УстановитьВнешнийВидФормы();
КонецПроцедуры






