Процедура Добавить(ПараметрыСообщения, РегистрироватьКВыгрузке = Истина) Экспорт
	
	МЗ = РегистрыСведений.СообщенияПроцессаВозвратаОтПокупателяДляСайта.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, ПараметрыСообщения,,"ДопСведения");
	МЗ.Период = ТекущаяДата();
	МЗ.Идентификатор = Строка(Новый УникальныйИдентификатор);
	МЗ.ДопСведения = Новый ХранилищеЗначения(ПараметрыСообщения.ДопСведения, Новый СжатиеДанных(9)); 
	МЗ.Записать();
	
	Если РегистрироватьКВыгрузке Тогда
		ЗарегистрироватьКВыгрузке(МЗ.Идентификатор, МЗ.Период);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьКВыгрузке(Идентификатор, Период) Экспорт
	
	Узел = ПланыОбмена.ОбменПартКом83_Сайт_Возвраты.Узел(Ложь);
	
	Если ЗначениеЗаполнено(Узел) Тогда
		
		НЗ = РегистрыСведений.СообщенияПроцессаВозвратаОтПокупателяДляСайта.СоздатьНаборЗаписей();
		НЗ.Отбор.Идентификатор.Установить(Идентификатор, Истина);
		НЗ.Отбор.Период.Установить(Период, Истина);
		НЗ.Прочитать();
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, НЗ);
		
	Иначе
		
		ВызватьИсключение "Не определен исходящий узел обмена для плана обмена ""ОбменПартКом83_Сайт_Возвраты""!";
		
	КонецЕсли;
	
КонецПроцедуры

Функция СтруктураПараметровСообщения() Экспорт
	
	Возврат Новый Структура("ТипСообщения, Штрихкод, АктРассмотренияВозврата, Сообщение, ДопСведения", 
	Перечисления.ТипыСообщенийПроцессаВозвратовДляСайта.ТекстовоеСообщение,,,,Новый Структура);	
	
КонецФункции