Процедура Добавить(ПараметрыСообщения, РегистрироватьКВыгрузке = Истина) Экспорт
	
	МЗ = РегистрыСведений.СообщенияПроцессаВозвратаОтПокупателяДляСайта.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, ПараметрыСообщения);
	МЗ.Период = ТекущаяДата();
	МЗ.Идентификатор = Строка(Новый УникальныйИдентификатор);
	МЗ.Записать();
	
	Если РегистрироватьКВыгрузке Тогда
		ЗарегистрироватьКВыгрузке(МЗ.Идентификатор);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьКВыгрузке(Идентификатор) Экспорт
	
	Узел = ПланыОбмена.ОбменПартКом83_Сайт_Возвраты.Узел(Ложь);
	
	Если ЗначениеЗаполнено(Узел) Тогда
		
		НЗ = РегистрыСведений.СообщенияПроцессаВозвратаОтПокупателяДляСайта.СоздатьНаборЗаписей();
		НЗ.Отбор.Идентификатор.Установить(Идентификатор);
		НЗ.Прочитать();
		
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, НЗ);
		
	Иначе
		
		ВызватьИсключение "Не определен исходящий узел обмена для плана обмена ""ОбменПартКом83_Сайт_Возвраты""!";
		
	КонецЕсли;
	
КонецПроцедуры