
&НаКлиенте
Процедура ИспользованиеВСтатусахВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьЗначение(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользованиеВСтатусах.Параметры.УстановитьЗначениеПараметра("Команда", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьЗаголовкиСтраниц();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗаголовкиСтраниц()
	
	Элементы.ГруппаОбработчики.Заголовок = "Обработчики ("+Объект.Обработчики.Количество()+")";
	Элементы.ГруппаУсловия.Заголовок = "Условия доступности ("+Объект.ТаблицаУсловий.Количество()+")";
	
КонецПроцедуры

