
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	//ЕстьОтборПоСкладу = Ложь;
	//
	//ИдентификаторПользовательскойНастройки = "";
	//Для каждого ЭлОтбора Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
	//	Если Строка(ЭлОтбора.ЛевоеЗначение) = "Склад" Тогда
	//		ИдентификаторПользовательскойНастройки = ЭлОтбора.ИдентификаторПользовательскойНастройки;
	//		Если ЭлОтбора.Использование Тогда
	//			ЕстьОтборПоСкладу = Истина;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//// если элемент отбора найден
	//Если ЗначениеЗаполнено(ИдентификаторПользовательскойНастройки) Тогда
	//	
	//	ЭлементОтбора = Неопределено;
	//	Для Каждого ЭлементНастройки Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
	//		Если ЭлементНастройки.ИдентификаторПользовательскойНастройки = ИдентификаторПользовательскойНастройки Тогда
	//			ЭлементОтбора = ЭлементНастройки;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	Если ЭлементОтбора <> Неопределено И ЭлементОтбора.Использование Тогда
	//		ЕстьОтборПоСкладу = Истина;
	//	Иначе
	//		ЕстьОтборПоСкладу = Ложь;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если Не ЕстьОтборПоСкладу Тогда
	//	СтандартнаяОбработка = Ложь;
	//	Сообщить("Не установлен отбор по складу, отчет не сформирован.");
	//КонецЕсли;

КонецПроцедуры
