
Процедура ПередЗаписью(Отказ)
	
	лКлючАлгоритма = "Справочник_ЗадачиJira_МодульОбъекта_ПередЗаписью";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если Не ЗначениеЗаполнено(Автор) Тогда
		Автор = ПараметрыСеанса.ТекущийПользователь;		
	КонецЕсли;
	
	Если Активность И Не ЗначениеЗаполнено(ДатаАктивации) Тогда
		ДатаАктивации = ТекущаяДата();
	КонецЕсли;
	
	//Если Не ЗначениеЗаполнено(Код) Тогда
	//	ОбщегоНазначения.СообщитьОбОшибке("Не указан номер задачи!", Отказ,,СтатусСообщения.Важное);
	//КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	лКлючАлгоритма = "Справочник_ЗадачиJira_МодульОбъекта_ОбработкаПроверкиЗаполнения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	//ПроверяемыеРеквизиты.Вставить("Код");
	
КонецПроцедуры
