Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтложенноеСнятиеБлокировкиКонтрагентов.Документ
		|ИЗ
		|	РегистрСведений.ОтложенноеСнятиеБлокировкиКонтрагентов КАК ОтложенноеСнятиеБлокировкиКонтрагентов";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПроцедурыОбменаССайтом.ОтложенноеСнятиеБлокировкиКонтрагентов(Выборка.Документ);
		
		НЗ = РегистрыСведений.ОтложенноеСнятиеБлокировкиКонтрагентов.СоздатьНаборЗаписей();
		НЗ.Отбор.Документ.Установить(Выборка.Документ);
		НЗ.Записать();
		
	КонецЦикла;
	
	
КонецПроцедуры
