
Процедура ЗаписатьДанныООсновномДоговореПоСтруктуре(СтруктураЗаписи) Экспорт
ОсновнойДоговорМЗ = РегистрыСведений.ОсновныеДоговорыКонтрагентов.СоздатьМенеджерЗаписи();
ЗаполнитьЗначенияСвойств(ОсновнойДоговорМЗ,СтруктураЗаписи);
ОсновнойДоговорМЗ.Записать();


	
КонецПроцедуры	

Функция ПолучитьДоговор(Организация, Контрагент, ВидДоговора) Экспорт
	
	ДоговорКонтрагента = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеДоговорыКонтрагентов.ДоговорКонтрагента
		|ИЗ
		|	РегистрСведений.ОсновныеДоговорыКонтрагентов КАК ОсновныеДоговорыКонтрагентов
		|ГДЕ
		|	ОсновныеДоговорыКонтрагентов.Контрагент = &Контрагент
		|	И ОсновныеДоговорыКонтрагентов.Организация = &Организация
		|	И ОсновныеДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДоговорКонтрагента = Выборка.ДоговорКонтрагента;
	КонецЕсли;
	
	Возврат ДоговорКонтрагента;
	
КонецФункции