

#Область Команды

Процедура ВыполнитьКоманду( пФорма, Знач пКоманда, Знач пЗадачи = Неопределено ) Экспорт
	
	выбраннаяКоманда = ПолучитьКомандуПроцессаДляВыполнения( пФорма, пКоманда );
	
	Если выбраннаяКоманда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	данныеКоманды = НайтиСтрокуСКомандойПоКомандеПроцесса( пФорма, выбраннаяКоманда );
	ИК = Справочники.ИменованныеКонстантыПроцессов.СтруктураКонстант();
	
	успешно = Истина;
	
	Если данныеКоманды.НаКлиенте Тогда
		
		МассивОбработчиков = ВозвратыОтПокупателяВызовСервера.ПолучитьМассивОбработчиковКоманды(выбраннаяКоманда);
		Для каждого Алгоритм Из МассивОбработчиков Цикл
			
			лИК = Справочники.АлгоритмыПроцессов.СтруктураКонстантАлгоритма(Алгоритм);
			
			попытка
				Выполнить(Алгоритм.Алгоритм);
			Исключение
				ТекстОшибки = "Ошибка выполнения команды: "+выбраннаяКоманда.Наименование+", алгоритм: "+Алгоритм+", описание ошибки: "+ОписаниеОшибки();
				Сообщить(ТекстОшибки);
				ВызватьИсключение ТекстОшибки;
			КонецПопытки;
			
		КонецЦикла;
		
	Иначе
		
		успешно = пФорма.ВыполнитьКомандуПроцесса( выбраннаяКоманда );
		
	КонецЕсли;
	
	пФорма.Модифицированность = Ложь;
	
КонецПроцедуры

Функция ПолучитьКомандуПроцессаДляВыполнения( пФорма, пКоманда )
	
	выбраннаяКоманда = Неопределено;
	
	Если пКоманда.Имя = "ВыполнитьКоманду" Тогда
		//
		//Отбор = Новый Структура( "Ссылка" , МассивДоступныхКомандПроцесса( пФорма ) );
		//
		//ПараметрыФормы = Новый Структура( "Отбор" , Отбор );
		//
		//выбраннаяКоманда = ОткрытьФормуМодально( "Справочник.КомандыПроцессов.ФормаВыбора" , ПараметрыФормы , пФорма );
		
	Иначе
		
		выбраннаяКоманда = НайтиСтрокуСКомандойПоКомандеФормы( пФорма, пКоманда ).Команда;
		
	КонецЕсли;
	
	Возврат выбраннаяКоманда;
	
КонецФункции

Функция МассивДоступныхКомандПроцесса( пФорма )
	
	массивКоманд = Новый Массив;
	
	Для каждого цСтрока Из пФорма.ТаблицаКоманд Цикл
		
		массивКоманд.Добавить( цСтрока.командаПроцесса );
		
	КонецЦикла;
	
	Возврат массивКоманд;
	
КонецФункции	//МассивДоступныхКомандПроцесса

Функция НайтиСтрокуСКомандойПоКомандеФормы( пФорма, пКоманда )
	
	Возврат НайтиСтрокуСКомандой( пФорма, Новый Структура( "имяКомандыФормы" , пКоманда.Имя ) );
	
КонецФункции

Функция НайтиСтрокуСКомандойПоКомандеПроцесса( пФорма, пКомандаПроцесса )
	
	Возврат НайтиСтрокуСКомандой( пФорма, Новый Структура( "Команда" , пКомандаПроцесса ) );
	
КонецФункции

Функция НайтиСтрокуСКомандой( пФорма, пСтруктПоиска )
	
	найденныеСтроки = пФорма.ТаблицаКоманд.НайтиСтроки( пСтруктПоиска );
	
	Если найденныеСтроки.Количество() > 0 Тогда
		
		найденнаяСтрока = найденныеСтроки[0];
		
	Иначе
		
		текстСообщения = НСтр( "ru='Описание команды процесса """+пСтруктПоиска.имяКомандыФормы+""" не найдено'" );
		
		ВызватьИсключение текстСообщения;
		
	КонецЕсли;
	
	Возврат найденнаяСтрока;
	
КонецФункции



#КонецОбласти