
//// ОБРАБОТЧИКИ МОДУЛЯ ОБЪЕКТА

Процедура ВыполнитьПроведение(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	лКонтроль = Неопределено;
	лФильтр = Неопределено;
	ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "ДанныеОбъекта.Контроль", лКонтроль);
	ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "Фильтр", лФильтр);	
	
	флСпособПроведения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "флСпособПроведения");
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ТоварыНаСкладах")  Тогда
		Если Не флСпособПроведения = Перечисления.СпособыПроведенияДокументов.ТолькоВзаиморасчеты Тогда 
			ПроведениеДокументовКлиентСервер.КонтрольОстатков(вхСсылкаНаДокумент, вхОтказ,,вхПараметры);
			ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "ТоварыНаСкладах", РегистрыНакопления_ТоварыНаСкладах(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
		Иначе
			ПроведениеДокументовКлиентСервер.ОчиститьДвиженияДокумента(вхСсылкаНаДокумент, "ТоварыНаСкладах");
		КонецЕсли;
	КонецЕсли;
		
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ПартииТоваров") 
		//ИЛИ ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ПартииТоваровVMI") 
		Тогда
		
		лОчищать = ПроведениеДокументовКлиентСервер.НеобходимоОчиститьДвиженияПартииТоваров(вхСсылкаНаДокумент, лФильтр);		
		
		НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПартионныйУчет, вхПараметры);
		
		Если лОчищать  Тогда
			Если лФильтр = Неопределено Тогда 
				ПроведениеДокументовКлиентСервер.ОчиститьДвиженияДокумента(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.ПартииТоваров);
				лБазовая = Неопределено;
				ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ПартииТоваров", лБазовая);
			Иначе
				// Очищаем только движения по фильтру
				лБазовая = ПроведениеДокументовКлиентСервер.ЗначенияДвиженийДокумента(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.ПартииТоваров);	
				лРазделенныеБазовая = РаботаСПоследовательностямиКлиентСервер.РазделенныеДанные(лБазовая, лФильтр);
				ОбщегоНазначения.ЗаписатьДвиженияДокументаБезОбработки(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.ПартииТоваров, лРазделенныеБазовая.Исключенные, Истина); 
				лБазовая = лРазделенныеБазовая.Исключенные;
			КонецЕсли;	
		Иначе
			лБазовая = ПроведениеДокументовКлиентСервер.ЗначенияДвиженийДокумента(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.ПартииТоваров);	
		КонецЕсли;

		лРазделенныеБазовая = РаботаСПоследовательностямиКлиентСервер.РазделенныеДанные(лБазовая, лФильтр);
		лИсходная = лРазделенныеБазовая.Включенные;
		
		Структура = ПроведениеДокументовКлиентСервер.ПогашениеПартийТоваровНовое(вхСсылкаНаДокумент, вхОтказ, ,лФильтр);
		Если Не вхОтказ Тогда 				
			лТребуемая = Структура.ПартииТоваров;
					
			//Удалим служебные колонки 
			ОбщегоНазначения.УдалитьКолонки(лИсходная, лТребуемая);
			
			лРазностныеДанные = РаботаСПоследовательностямиКлиентСервер.РазностныеДанные(лИсходная, лТребуемая); 
			ПроведениеДокументовКлиентСервер.ЗаписатьДвижения(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.ПартииТоваров,
			лРазностныеДанные, лРазделенныеБазовая.Исключенные);
			
			ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПартионныйУчет, вхПараметры);
			Если лФильтр = Неопределено Тогда 
				РаботаСПоследовательностямиКлиентСервер.ЗарегистрироватьОбъектПоСсылке(вхСсылкаНаДокумент, "ПартионныйУчет", Истина);
			КонецЕсли;
			ПроведениеДокументовКлиентСервер.ЗаписатьИзмененныеДвижения(вхСсылкаНаДокумент, лФильтр, Структура.ПартииТоваровVMI, Метаданные.РегистрыНакопления.ПартииТоваровVMI);
		КонецЕсли;
	КонецЕсли;
		
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "Закупки") Тогда
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "Закупки", РегистрыНакопления_Закупки(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
	КонецЕсли;
		                                        
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "Взаиморасчеты") тогда
		// регистр накопления "Взаиморасчеты"
		НовоеПроведениеПоВзаиморасчетам = глЗначениеПеременной("НовоеПроведениеПоВзаиморасчетам");

		лОчищать = Ложь;
		Если НовоеПроведениеПоВзаиморасчетам Тогда 
			лОчищать = ПроведениеДокументовКлиентСервер.НеобходимоОчиститьДвиженияВзаиморасчеты(вхСсылкаНаДокумент);	
		Иначе
			Если (лКонтроль <> Неопределено) тогда
				Если лКонтроль.Свойство("СтарыеЗначения") Тогда
					лСтарыеЗначения = лКонтроль.СтарыеЗначения.Получить(Метаданные.Последовательности.ПоРасчетамСКонтрагентами);
					лНовыеЗначения = лКонтроль.НовыеЗначения.Получить(Метаданные.Последовательности.ПоРасчетамСКонтрагентами);
					Если (лСтарыеЗначения <> Неопределено) И (лНовыеЗначения <> Неопределено) тогда
						лОчищать = (лСтарыеЗначения.Шапка.Дата < лНовыеЗначения.Шапка.Дата)
						И лСтарыеЗначения.Шапка.Проведен;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПоРасчетамСКонтрагентами, вхПараметры);
		
		Если лОчищать тогда
			ПроведениеДокументовКлиентСервер.ОчиститьДвиженияДокумента(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.Взаиморасчеты);
			лБазовая = Неопределено;
			ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("Взаиморасчеты", лБазовая);
			лТребуемая = РегистрыНакопления_Взаиморасчеты(вхСсылкаНаДокумент, вхОтказ, вхПараметры);
		Иначе
			лТребуемая = РегистрыНакопления_Взаиморасчеты(вхСсылкаНаДокумент, вхОтказ, вхПараметры);
			лБазовая = ПроведениеДокументовКлиентСервер.ЗначенияДвиженийДокумента(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.Взаиморасчеты);	
		КонецЕсли;
		
		лРазделенныеБазовая = РаботаСПоследовательностямиКлиентСервер.РазделенныеДанные(лБазовая, лФильтр);
		лИсходная = лРазделенныеБазовая.Включенные;
		//лТребуемая = РегистрыНакопления_Взаиморасчеты(вхСсылкаНаДокумент, вхОтказ, вхПараметры);
		лРазностныеДанные = РаботаСПоследовательностямиКлиентСервер.РазностныеДанные(лИсходная, лТребуемая); 
		ПроведениеДокументовКлиентСервер.ЗаписатьДвижения(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.Взаиморасчеты,
		лРазностныеДанные, лРазделенныеБазовая.Исключенные);
		
		ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПоРасчетамСКонтрагентами, вхПараметры);
		Если НовоеПроведениеПоВзаиморасчетам И лФильтр = Неопределено Тогда 
			РаботаСПоследовательностямиКлиентСервер.ЗарегистрироватьОбъектПоСсылке(вхСсылкаНаДокумент, "ПоРасчетамСКонтрагентами", Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьОтменуПроведения(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПоРасчетамСКонтрагентами, вхПараметры);
	НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПартионныйУчет, вхПараметры);
	
	ПроведениеДокументовКлиентСервер.ОчиститьДвиженияДокумента(вхСсылкаНаДокумент);
	
	ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПоРасчетамСКонтрагентами, вхПараметры);
	ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПартионныйУчет, вхПараметры);
	
	РаботаСПоследовательностямиКлиентСервер.ЗарегистрироватьОбъектПоСсылке(вхСсылкаНаДокумент, "ПартионныйУчет", Ложь);
	
	Если глЗначениеПеременной("НовоеПроведениеПоВзаиморасчетам") Тогда 
		РаботаСПоследовательностямиКлиентСервер.ЗарегистрироватьОбъектПоСсылке(вхСсылкаНаДокумент, "ПоРасчетамСКонтрагентами", Ложь);
	КонецЕсли;
КонецПроцедуры

//// ТАБЛИЦЫ ДВИЖЕНИЙ ДОКУМЕНТОВ

Функция РегистрыНакопления_ТоварыНаСкладах(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	ТабТоваров = Новый ТаблицаЗначений;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ТоварыНаСкладах", ТабТоваров);
	
	ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата");
	Если ДатаДокумента < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		Возврат ТабТоваров
	КонецЕсли;
	
	Если ДатаДокумента < глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда
		Возврат ТабТоваров;
	КонецЕсли;

	Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНадокумент, "флСпособПроведения") = Перечисления.СпособыПроведенияДокументов.ТолькоВзаиморасчеты Тогда
		Возврат ТабТоваров;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	&ВидДвижения,
	               |	ВозвратТоваровПоставщикуТовары.Ссылка КАК Регистратор,
	               |	ВозвратТоваровПоставщикуТовары.Ссылка.Дата КАК Период,
	               |	ВозвратТоваровПоставщикуТовары.Ссылка.Склад КАК Склад,
	               |	ВозвратТоваровПоставщикуТовары.Номенклатура,
	               |	ВозвратТоваровПоставщикуТовары.Качество,
	               |	-ВозвратТоваровПоставщикуТовары.Количество КАК Количество
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	               |ГДЕ
	               |	ВозвратТоваровПоставщикуТовары.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТабТоваров);
	ПроведениеДокументовКлиентСервер.ЗаписатьЗначение(вхПараметры, "ТаблицаТоваров", ТабТоваров);
	
	Возврат ТабТоваров;
	
КонецФункции

Функция РегистрыНакопления_ПартииТоваров(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено)
	ТабТоваров = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ПартииТоваров", ТабТоваров);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата") < глЗначениеПеременной("ДатаЗапускаПроведенияПоПартиямРезервам") Тогда
		Возврат ТабТоваров;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНадокумент, "флСпособПроведения") = Перечисления.СпособыПроведенияДокументов.ТолькоВзаиморасчеты Тогда
		Возврат ТабТоваров;
	КонецЕсли;
	
	//Если ПараметрыСеанса.ОпределятьСтратегиюПогашенияПартийТоваровПоСкладу Тогда
	//	Запрос = Новый Запрос(
	//	"ВЫБРАТЬ
	//	|	ВозвратТоваровПоставщику.Склад.СкладVMI КАК Значение
	//	|ИЗ
	//	|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	//	|ГДЕ
	//	|	ВозвратТоваровПоставщику.Ссылка = &Ссылка"
	//	);
	//	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	//	ТабЗ = Запрос.Выполнить().Выгрузить();
	//	Если ТабЗ.Количество() = 0 Тогда
	//		СкладВМИ = Ложь;
	//	Иначе
	//		СкладВМИ = ТабЗ[0].Значение;
	//	КонецЕсли;
	//	
	//	Если НЕ СкладВМИ Тогда
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ПроведениеДокументовКлиентСервер.ПогашениеПартийТоваров(вхСсылкаНадокумент, "ПартииТоваров", вхПараметры),ТабТоваров);
	//	КонецЕсли;
	//Иначе
	//	
	//	Если Не вхПараметры.Свойство("ДвиженияПартииТоваров", ТабТоваров) Тогда
	//		
	//		ПроведениеДокументовКлиентСервер.ПогашениеПартийТоваров(вхСсылкаНаДокумент, вхПараметры);
	//		ТабТоваров = вхПараметры.ДвиженияПартииТоваров;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	ПроведениеДокументовКлиентСервер.ЗаписатьЗначение(вхПараметры, "ТаблицаПартийТоваров", ТабТоваров);
	
	Возврат ТабТоваров;
	
КонецФункции

Функция РегистрыНакопления_Закупки(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено)
	//ТабТоваров = Новый ТаблицаЗначений;
	//Если НЕ ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "ТаблицаТоваров", ТабТоваров) Тогда
	//	ТабТоваров = РегистрыНакопления_ТоварыНаСкладах(вхСсылкаНаДокумент, вхОтказ);
	//КонецЕсли;
	//ТабПартийТоваров = Новый ТаблицаЗначений;
	//Если НЕ ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "ТаблицаПартийТоваров", ТабПартийТоваров) Тогда
	//	ТабПартийТоваров = РегистрыНакопления_ПартииТоваровУпр(вхСсылкаНаДокумент, вхОтказ);
	//КонецЕсли;
	//вхПериод = вхСсылкаНаДокумент.МоментВремени();
	//вхДоговорКонтрагента = ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНаДокумент, "ДоговорКонтрагента");
	
	ТабЗакупки = Новый ТаблицаЗначений;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("Закупки", ТабЗакупки);
	//
	//Для Каждого Партия Из ТабПартийТоваров Цикл
	//	Закупки = ОборотыПоРегиструЗакупки(Партия.СтрокаПрихода, вхДоговорКонтрагента, вхПериод);
	//	Если Закупки.Количество() > 0  Тогда
	//		нс = ТабЗакупки.Добавить();
	//		нс.Период = вхПериод.Дата;
	//		нс.Регистратор = вхСсылкаНаДокумент;
	//		нс.ЕдиницаИзмерения = Партия.ЕдиницаИзмерения;
	//		нс.ДоговорКонтрагента = вхДоговорКонтрагента;
	//		нс.ТорговаяТочка = Закупки[0].ТорговаяТочка;
	//		нс.СтрокаПрихода = Закупки[0].СтрокаПрихода;
	//		нс.Количество = Партия.Количество;
	//		нс.СуммаРегл = Окр(Партия.Количество * Закупки[0].СуммаРегл / Закупки[0].Количество, 2);
	//		нс.СуммаУпр = Окр(Партия.Количество * Закупки[0].СуммаУпр / Закупки[0].Количество, 2);
	//					
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
	Возврат ТабЗакупки;
	
КонецФункции

Функция РегистрыНакопления_Взаиморасчеты(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено)
	
	табВзаиморасчеты = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("Взаиморасчеты", табВзаиморасчеты);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата") < ПараметрыСеанса.ДатаНачалаРаботыВзаиморасчеты Тогда
		Возврат табВзаиморасчеты
	КонецЕсли;
	
	СформироватьДвижения = Истина;
	
	СтруктураРеквизитов = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(вхСсылкаНаДокумент, 
		"ДоговорКонтрагента,ВалютаДокумента,КурсВзаиморасчетов,КратностьВзаиморасчетов,СуммаДокумента");
		
	Если ТипЗнч(вхПараметры) = Тип("Структура") И вхПараметры.Свойство("Фильтр") 
		И ТипЗнч(вхПараметры.Фильтр) = Тип("Структура") И вхПараметры.Фильтр.Свойство("ДоговорКонтрагента") 
		И НЕ вхПараметры.Фильтр.ДоговорКонтрагента = СтруктураРеквизитов.ДоговорКонтрагента Тогда
		СформироватьДвижения = Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНадокумент, "флСпособПроведения") = Перечисления.СпособыПроведенияДокументов.ТолькоТовары Тогда
		СформироватьДвижения = Ложь;
	КонецЕсли;
	
	Если СформироватьДвижения Тогда
			
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(УправлениеВзаиморасчетами.ПростоеПроведениеПоВзаиморасчетам(вхСсылкаНаДокумент, СтруктураРеквизитов.ДоговорКонтрагента, ,
			СтруктураРеквизитов.ВалютаДокумента, СтруктураРеквизитов.КурсВзаиморасчетов, СтруктураРеквизитов.КратностьВзаиморасчетов, 
			СтруктураРеквизитов.СуммаДокумента, -1), табВзаиморасчеты);
			
	КонецЕсли;
		
	Возврат табВзаиморасчеты;
	
КонецФункции

//// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьМетаданные()
	Возврат Метаданные.Документы.ВозвратТоваровПоставщику;	
КонецФункции

Функция ПолучитьРеквизитыКонтроля(вхПараметр = Неопределено) Экспорт
	Результат = Новый Структура;
	Результат.Вставить("Шапка", "Дата,Проведен");
	Возврат Результат;
КонецФункции

Функция ПолучитьЗначенияРеквизитовКонтроля(вхСсылкаНаОбъект, вхПараметр = Неопределено) Экспорт
	Возврат	РаботаСПоследовательностямиКлиентСервер.ПолучитьЗначенияРеквизитовКонтроля(вхСсылкаНаОбъект, вхПараметр);
КонецФункции

Функция ПолучитьДанныеГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхФильтр = Неопределено) Экспорт
	
	Результат = Неопределено;
	лМетаданныеПоследовательности = Неопределено;
	Если (ТипЗнч(вхПоследовательность) = Тип("Строка")) тогда
		лМетаданныеПоследовательности = Метаданные.Последовательности.Найти(вхПоследовательность);
	ИначеЕсли (ТипЗнч(вхПоследовательность) = Тип("ОбъектМетаданных")) И Метаданные.Последовательности.Содержит(вхПоследовательность) тогда
		лМетаданныеПоследовательности = вхПоследовательность;
	КонецЕсли;
	
	Если (лМетаданныеПоследовательности = Неопределено) тогда
		ВызватьИсключение "[ПолучитьДанныеГраницПоследовательности]: неправильный параметр номер 2.";	
	КонецЕсли;
	
	Если (лМетаданныеПоследовательности = Метаданные.Последовательности.ПоРасчетамСКонтрагентами) тогда
		Результат = ПроведениеДокументовКлиентСервер.ЗначенияДвиженийДокумента(вхСсылкаНаДокумент,
		Метаданные.РегистрыНакопления.Взаиморасчеты, вхФильтр);
	ИначеЕсли (лМетаданныеПоследовательности = Метаданные.Последовательности.ПартионныйУчет) тогда	
		Результат = ПроведениеДокументовКлиентСервер.ЗначенияДвиженийДокумента(вхСсылкаНаДокумент,
		Метаданные.РегистрыНакопления.ПартииТоваров, вхФильтр);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхПараметры = Неопределено)
	РаботаСПоследовательностямиКлиентСервер.НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхПараметры);	
КонецПроцедуры

Процедура ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхПараметры = Неопределено)
	РаботаСПоследовательностямиКлиентСервер.ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхПараметры);	
КонецПроцедуры

Функция ТаблицыДляРасчетаСписанияПоПартиям(вхСсылкаНаДокумент, вхФильтр = Неопределено) Экспорт
	
	УчитыватьПоставщика = Ложь;  //Для не возвратов поставщику, поставщика не учитываем
	
	ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата");
	
	Если ДатаДокумента < глЗначениеПеременной("ДатаВозвратыПоставщиковСоздаютсяВ83") Тогда 
		УчитыватьПоставщика = Ложь; //Если возвраты поставщиков не создаются в 8.3, то не учитываем поставщика  
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ВозвратТоваровПоставщику.КонтрагентДляСписанияПартий = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		               |			ТОГДА ВозвратТоваровПоставщику.Контрагент.Организация
		               |		ИНАЧЕ ВозвратТоваровПоставщику.КонтрагентДляСписанияПартий.Организация
		               |	КОНЕЦ КАК СобственнаяОрганизация
		               |ИЗ
		               |	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		               |ГДЕ
		               |	ВозвратТоваровПоставщику.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			УчитыватьПоставщика = Не ЗначениеЗаполнено(Выборка.СобственнаяОрганизация); //Не учитываем поставщика партии, если поставщик - наша организация
		КонецЕсли;
	КонецЕсли;
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВозвратТоваровПоставщикуТовары.Номенклатура КАК Номенклатура,
	               |	ВозвратТоваровПоставщикуТовары.Ссылка.Склад КАК Склад,
	               |	ВозвратТоваровПоставщикуТовары.Качество КАК Качество,
	               |	ВозвратТоваровПоставщикуТовары.СтрокаПрихода КАК СтрокаПрихода,
	               |	ВозвратТоваровПоставщикуТовары.СтрокаПрихода = &ПустаяСтрокаПрихода КАК ПустаяСтрокаПрихода,
	               |	ВЫБОР
	               |		КОГДА ВозвратТоваровПоставщикуТовары.Ссылка.Склад.СкладVMI
	               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
	               |	КОНЕЦ КАК СтатусПартии,
	               |	ВозвратТоваровПоставщикуТовары.Количество КАК Количество,
	               |	""Cписание"" КАК ВидСписания,
	               |	ЛОЖЬ КАК ОприходоватьПоVMI,
	               |	ВозвратТоваровПоставщикуТовары.Ссылка.Склад.ПриРазмещенииИгнорироватьСтатусПартии КАК ИгнорироватьСтатусПартии,
	               |	ВозвратТоваровПоставщикуТовары.Ссылка.Организация КАК Организация,
	               |	&УчитыватьПоставщика КАК УчитыватьПоставщика,
	               |	ВЫБОР
	               |		КОГДА ВозвратТоваровПоставщикуТовары.Ссылка.КонтрагентДляСписанияПартий = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |			ТОГДА ВозвратТоваровПоставщикуТовары.Ссылка.Контрагент
	               |		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Ссылка.КонтрагентДляСписанияПартий
	               |	КОНЕЦ КАК Поставщик,
	               |	ВЫБОР
	               |		КОГДА ВозвратТоваровПоставщикуТовары.Ссылка.Склад.СкладVMI
	               |			ТОГДА &ВидДоговора1
	               |		ИНАЧЕ &ВидДоговора2
	               |	КОНЕЦ КАК ВидДоговора,
	               |	ВозвратТоваровПоставщикуТовары.НомерСтроки КАК НомерСтрокиВДокументе
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	               |ГДЕ
	               |	ВозвратТоваровПоставщикуТовары.Ссылка = &Ссылка
	               |	И ВозвратТоваровПоставщикуТовары.Ссылка.флСпособПроведения <> &флСпособПроведения";
				   
	Если ТипЗнч(вхФильтр) = Тип("Структура") и вхФильтр.Свойство("Номенклатура") Тогда 
		Запрос.Текст = Запрос.Текст + " И ВозвратТоваровПоставщикуТовары.Номенклатура = &Номенклатура";
		Запрос.УстановитьПараметр("Номенклатура", вхФильтр.Номенклатура);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ПустаяСтрокаПрихода", Справочники.ИдентификаторыСтрокПриходов.ПустаяСсылка());
	Запрос.УстановитьПараметр("флСпособПроведения", Перечисления.СпособыПроведенияДокументов.ТолькоВзаиморасчеты);
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("УчитыватьПоставщика", УчитыватьПоставщика);
	Запрос.УстановитьПараметр("ВидДоговора1", Перечисления.ВидыДоговоровКонтрагентов.ОтветХранение);
	Запрос.УстановитьПараметр("ВидДоговора2", Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ТаблицаДляКонтроляОстатков(вхСсылкаНаДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Док.Ссылка.Склад КАК Склад,
	               |	Док.Номенклатура КАК Номенклатура,
	               |	Док.Качество КАК Качество,
	               |	СУММА(Док.Количество) КАК Количество
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику.Товары КАК Док
	               |ГДЕ
	               |	Док.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Док.Ссылка.Склад,
	               |	Док.Номенклатура,
	               |	Док.Качество";
				   
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция ПолучитьЗаписиПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, Проведение) Экспорт 
	лМетаданныеПоследовательности = Неопределено;	
	Если (ТипЗнч(вхПоследовательность) = Тип("Строка")) тогда
		лМетаданныеПоследовательности = Метаданные.Последовательности.Найти(вхПоследовательность);
	ИначеЕсли (ТипЗнч(вхПоследовательность) = Тип("ОбъектМетаданных")) И Метаданные.Последовательности.Содержит(вхПоследовательность) тогда
		лМетаданныеПоследовательности = вхПоследовательность;
	КонецЕсли;
	
	Если (лМетаданныеПоследовательности = Неопределено) тогда
		ВызватьИсключение "[ПолучитьДанныеДляПоследовательности]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лМетаданныеДокумента = вхСсылкаНаДокумент.Метаданные();
	Если НЕ лМетаданныеПоследовательности.Документы.Содержит(лМетаданныеДокумента) тогда
		ВызватьИсключение "[ПолучитьДанныеДляПоследовательности]: неправильный параметр номер 1.";
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "СуммаДокумента, Дата, ДоговорКонтрагента");
	лРезультат = ОбщегоНазначения.СоздатьСтруктуруПоследовательности(лМетаданныеПоследовательности);
	Если (лМетаданныеПоследовательности = Метаданные.Последовательности.ПартионныйУчет) тогда
		Если Проведение 
			И Реквизиты.Дата >= ПараметрыСеанса.ДатаНачалаРаботыТовары 
			И Реквизиты.Дата >= глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ВозвратТоваровПоставщикуТовары.Ссылка.Дата КАК Период,
			               |	ВозвратТоваровПоставщикуТовары.Ссылка КАК Регистратор,
			               |	ВозвратТоваровПоставщикуТовары.Номенклатура КАК Номенклатура
			               |ИЗ
			               |	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
			               |ГДЕ
			               |	ВозвратТоваровПоставщикуТовары.Ссылка = &Ссылка
			               |	И ВозвратТоваровПоставщикуТовары.Ссылка.флСпособПроведения <> &флСпособПроведения";
			Запрос.УстановитьПараметр("флСпособПроведения", Перечисления.СпособыПроведенияДокументов.ТолькоВзаиморасчеты);
			Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл 
				ЗаполнитьЗначенияСвойств(лРезультат.Добавить(), Выборка); 
			КонецЦикла;
		КонецЕсли;		
	ИначеЕсли (лМетаданныеПоследовательности = Метаданные.Последовательности.ПоРасчетамСКонтрагентами) Тогда 
		ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизиты.ДоговорКонтрагента, "ВидДоговора");
		Если Проведение И (Реквизиты.СуммаДокумента <> 0) И Реквизиты.Дата >= ПараметрыСеанса.ДатаНачалаРаботыВзаиморасчеты
			И НЕ(ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ОтветХранение) тогда			
			
			лСтрокаРезультат = лРезультат.Добавить();
			лСтрокаРезультат.ДоговорКонтрагента = Реквизиты.ДоговорКонтрагента;
			лСтрокаРезультат.Период = Реквизиты.Дата;
			лСтрокаРезультат.Регистратор = вхСсылкаНаДокумент;
		КонецЕсли;
	Иначе
		
		ВызватьИсключение "[ПолучитьЗаписиПоследовательности]: неправильный параметр номер 1.";
		
	КонецЕсли;
	
	Результат = ПроведениеДокументовКлиентСервер.ПолучитьМоментыВремени(лМетаданныеПоследовательности, лРезультат);
	Возврат Результат;
	
КонецФункции

//Выгрузка при обмене
Функция ВыгрузитьЭлементы(вхТаблицаСсылокНаОбъекты, вхПланОбмена) Экспорт
	
	Для Каждого СтрокаОб Из вхТаблицаСсылокНаОбъекты Цикл 
		ЗаполнитьСтрокиЗаявок(СтрокаОб.Ссылка);
	КонецЦикла;
	
	Результат = Новый Массив;
	
	лМетаданныеПланаОбмена = Неопределено;
	лТип = ТипЗнч(вхПланОбмена);
	Если (лТип = Тип("Строка")) тогда
		лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.Найти(вхПланОбмена);
	ИначеЕсли (лТип = Тип("ОбъектМетаданных")) И Метаданные.ПланыОбмена.Содержит(вхПланОбмена) тогда
		лМетаданныеПланаОбмена = вхПланОбмена;
	КонецЕсли;
	
	Если (лМетаданныеПланаОбмена = Неопределено) тогда
		ВызватьИсключение "[ВыгрузитьЭлементы]: неправильный параметр номер 2.";
	КонецЕсли;
	
	Если лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog Тогда 
		
		лМенеджерПланаОбмена = ПланыОбмена[лМетаданныеПланаОбмена.Имя];
		
		лЗапрос = Новый Запрос;
		лЗапрос.УстановитьПараметр("ТаблицаСсылок", вхТаблицаСсылокНаОбъекты);
		лЗапрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Ссылка
		|ПОМЕСТИТЬ Объекты
		|ИЗ
		|	&ТаблицаСсылок КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратТоваровПоставщику.Ссылка КАК Ссылка,
		|	ВозвратТоваровПоставщику.Номер,
		|	ВозвратТоваровПоставщику.Дата,
		|	ВозвратТоваровПоставщику.Склад.ФизическийСклад КАК Склад,
		|	ЕСТЬNULL(ВозвратТоваровПоставщику.ТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка)) КАК Контрагент,
		|	ВозвратТоваровПоставщику.Организация КАК Организация,
		|	ВозвратТоваровПоставщикуТовары.Номенклатура,
		|	ВозвратТоваровПоставщикуТовары.Номенклатура.Наименование,
		|	ВозвратТоваровПоставщикуТовары.Номенклатура.Артикул,
		|	ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.СтрокаЗаявки.IDSite, """") КАК SSID,
		|	ЛОЖЬ КАК КроссСток,
		|	ВЫБОР
		|		КОГДА ВозвратТоваровПоставщикуТовары.Ссылка.СозданИзАкта
		|			ТОГДА ВозвратТоваровПоставщикуТовары.КоличествоБрак + ВозвратТоваровПоставщикуТовары.КоличествоИзлишек - ВозвратТоваровПоставщикуТовары.КоличествоВозвращено
		|		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Количество
		|	КОНЕЦ КАК Количество,
		|	ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка) КАК Клиент,
		|	"""" КАК КлиентНаименование,
		|	ЛОЖЬ КАК ЭтоЮридическоеЛицо,
		|	ЕСТЬNULL(ВозвратТоваровПоставщику.ТорговаяТочка.Город, ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка)) КАК Город,
		|	ЕСТЬNULL(ВозвратТоваровПоставщику.ТорговаяТочка.Город.Наименование, """") КАК ГородНаименование,
		|	ЕСТЬNULL(ВозвратТоваровПоставщику.ТорговаяТочка.МаршрутДоставки.Код, """") КАК МаршрутДоставкиКод,
		|	ЕСТЬNULL(ВозвратТоваровПоставщику.ТорговаяТочка.МаршрутДоставки.Наименование, """") КАК МаршрутДоставкиНаименование,
		|	ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка) КАК СкладПолучатель
		|ИЗ
		|	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		|		ПО ВозвратТоваровПоставщикуТовары.Ссылка = ВозвратТоваровПоставщику.Ссылка
		|ГДЕ
		|	ВозвратТоваровПоставщику.Ссылка В
		|			(ВЫБРАТЬ
		|				Объекты.Ссылка
		|			ИЗ
		|				Объекты)
		|	И ВозвратТоваровПоставщикуТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				Объекты.Ссылка
		|			ИЗ
		|				Объекты)
		|	И ВозвратТоваровПоставщику.Склад.ОбменСTopLog
		|ИТОГИ ПО
		|	Ссылка";
		
		лРезультатыЗапроса = лЗапрос.ВыполнитьПакет();
		
		Если НЕ лРезультатыЗапроса[1].Пустой() Тогда
			лТипОбъектаXDTO = ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ЗаказНаОтгрузку");
			лВыборка = лРезультатыЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
			
			Пока лВыборка.Следующий() Цикл
								
				лОбъект = ФабрикаXDTO.Создать(лТипОбъектаXDTO);
				
				ЗаполнитьЗначенияСвойств(лОбъект, лВыборка, "Номер,Дата");
				лОбъект.ДатаОтгрузки = 	КонецГода(ТекущаяДата());
				лОбъект.СуммаДокумента = 0;
				лОбъект.ВидДокумента = "ВозвратТоваровПоставщику";
				лОбъект.Ссылка = XMLСтрока(лВыборка.Ссылка);
				лОбъект.СкладСсылка = XMLСтрока(лВыборка.Склад);
				лОбъект.КонтрагентСсылка = XMLСтрока(лВыборка.Контрагент);
				лОбъект.ОрганизацияСсылка = XMLСтрока(лВыборка.Организация);
				лОбъект.ТипДоставки = "";
				лОбъект.СкладПолучательСсылка = XMLСтрока(лВыборка.СкладПолучатель);
				лОбъект.МаршрутДоставкиКод = лВыборка.МаршрутДоставкиКод;
				
				ОбменДаннымиКлиентСервер.ДополнитьДаннымиПоПечати(лОбъект, лВыборка.Ссылка);
				
				лТовары = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ЗаказНаОтгрузку.Товары"));
				лТоварыСписок = лТовары.ПолучитьСписок("СтрокаТовары");
				
				ВыборкаПоТоварам = лВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоТоварам.Следующий() Цикл
					НоваяСтрока = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), лТоварыСписок.ВладеющееСвойство.Тип.Имя)); 
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоТоварам, "НоменклатураНаименование,НоменклатураАртикул,SSID,КроссСток,Количество,КлиентНаименование,ЭтоЮридическоеЛицо");
					НоваяСтрока.НоменклатураСсылка = XMLСтрока(ВыборкаПоТоварам.Номенклатура);
					НоваяСтрока.КлиентСсылка = XMLСтрока(ВыборкаПоТоварам.Клиент);
					//НоваяСтрока.ГородСсылка = XMLСтрока(ВыборкаПоТоварам.Город);
					//НоваяСтрока.МаршрутДоставкиСсылка = XMLСтрока(ВыборкаПоТоварам.МаршрутДоставки);
					НоваяСтрока.Цена = 0;
					НоваяСтрока.ГТД = "";
					НоваяСтрока.СтранаКод = "";
					НоваяСтрока.СтранаНаименование = "";
					лТоварыСписок.Добавить(НоваяСтрока);
				КонецЦикла;	
				
				лОбъект.Товары = лТовары;
				Результат.Добавить(лОбъект);
				// Помечаем объект как выгруженный
				ДокОб = лВыборка.Ссылка.ПолучитьОбъект();
				ДокОб.ВыгруженВТопЛог = Истина;
				ДокОб.Записать(РежимЗаписиДокумента.Запись);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьЭлемент(ОбъектXDTO, вхОтправитель, Отказ, вхПараметры = Неопределено) Экспорт
	лМетаданныеПланаОбмена = Метаданные.НайтиПоТипу(ТипЗнч(вхОтправитель));
	Если (лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog) Тогда 
		Если ОбъектXDTO.Тип().Имя = "РезультатСборки" Тогда 
			Попытка
				ЗагрузитьРезультатСборки(ОбъектXDTO);
			Исключение
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("ОбъектXDTO", ОбъектXDTO.Тип().Имя);
				СтруктураОшибки.Вставить("GUID", ОбъектXDTO.ЗаказСсылка);
				СтруктураОшибки.Вставить("ИмяОбъектаМетаданных", "ВозвратТоваровПоставщику");
				СтруктураОшибки.Вставить("СообщениеОбОшибке", ОписаниеОшибки());
				СтруктураОшибки.Вставить("НомерСообщения", вхПараметры.НомерСообщения);
				СтруктураОшибки.Вставить("ДатаЗагрузкиСообщения", ТекущаяДата());
				ОбменДаннымиКлиентСервер.ЗаписатьОшибкиПриОбменеСТопЛог(СтруктураОшибки);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьРезультатСборкиСтарое(ОбъектXDTO)
	
	ДокСсылка = Документы.ВозвратТоваровПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗаказСсылка));
	
	Если ОбменДаннымиКлиентСервер.ЭтоБитаяСсылка(ДокСсылка) Тогда 
		ВызватьИсключение "Не найдена возврат товаров поставщику с guid = " + ОбъектXDTO.ЗаказСсылка;
	КонецЕсли;
	
	ТоварыXDTO = ОбъектXDTO.Товары.ПолучитьСписок("СтрокаТовары");
	
	МассивSSID = Новый Массив;
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
		Если ЗначениеЗаполнено(СтрокаТовары.SSID) Тогда 
			МассивSSID.Добавить(СтрокаТовары.SSID);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ИдентификаторыСтрокЗаявок.Ссылка КАК СтрокаЗаявки,
	                |	ИдентификаторыСтрокЗаявок.IDSite КАК SSID
	                |ИЗ
	                |	Справочник.ИдентификаторыСтрокЗаявок КАК ИдентификаторыСтрокЗаявок
	                |ГДЕ
	                |	ИдентификаторыСтрокЗаявок.IDSite В(&МассивSSID)";
	Запрос.УстановитьПараметр("МассивSSID", МассивSSID);
	
	СоотвSSID = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		СоотвSSID.Вставить(Выборка.SSID, Выборка.СтрокаЗаявки);	
	КонецЦикла;
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	Товары.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
	//Товары.Колонки.Добавить("План", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	Товары.Колонки.Добавить("Факт", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.НоменклатураСсылка));
		НоваяСтрока.СтрокаЗаявки = СоотвSSID[СтрокаТовары.SSID];
		Если ЗначениеЗаполнено(СтрокаТовары.SSID) И Не ЗначениеЗаполнено(НоваяСтрока.СтрокаЗаявки) Тогда 
			ВызватьИсключение "Не найдена строка заявки с IDSite = " + СтрокаТовары.SSID;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары, "Факт");
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВозвратТоваровПоставщику.Ссылка
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	               |ГДЕ
	               |	ВозвратТоваровПоставщику.Ссылка = &Ссылка
	               |	И НЕ ВозвратТоваровПоставщику.ПометкаУдаления
	               |	И ВозвратТоваровПоставщику.Проведен";
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);			   
	НужноМенятьШапку = Запрос.Выполнить().Пустой();
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ВозвратТоваровПоставщикуТовары.Номенклатура,
	              |	ВозвратТоваровПоставщикуТовары.СтрокаЗаявки,
	              |	ВозвратТоваровПоставщикуТовары.КоличествоБрак + ВозвратТоваровПоставщикуТовары.КоличествоИзлишек - ВозвратТоваровПоставщикуТовары.КоличествоВозвращено КАК Факт
	              |ИЗ
	              |	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	              |ГДЕ
	              |	ВозвратТоваровПоставщикуТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);			  
	ТоварыДокумента = Запрос.Выполнить().Выгрузить();
	
	Дельта = Неопределено;
	НужноМенятьТЧ = Не РаботаСПоследовательностямиКлиентСервер.ТаблицыИдентичныНовое(ТоварыДокумента, Товары, Дельта, "Факт");
	Если НужноМенятьШапку Или НужноМенятьТЧ Тогда 
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		Для Каждого СтрокаДельты Из Дельта Цикл 
			Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура,СтрокаЗаявки", СтрокаДельты.Номенклатура, СтрокаДельты.СтрокаЗаявки));	
			КоличествоРаспределить = - СтрокаДельты.Факт;
			Индекс = 0;
			Пока КоличествоРаспределить > 0 И Индекс < Строки.Количество() Цикл 
				СтрокаТЧ = Строки.Получить(Индекс);
				Факт = Мин(КоличествоРаспределить, СтрокаТЧ.КоличествоБрак + СтрокаТЧ.КоличествоИзлишек - СтрокаТЧ.КоличествоВозвращено);
				
				//Уменьшаем сначала излишек
				Если СтрокаТЧ.КоличествоИзлишек - СтрокаТЧ.КоличествоВозвращено > 0 Тогда 
					СписываемоеКоличествоИзлишек = Мин(СтрокаТЧ.КоличествоИзлишек - СтрокаТЧ.КоличествоВозвращено, Факт);
					СтрокаТЧ.КоличествоИзлишек = СтрокаТЧ.КоличествоИзлишек - СписываемоеКоличествоИзлишек;
					Факт = Факт - СписываемоеКоличествоИзлишек;
					КоличествоРаспределить = КоличествоРаспределить - СписываемоеКоличествоИзлишек;
					УчтенныйВозврат = СтрокаТЧ.КоличествоВозвращено;
				Иначе
					УчтенныйВозврат = СтрокаТЧ.КоличествоИзлишек;
				КонецЕсли;
				
				Если Факт > 0 Тогда 
					//Списываем брак
					СписываемоеКоличествоБрак = Мин(СтрокаТЧ.КоличествоБрак - (СтрокаТЧ.КоличествоВозвращено - УчтенныйВозврат), Факт);
					
					СтрокаТЧ.КоличествоБрак = СтрокаТЧ.КоличествоБрак - СписываемоеКоличествоБрак;
					СтрокаТЧ.Количество = СтрокаТЧ.Количество - СписываемоеКоличествоБрак;
					
					ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТЧ, ДокОбъект);
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, ДокОбъект);
					
					КоличествоРаспределить = КоличествоРаспределить - СписываемоеКоличествоБрак;
				КонецЕсли;
				
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЦикла;
		
		ДокОбъект.ПометкаУдаления = Ложь;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьРезультатСборки(ОбъектXDTO)
	
	ДокСсылка = Документы.ВозвратТоваровПоставщику.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗаказСсылка));
	
	Если ОбменДаннымиКлиентСервер.ЭтоБитаяСсылка(ДокСсылка) Тогда 
		ВызватьИсключение "Не найдена возврат товаров поставщику с guid = " + ОбъектXDTO.ЗаказСсылка;
	КонецЕсли;
	
	ТоварыXDTO = ОбъектXDTO.Товары.ПолучитьСписок("СтрокаТовары");
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	Товары.Колонки.Добавить("Факт", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.НоменклатураСсылка));
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары, "Факт");
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВозвратТоваровПоставщику.Ссылка
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	               |ГДЕ
	               |	ВозвратТоваровПоставщику.Ссылка = &Ссылка
	               |	И НЕ ВозвратТоваровПоставщику.ПометкаУдаления
	               |	И ВозвратТоваровПоставщику.Проведен
	               |	И ВозвратТоваровПоставщику.ОбновленИзТопЛог";
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);			   
	НужноМенятьШапку = Запрос.Выполнить().Пустой();
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ВозвратТоваровПоставщикуТовары.Номенклатура,
	              |	ВЫБОР
	              |		КОГДА ВозвратТоваровПоставщикуТовары.Ссылка.СозданИзАкта
	              |			ТОГДА ВозвратТоваровПоставщикуТовары.КоличествоБрак + ВозвратТоваровПоставщикуТовары.КоличествоИзлишек - ВозвратТоваровПоставщикуТовары.КоличествоВозвращено
	              |		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Количество
	              |	КОНЕЦ КАК Факт
	              |ИЗ
	              |	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	              |ГДЕ
	              |	ВозвратТоваровПоставщикуТовары.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);			  
	ТоварыДокумента = Запрос.Выполнить().Выгрузить();
	
	Дельта = Неопределено;
	НужноМенятьТЧ = Не РаботаСПоследовательностямиКлиентСервер.ТаблицыИдентичныНовое(ТоварыДокумента, Товары, Дельта, "Факт");
	Если НужноМенятьШапку Или НужноМенятьТЧ Тогда 
		СозданИзАкта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСсылка, "СозданИзАкта");
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		Для Каждого СтрокаДельты Из Дельта Цикл 
			Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаДельты.Номенклатура));	
			Индекс = 0;
			Если СтрокаДельты.Факт < 0 Тогда  
				КоличествоРаспределить = - СтрокаДельты.Факт;
				Пока КоличествоРаспределить > 0 И Индекс < Строки.Количество() Цикл 
					СтрокаТЧ = Строки.Получить(Индекс);
					Если СозданИзАкта Тогда 
						Факт = Мин(КоличествоРаспределить, СтрокаТЧ.КоличествоБрак + СтрокаТЧ.КоличествоИзлишек - СтрокаТЧ.КоличествоВозвращено);
						//Уменьшаем сначала излишек
						Если СтрокаТЧ.КоличествоИзлишек - СтрокаТЧ.КоличествоВозвращено > 0 Тогда 
							СписываемоеКоличествоИзлишек = Мин(СтрокаТЧ.КоличествоИзлишек - СтрокаТЧ.КоличествоВозвращено, Факт);
							СтрокаТЧ.КоличествоИзлишек = СтрокаТЧ.КоличествоИзлишек - СписываемоеКоличествоИзлишек;
							Факт = Факт - СписываемоеКоличествоИзлишек;
							КоличествоРаспределить = КоличествоРаспределить - СписываемоеКоличествоИзлишек;
							УчтенныйВозврат = СтрокаТЧ.КоличествоВозвращено;
						Иначе
							УчтенныйВозврат = СтрокаТЧ.КоличествоИзлишек;
						КонецЕсли;
						
						Если Факт > 0 Тогда 
							//Списываем брак
							СписываемоеКоличествоБрак = Мин(СтрокаТЧ.КоличествоБрак - (СтрокаТЧ.КоличествоВозвращено - УчтенныйВозврат), Факт);
							
							СтрокаТЧ.КоличествоБрак = СтрокаТЧ.КоличествоБрак - СписываемоеКоличествоБрак;
							СтрокаТЧ.Количество = СтрокаТЧ.Количество - СписываемоеКоличествоБрак;
							
							ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТЧ, ДокОбъект);
							ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, ДокОбъект);
							
							КоличествоРаспределить = КоличествоРаспределить - СписываемоеКоличествоБрак;
						КонецЕсли;
					Иначе
						Факт = Мин(КоличествоРаспределить, СтрокаТЧ.Количество);
						СтрокаТЧ.Количество = СтрокаТЧ.Количество - Факт;
						ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТЧ, ДокОбъект);
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, ДокОбъект);
						
						КоличествоРаспределить = КоличествоРаспределить - Факт;
					КонецЕсли;
					
					Индекс = Индекс + 1;
				КонецЦикла;
			Иначе
				КоличествоРаспределить = СтрокаДельты.Факт;
				Пока КоличествоРаспределить > 0 И Индекс < Строки.Количество() Цикл 
					СтрокаТЧ = Строки.Получить(Индекс);
					Если СозданИзАкта Тогда 
						Если СтрокаТЧ.КоличествоБрак > 0 Тогда 
							СтрокаТЧ.КоличествоБрак = СтрокаТЧ.КоличествоБрак + КоличествоРаспределить;
							СтрокаТЧ.Количество = СтрокаТЧ.КоличествоБрак + СтрокаТЧ.КоличествоНедостача - СтрокаТЧ.КоличествоВозвращено;
							ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТЧ, ДокОбъект);
							ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, ДокОбъект);
						Иначе
							СтрокаТЧ.КоличествоИзлишек = СтрокаТЧ.КоличествоИзлишек + КоличествоРаспределить;
							КонецЕсли;
						КоличествоРаспределить = 0;
					Иначе
						СтрокаТЧ.Количество = СтрокаТЧ.Количество + КоличествоРаспределить;
						ОбработкаТабличныхЧастей.РассчитатьСуммуТабЧасти(СтрокаТЧ, ДокОбъект);
						ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, ДокОбъект);
						КоличествоРаспределить = 0;
					КонецЕсли;
					Индекс = Индекс + 1;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ДокОбъект.ОбновленИзТопЛог = Истина;
		ДокОбъект.ПометкаУдаления = Ложь;
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиЗаявок(вхСсылкаНаДокумент) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Первые 1
	               |	ВозвратТоваровПоставщикуТовары.НомерСтроки
	               |ИЗ
	               |	Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	               |ГДЕ
	               |	ВозвратТоваровПоставщикуТовары.Ссылка = &Ссылка
	               |	И ВозвратТоваровПоставщикуТовары.СтрокаЗаявки = &ПустаяСтрокаЗаявки";
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("ПустаяСтрокаЗаявки", Справочники.ИдентификаторыСтрокЗаявок.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ДокОбъект = вхСсылкаНаДокумент.ПолучитьОбъект();
	Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("СтрокаЗаявки", Справочники.ИдентификаторыСтрокЗаявок.ПустаяСсылка()));
	
	Для Каждого СтрокаТЧ Из Строки Цикл 
		СтрокаТЧ.СтрокаЗаявки = ОбщегоНазначенияКлиентСервер.ВиртуальнаяСтрокаЗаявки();
	КонецЦикла;
	
	ДокОбъект.Записать();
	
КонецПроцедуры

Процедура ЗарегистрироватьВОбменСТопЛог(вхОбъект) Экспорт 
	
	Строки = вхОбъект.Товары.НайтиСтроки(Новый Структура("СтрокаЗаявки", Справочники.ИдентификаторыСтрокЗаявок.ПустаяСсылка()));
	Если Строки.Количество() > 0 Тогда 
		Для Каждого СтрокаТЧ Из Строки Цикл 
			СтрокаТЧ.СтрокаЗаявки = ОбщегоНазначенияКлиентСервер.ВиртуальнаяСтрокаЗаявки();
		КонецЦикла;
		Сообщить("Созданы виртуальные строки заявок");
	КонецЕсли;
	
	вхОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Узел = ОбменДаннымиКлиентСервер.ПолучитьИсходящийУзелОбмена(Метаданные.ПланыОбмена.ОбменПартКом83_TopLog, 3);
	
	Если ЗначениеЗаполнено(Узел) Тогда 
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, вхОбъект.Ссылка);
		Сообщить("Документ зарегистрирован в обмене с Топ Лог");
	Иначе
		Сообщить("Не найден узел обмена для выгрузки в Топ Лог");
	КонецЕсли;
	
КонецПроцедуры