Функция ЗначениеСвойствОбъектов(Наименование, Владелец) Экспорт 
	Возврат Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Наименование,,, Владелец);
КонецФункции

Функция Свойство_ВидПечатнойФормыДляВозвратаПоставщику() Экспорт 
	Возврат ПланыВидовХарактеристик.СвойстваОбъектов.ВидПечатнойФормыДляВозвратаПоставщику;
КонецФункции

Функция ПолучитьСписокЗначенийСвойств_ВидПечатнойФормыДляВозвратаПоставщику(флРаботает_сКоррСФ) Экспорт 
	СписокЗначений = Новый СписокЗначений;
	
	Если флРаботает_сКоррСФ Тогда 
		СписокЗначений.Добавить(УправлениеСвойствамиПовтИсп.ЗначениеСвойствОбъектов("УПД-2", УправлениеСвойствамиПовтИсп.Свойство_ВидПечатнойФормыДляВозвратаПоставщику()), "УПД (в статусе 2)");
		СписокЗначений.Добавить(УправлениеСвойствамиПовтИсп.ЗначениеСвойствОбъектов("Торг-2", УправлениеСвойствамиПовтИсп.Свойство_ВидПечатнойФормыДляВозвратаПоставщику()));
	Иначе
		СписокЗначений.Добавить(УправлениеСвойствамиПовтИсп.ЗначениеСвойствОбъектов("УПД-1", УправлениеСвойствамиПовтИсп.Свойство_ВидПечатнойФормыДляВозвратаПоставщику()), "УПД (в статусе 1)");
	КонецЕсли;
	
	Возврат СписокЗначений;
КонецФункции

Функция ЗаказНаПриемку() Экспорт 
	Возврат "Документы.ЗаказНаПриемку";
КонецФункции

Функция ЗаказНаОтгрузку() Экспорт 
	Возврат "Документы.ЗаказНаОтгрузку";
КонецФункции