
Функция ПолучитьЗапросПроверки(МассивКонтролей) ЭКСПОРТ
	
	 МассивКонтролей.добавить("РезервыТоваров");
	
	 Возврат  "ВЫБРАТЬ
	          |	РезервыТоваровОстатки.Номенклатура,
	          |	РезервыТоваровОстатки.Склад,
	          |	ЕСТЬNULL(РезервыТоваровОстатки.КоличествоОстаток, 0) - РезервыТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
	          |ИЗ
	          |	РегистрНакопления.РезервыТоваров.Остатки(
	          |			&Период,
	          |			(Номенклатура, Склад) В
	          |				(ВЫБРАТЬ
	          |					РезервыТоваровИзменение.Номенклатура КАК Номенклатура,
	          |					РезервыТоваровИзменение.Склад КАК Склад
	          |				ИЗ
	          |					РезервыТоваровИзменение КАК РезервыТоваровИзменение)) КАК РезервыТоваровОстатки
	          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	          |		ПО РезервыТоваровОстатки.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	          |			И РезервыТоваровОстатки.Склад = ТоварыНаСкладахОстатки.Склад
	          |ГДЕ
	          |	ЕСТЬNULL(РезервыТоваровОстатки.КоличествоОстаток, 0) - РезервыТоваровОстатки.КоличествоОстаток < 0";
	 	
КонецФункции


Процедура СообщитьОбОшибке(РезультатЗапроса,Объект,Отказ) ЭКСПОРТ
	
	 ШаблонСообщения = НСтр("ru = 'Номенклатура %Номенклатура% 
	|Обнаружен отрицательный резерв  ""%Склад%"" на %Количество% '");

	
	ПредыдущаяЗапись = Новый Структура;
	ПредыдущаяЗапись.Вставить("Склад", 				Неопределено);
	ПредыдущаяЗапись.Вставить("Номенклатура", 				Неопределено);
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл   				
		
		Если ПредыдущаяЗапись.Номенклатура <> Выборка.Номенклатура Или ПредыдущаяЗапись.Склад <> Выборка.Склад
		Тогда
			ЗаполнитьЗначенияСвойств(ПредыдущаяЗапись, Выборка);
		Иначе
			Продолжить;
		КонецЕсли;

		
		
		ТекстСообщения = СтрЗаменить(ШаблонСообщения, "%Номенклатура%",Выборка.Номенклатура);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Склад%", Строка(Выборка.Склад) );		
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Количество%", Строка(-Выборка.КоличествоОстаток));
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,Объект,,,Отказ);
	КонецЦикла;
	
КонецПроцедуры

