Процедура СкладMaxoptraНачалоВыбора(Элемент, СтандартнаяОбработка, Склад) Экспорт 
	лКлючАлгоритма = "ОбщийМодуль_ФормированиеСлужебныхЗаданийКлиент_СкладMaxoptraНачалоВыбора";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	

	СтандартнаяОбработка = Ложь;
	ФормаВыбора = Справочники.МегаЛогист_СоответствиеСкладов1СИMaxoptra.ПолучитьФормуВыбора(, Элемент);
	ЭлементОтбора = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Склад");
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Склад;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбораРежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
	Если ФормаВыбора.Открыта() Тогда 
		ФормаВыбора.Обновить();
	Иначе
		ФормаВыбора.Открыть();
	КонецЕсли;
	
КонецПроцедуры
