Функция ПолучитьТекущееРасписание(вхСтруктураОтбора) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика,
	|	РасписанияОтчетовПоставщикамVMI.Организация,
	|	РасписанияОтчетовПоставщикамVMI.Склад,
	|	РасписанияОтчетовПоставщикамVMI.Используется,
	|	РасписанияОтчетовПоставщикамVMI.НачальнаяДата,
	|	РасписанияОтчетовПоставщикамVMI.Периодичность,
	|	РасписанияОтчетовПоставщикамVMI.Частота,
	|	РасписанияОтчетовПоставщикамVMI.ЧислоМесяца,
	|	РасписанияОтчетовПоставщикамVMI.Разделять,
	|	РасписанияОтчетовПоставщикамVMI.КонецМесяцаОтдельно,
	|	РасписанияОтчетовПоставщикамVMI.ЧетНечет,
	|	РасписанияОтчетовПоставщикамVMI.ДеньНедели,
	|	РасписанияОтчетовПоставщикамVMI.Информация,
	|	РасписанияОтчетовПоставщикамVMI.УИД77,
	|	РасписанияОтчетовПоставщикамVMI.ДатаОкончанияПериодаПоследнегоОтчета,
	|	РасписанияОтчетовПоставщикамVMI.СкидкаПроцент,
	|	РасписанияОтчетовПоставщикамVMI.СкидкаСумма,
	|	РасписанияОтчетовПоставщикамVMI.ДелитьОтчетVMI,
	|	РасписанияОтчетовПоставщикамVMI.Задержка
	|ИЗ
	|	РегистрСведений.РасписанияОтчетовПоставщикамVMI КАК РасписанияОтчетовПоставщикамVMI
	|ГДЕ
	|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика = &ПрайсПоставщика"
	);
	
	тхтУсловие = "";
	
	Если ТипЗнч(вхСтруктураОтбора) = Тип("СправочникСсылка.ПрайсыПоставщиковVMI") тогда
		тхтУсловие = тхтУсловие + "
		|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика = &ПрайсПоставщика";
		Запрос.УстановитьПараметр("ПрайсПоставщика", вхСтруктураОтбора);
	ИначеЕсли ТипЗнч(вхСтруктураОтбора) = Тип("СправочникСсылка.Организации") тогда
		тхтУсловие = тхтУсловие + "
		|	РасписанияОтчетовПоставщикамVMI.Организация = &Организация";
		Запрос.УстановитьПараметр("Организация", вхСтруктураОтбора);
	ИначеЕсли ТипЗнч(вхСтруктураОтбора) = Тип("СправочникСсылка.Склады") тогда
		тхтУсловие = тхтУсловие + "
		|	РасписанияОтчетовПоставщикамVMI.Склад = &Склад";
		Запрос.УстановитьПараметр("Склад", вхСтруктураОтбора);
	ИначеЕсли ТипЗнч(вхСтруктураОтбора) = Тип("Структура") тогда
		Если вхСтруктураОтбора.Свойство("ПрайсПоставщика") Тогда
			тхтУсловие = тхтУсловие + ?(ПустаяСтрока(тхтУсловие), "", " И ") + "
			|	РасписанияОтчетовПоставщикамVMI.ПрайсПоставщика = &ПрайсПоставщика";
			Запрос.УстановитьПараметр("ПрайсПоставщика", вхСтруктураОтбора.ПрайсПоставщика);
		КонецЕсли;
		Если вхСтруктураОтбора.Свойство("Организация") Тогда
			тхтУсловие = тхтУсловие + ?(ПустаяСтрока(тхтУсловие), "", " И ") + "
			|	РасписанияОтчетовПоставщикамVMI.Организация = &Организация";
			Запрос.УстановитьПараметр("Организация", вхСтруктураОтбора.Организация);
		КонецЕсли;
		Если вхСтруктураОтбора.Свойство("Склад") Тогда
			тхтУсловие = тхтУсловие + ?(ПустаяСтрока(тхтУсловие), "", " И ") + "
			|	РасписанияОтчетовПоставщикамVMI.Склад = &Склад";
			Запрос.УстановитьПараметр("Склад", вхСтруктураОтбора.Склад);
		КонецЕсли;
	Иначе
		Возврат Неопределено;
		
	КонецЕсли;

	Если НЕ тхтУсловие = ""   тогда
		Запрос.текст = Запрос.Текст + " И " + тхтУсловие;
	КонецЕсли;	
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() > 0 Тогда
		Возврат Результат;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции