Функция ПолучитьЧислоМесяцаДеньНеделиОтчетаСтрокой(Запись)
	Если Запись.Периодичность = Перечисления.Периодичность.Неделя Тогда
		Если Запись.ДеньНедели = 1 Тогда
			Возврат " по понедельникам";
		ИначеЕсли Запись.ДеньНедели = 2 Тогда
			Возврат " по вторникам";
		ИначеЕсли Запись.ДеньНедели = 3 Тогда
			Возврат " по средам";
		ИначеЕсли Запись.ДеньНедели = 4 Тогда
			Возврат " по четвергам";
		ИначеЕсли Запись.ДеньНедели = 5 Тогда
			Возврат " по пятницам";
		ИначеЕсли Запись.ДеньНедели = 6 Тогда
			Возврат " по субботам";
		ИначеЕсли Запись.ДеньНедели = 7 Тогда
			Возврат " по воскресеньям";
		КонецЕсли;
	ИначеЕсли Запись.Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат (" до " + Строка(Запись.ЧислоМесяца) + "-го числа месяца, следующего за отчетным");
	Иначе
		Возврат (" до " + Строка(Запись.ЧислоМесяца) + "-го числа месяца, следующего за отчетным периодом");
	КонецЕсли;
	
		
КонецФункции

Процедура СформироватьИнформацию(Запись)
	Запись.Информация = "";
	
	Если Запись.Периодичность = Перечисления.Периодичность.День Тогда
		Если Запись.Частота = 1 Тогда
			Запись.Информация = "Каждый день, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
		ИначеЕсли Запись.Частота = 2 ИЛИ Запись.Частота = 3 ИЛИ Запись.Частота = 4 Тогда
			Запись.Информация = "Каждые " + Строка(Запись.Частота) + 
						" дня, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
		ИначеЕсли Запись.Частота > 4 Тогда
			Запись.Информация = "Каждые " + Строка(Запись.Частота) + 
						" дней, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");										
		КонецЕсли;
		
	ИначеЕсли Запись.Периодичность = Перечисления.Периодичность.Неделя Тогда
		Если Запись.Частота = 1 Тогда
			Запись.Информация = "Каждую неделю, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
			
		ИначеЕсли Запись.Частота = 2 ИЛИ Запись.Частота = 3 ИЛИ Запись.Частота = 4 Тогда
			Если Запись.ЧетНечет = 2 Тогда
				Запись.Информация = "Каждую четную неделю года, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
			ИначеЕсли Запись.ЧетНечет = 3 Тогда
				Запись.Информация = "Каждую нечетную неделю года, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
			Иначе
			Запись.Информация = "Каждые " + Строка(Запись.Частота) + 
						" недели, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
			КонецЕсли;
		ИначеЕсли Запись.Частота > 4 Тогда
			Запись.Информация = "Каждые " + Строка(Запись.Частота) + 
						" недель, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");										
		КонецЕсли;
		
		Запись.Информация = Запись.Информация + ПолучитьЧислоМесяцаДеньНеделиОтчетаСтрокой(Запись);
		
	ИначеЕсли Запись.Периодичность = Перечисления.Периодичность.Месяц Тогда
		Если Запись.Частота = 1 Тогда
			Запись.Информация = "Каждый месяц, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
		ИначеЕсли Запись.Частота = 2 ИЛИ Запись.Частота = 3 ИЛИ Запись.Частота = 4 Тогда
			Запись.Информация = "Каждые " + Строка(Запись.Частота) + 
						" месяца, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");
		ИначеЕсли Запись.Частота > 4 Тогда
			Запись.Информация = "Каждые " + Строка(Запись.Частота) + 
						" месяцев, начиная с " + Формат(Запись.НачальнаяДата, "ДЛФ=DD");										
		КонецЕсли;
		
		Запись.Информация = Запись.Информация + ПолучитьЧислоМесяцаДеньНеделиОтчетаСтрокой(Запись);
		
	ИначеЕсли Запись.Периодичность = Перечисления.Периодичность.Квартал Тогда
		Запись.Информация = "Каждый квартал, начиная с " + 
		Формат(Запись.НачальнаяДата, "ДЛФ=DD") + ПолучитьЧислоМесяцаДеньНеделиОтчетаСтрокой(Запись);
		
	ИначеЕсли Запись.Периодичность = Перечисления.Периодичность.Полугодие Тогда
		Запись.Информация = "Каждое полугодие, начиная с " + 
		Формат(Запись.НачальнаяДата, "ДЛФ=DD") + ПолучитьЧислоМесяцаДеньНеделиОтчетаСтрокой(Запись);
		
	ИначеЕсли Запись.Периодичность = Перечисления.Периодичность.Год Тогда
		Запись.Информация = "Каждый год, начиная с " + 
		Формат(Запись.НачальнаяДата, "ДЛФ=DD") + ПолучитьЧислоМесяцаДеньНеделиОтчетаСтрокой(Запись);
				
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	Если Не Отказ Тогда
		Для Каждого Запись Из ЭтотОбъект Цикл
			СформироватьИнформацию(Запись);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры