#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_ПриСозданииНаСервере";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
КонецПроцедуры


&НаКлиенте
Процедура СтруктураПодчиненности(Команда)
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_СтруктураПодчиненности";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		//РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(Документы.ЗаявкаПокупателя.ПолучитьПоследнийДокументКорректировки(Элементы.Список.ТекущаяСтрока));
		РаботаСДиалогами.ПоказатьСтруктуруПодчиненностиДокумента(Элементы.Список.ТекущаяСтрока);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокумента(Команда)
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_ДвиженияДокумента";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		ОткрытьФорму("Отчет.ОтчетПоДвижениямДокумента.Форма", Новый Структура("Документ,СпособВыводаОтчета", Документы.ЗаявкаПокупателя.ПолучитьПоследнийДокументКорректировки(Элементы.Список.ТекущаяСтрока), "ПоВертикали"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияДокумента(Команда)
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_ИсторияДокумента";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		ФормаСравненияКорректировок = Обработки.ИсторияДокумента.ПолучитьФорму("ФормаСравненияКорректировок");
		ФормаСравненияКорректировок.Документ = Элементы.Список.ТекущаяСтрока;
		ФормаСравненияКорректировок.ТолькоИзменения = Истина;
		ФормаСравненияКорректировок.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РучнойВвод(Команда)
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_РучнойВвод";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	форм=Документы.ПоступлениеТоваровУслуг.ПолучитьФорму("РучнойВвод");
	Форм.Открыть();
	// Вставить содержимое обработчика.
КонецПроцедуры
	
&НаКлиенте
Процедура ПоискПоНомеру(Команда)
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_ПоискПоНомеру";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Номер = "";
	Если Не ВвестиЗначение(Номер, "Введите номер поступления", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(11, ДопустимаяДлина.Фиксированная))) Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(Номер) < 11 Тогда 
		Номер=Лев(Номер,4)+"0"+Сред(Номер,5);
	КонецЕсли;	
	
	Если СтрДлина(Номер) < 11 Тогда 
		Предупреждение("Введите 11-значный номер", 5);
		Возврат;
	КонецЕсли;
	
	ИскомыйЭлементОтбора = Неопределено;
	   УстановитьСнятьОтборПоПолюФормы("Номер",Номер);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСнятьОтборПоПолюФормы (ИмяПоля, Значение = Неопределено, Использование = истина)
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_УстановитьСнятьОтборПоПолюФормы";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	Для Каждого ЭлтОтбора Из Список.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл 
		Если ТипЗнч(ЭлтОтбора) = Тип("ЭлементОтбораКомпоновкиДанных") И ЭлтОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
			ИскомыйЭлементОтбора = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлтОтбора.ИдентификаторПользовательскойНастройки);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ИскомыйЭлементОтбора = Неопределено Тогда 
		ИскомыйЭлементОтбора = Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ИскомыйЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	КонецЕсли;
	
	ИскомыйЭлементОтбора.ПравоеЗначение = Значение;
	ИскомыйЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ИскомыйЭлементОтбора.Использование = Использование;
	Для Каждого Стр Из Список.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Попытка
			Для Каждого СТРР Из Стр.Элементы Цикл
				СТРР.Использование=ЛОжь;
			КонецЦикла;
		Исключение
		КонецПопытки;	
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоискПоНомеру(Команда)
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_ОтменитьПоискПоНомеру";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	  УстановитьСнятьОтборПоПолюФормы("Номер",,Ложь);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьВТопЛогНаСервере(ДокСсылка)
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_ВыгрузитьВТопЛогНаСервере";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если ДокСсылка <> Неопределено Тогда 
		ПопыткаРегистрации = ДокСсылка.ПолучитьОбъект().ВыгрузитьВОбменТоплог();
		Сообщить(ПопыткаРегистрации.СообщениеДиагностики);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВТопЛог(Команда)
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_ВыгрузитьВТопЛог";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Ответ = Вопрос("Хотите выгрузить этот документ в ТопЛог?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда 	
		ВыгрузитьВТопЛогНаСервере(Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВнешнееСобытиеНаСервере()
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_ВнешнееСобытиеНаСервере";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_ВнешнееСобытие";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	ВнешнееСобытиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_ПриОткрытииНаСервере";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	лКлючАлгоритма = "Документ_РеализацияТоваровУслуг_ФормаСпискаУпр_ПриОткрытии";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	ПриОткрытииНаСервере();
КонецПроцедуры


#КонецОбласти

 