Перем мПроверкаПередПроведением Экспорт;

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Перем вхПараметры;
	
	//ДополнительныеСвойства.Свойство("вхПараметры", вхПараметры);
	Документы.КорректировкаЗаявкиПокупателя.ВыполнитьПроведение(Ссылка, Отказ);
	РегистрыСведений.ДокументыКорректировок.УстановитьКорректировку(Движения.ДокументыКорректировок, Ссылка.ДокументОснование, Ссылка);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	РазрешенаОтменаПроведения = (Дата < глЗначениеПеременной("ДатаЗаявкиСоздаютсяВ83"))
								ИЛИ ДополнительныеСвойства.Свойство("ВыполнитьУдалениеПроведения"); //Семенов И.П. 28.12.2018
								
	Если РазрешенаОтменаПроведения ИЛИ Ссылка = Документы.ЗаявкаПокупателя.ПолучитьПоследнийДокументКорректировки(Ссылка) 
		Или СтатусДокумента <> Справочники.СтатусыДокументов.ЗаявкаПокупателяПодтвержден Тогда 
		Документы.КорректировкаЗаявкиПокупателя.ВыполнитьОтменуПроведения(Ссылка, Отказ);
	Иначе
		ВызватьИсключение "Распроведение данной корректировки заявки запрещено";
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("мЗаписьБезОбработки") Тогда 
		Возврат;
	КонецЕсли;

	ОбщегоНазначения.УдалитьДвиженияПриПометкеУдаления(ЭтотОбъект, РежимЗаписи);
	
	Документы.КорректировкаЗаявкиПокупателя.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);	
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоНовый() и  не РольДоступна("ПолныеПрава") Тогда 
		Если РежимЗаписи=РежимЗаписиДокумента.Проведение Или  РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда 
			Если Ссылка <> Документы.ЗаявкаПокупателя.ПолучитьПоследнийДокументКорректировки(Ссылка) Тогда  
				Сообщить("Нельзя изменять состояние проведения промежуточных корректировок!");
				Отказ=Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	//ВызватьИсключение "Корректировка не является самостоятельным документом и не может быть скопирована";
	СозданВ77 = Ложь;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Документы.КорректировкаЗаявкиПокупателя.ПриЗаписи(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

мПроверкаПередПроведением = Ложь;
 