

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ТекущийПользователь=Пользователи.АвторизованныйПользователь();
	РазрешитьВсеФилиалы = Истина;
	пРазрешитьВсеФилиалы = 	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("РазрешитьВсеФилиалы");
	если не пРазрешитьВсеФилиалы = Неопределено тогда 
		пРазрешитьВсеФилиалы.Использование   = Истина;
		РазрешитьВсеФилиалы =	НастройкаПравДоступа.ПолучитьЗначениеПраваПользователя(ТекущийПользователь,ПланыВидовХарактеристик.ПраваПользователей.РазрешитьОтчетностьПоВсемФилиалам);
		пРазрешитьВсеФилиалы.Значение =  РазрешитьВсеФилиалы
	Конецесли ;
	
	Если Не РазрешитьВсеФилиалы  тогда 	
	пОсновнойФилиал = 	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ФилиалПоУмолчанию");
	если не пОсновнойФилиал = Неопределено тогда 
		  пОсновнойФилиал.Использование   = Истина;
		  пОсновнойФилиал.Значение =  ТекущийПользователь.ФилиалыПользователя.ВыгрузитьКолонку("Филиал") // 	УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(ТекущийПользователь,"ОсновнойФилиал");
		Конецесли
	КонецЕсли;
	
КонецПроцедуры

мВерсия = "1.1";
