Процедура СформироватьНадписьНаФорме(вхЭлементФормыНадпись, вхСтруктураПризнакаПроверен = Неопределено) Экспорт
	Если вхСтруктураПризнакаПроверен = Неопределено Тогда
		вхЭлементФормыНадпись.Значение = "";
		
	Иначе
		текНадпись = "";
		Если вхСтруктураПризнакаПроверен.ПризнакПроверен Тогда
			КраткоеИмя = СокрЛП(ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСтруктураПризнакаПроверен.КтоПроверил, "Код"));
			текНадпись = ТекНадпись + "проверено " + КраткоеИмя;
			текНадпись = ТекНадпись + " (" + Формат(вхСтруктураПризнакаПроверен.ДатаПроверки, "ДФ=dd.MM.yy");   
			Время = Формат(вхСтруктураПризнакаПроверен.ДатаПроверки, "ДЛФ=T");
			Время = ?(СтрДлина(Время) = 8, Лев(Время, 5), Лев(Время, 4));
			текНадпись = ТекНадпись + " " + Время + ")";
		Иначе
			КраткоеИмя = СокрЛП(ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСтруктураПризнакаПроверен.КтоПроверил, "Код"));
			текНадпись = ТекНадпись + "проверено " + КраткоеИмя;
			текНадпись = ТекНадпись + " (" + Формат(вхСтруктураПризнакаПроверен.ДатаПроверки, "ДФ=dd.MM.yy");
			Время = Формат(вхСтруктураПризнакаПроверен.ДатаПроверки, "ДЛФ=T");
			Время = ?(СтрДлина(Время) = 8, Лев(Время, 5), Лев(Время, 4));
			текНадпись = ТекНадпись + " " + Время + ");";
			КраткоеИмя = СокрЛП(ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСтруктураПризнакаПроверен.КтоОтменил, "Код"));
			текНадпись = ТекНадпись + " отменено " + КраткоеИмя;
			текНадпись = ТекНадпись + " (" + Формат(вхСтруктураПризнакаПроверен.ДатаОтмены, "ДФ=dd.MM.yy");
			Время = Формат(вхСтруктураПризнакаПроверен.ДатаОтмены, "ДЛФ=T");
			Время = ?(СтрДлина(Время) = 8, Лев(Время, 5), Лев(Время, 4));
			текНадпись = ТекНадпись + " " + Время + ")";
						
		КонецЕсли;
		
		вхЭлементФормыНадпись.Значение = текНадпись;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриИзмененииПризнакаПроверенНаФорме(вхСсылкаНаДокумент, вхПризнакПроверен) Экспорт
	Если ЗначениеЗаполнено(вхСсылкаНаДокумент) Тогда
		Если НЕ ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНаДокумент, "Проведен") Тогда
			Сообщить("сначала необходимо провести документ");
			вхПризнакПроверен = Ложь;
			Возврат;
			
		КонецЕсли;
		
		Если вхПризнакПроверен Тогда
			Если Вопрос(" установить признак, что документ проверен? ", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				РаботаСоСтатусамиДокументов.ИзменитьПризнакДокументПроверен(вхСсылкаНаДокумент, вхПризнакПроверен, ПараметрыСеанса.ТекущийПользователь);
				
			Иначе
				вхПризнакПроверен = Ложь;
				
			КонецЕсли;
			
		Иначе
			Если Вопрос(" снять пометку, что документ проверен? ", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				РаботаСоСтатусамиДокументов.ИзменитьПризнакДокументПроверен(вхСсылкаНаДокумент, вхПризнакПроверен, ПараметрыСеанса.ТекущийПользователь);
				
			Иначе
				вхПризнакПроверен = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Сообщить("сначала необходимо записать документ");
		вхПризнакПроверен = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПоказатьИсториюПроверкиДокумента(вхСсылкаНаДокумент) Экспорт
	
	Если ЗначениеЗаполнено(вхСсылкаНаДокумент) тогда
		Форма = ПолучитьОбщуюФорму("ФормаИсториииСведенийОПроверкеДокументов");
		Форма.ТекДокумент = вхСсылкаНаДокумент;
		Форма.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры