Процедура УстановитьКорректировку(Движения, ДокументОснование, ДокументКорректировки) Экспорт
	
	Движения.Очистить();
	
	Движение = Движения.Добавить();
	Движение.Период = ДокументКорректировки.Дата;
	Движение.Документ = ДокументОснование;
	Движение.ДокументКорректировки = ДокументКорректировки;
	Движение.СтатусДокумента = ДокументКорректировки.СтатусДокумента;
	
	Движения.Записать();

КонецПроцедуры


Процедура  ОткрытьФормуКорректировкиПоДокументу(ДокументСсылка) Экспорт 
	
Форма  = РегистрыСведений.ДокументыКорректировок.ПолучитьФорму("ИсторияКорретировокДокумента");
КомпоновкаДанныхКлиентСервер.ДобавитьОтбор(Форма.КорректировкиДокумента.КомпоновщикНастроек,"Документ",ДокументСсылка,,,Истина);
//СтрДоб = Форма.КорректировкиДокумента.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных")); 
//СтрДоб.Поле = Новый ПолеКомпоновкиДанных("Документ"); 
//СтрДоб.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Элементы; 
форма.Открыть();

КонецПроцедуры