Процедура ЗафиксироватьЗапускРегламентногоЗадания(РегламентноеЗадание) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Запуск");
	МенеджерЗаписи.РегламентноеЗадание = РегламентноеЗадание;
	МенеджерЗаписи.Начало = ТекущаяДатаСеанса();
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.НомерСеанса = НомерСеансаИнформационнойБазы();
	
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗафиксироватьЗавершениеРегламентногоЗадания(РегламентноеЗадание) Экспорт
	
	//НаборЗаписей = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.РегламентноеЗадание.Установить(РегламентноеЗадание);
	//НаборЗаписей.Отбор.Событие.Установить(ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Запуск"));
	//НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	//НаборЗаписей.Отбор.Завершено.Установить(Ложь);
	//
	//НаборЗаписей.Прочитать();
	//
	//Начало = ТекущаяДатаСеанса();
	//
	//Если НаборЗаписей.Количество() Тогда 
	//	Запись = НаборЗаписей[0];
	//	Начало = Запись.Начало;
	//	НаборЗаписей.Удалить(Запись);
	//	НаборЗаписей.Записать();
	//КонецЕсли;
	//
	//МенеджерЗаписи = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	//
	//МенеджерЗаписи.РегламентноеЗадание = РегламентноеЗадание;
	//МенеджерЗаписи.Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Запуск");
	//МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	//МенеджерЗаписи.НомерСеанса = Истина;
	//МенеджерЗаписи.Период = Начало;
	//МенеджерЗаписи.Начало = ТекущаяДатаСеанса();
	//МенеджерЗаписи.Конец = ТекущаяДатаСеанса();
	//МенеджерЗаписи.Длительность = ТекущаяДатаСеанса() - Начало;
	//
	//МенеджерЗаписи.Записать(Истина);
	
	Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Запуск");
	
	НаборЗаписей = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РегламентноеЗадание.Установить(РегламентноеЗадание);
	НаборЗаписей.Отбор.Событие.Установить(Событие);
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	НаборЗаписей.Отбор.НомерСеанса.Установить(НомерСеансаИнформационнойБазы());
	НаборЗаписей.Отбор.Период.Установить(ПолучитьДатуНачалаРегламентногоЗадания(РегламентноеЗадание, Событие));
	
	НаборЗаписей.Прочитать();
	
	Начало = ТекущаяДатаСеанса();
	
	Если НаборЗаписей.Количество() Тогда 
		Запись = НаборЗаписей[0];
		Запись.Конец = ТекущаяДатаСеанса();
		Запись.Длительность = ТекущаяДатаСеанса() - Начало;		
		Запись.Завершено = Истина;
		
		НаборЗаписей.Записать();
	КонецЕсли;

		
КонецПроцедуры

Процедура ЗафиксироватьОшибкуРегламентногоЗадания(РегламентноеЗадание, ОписаниеОшибки) Экспорт
	
	//НаборЗаписей = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.РегламентноеЗадание.Установить(РегламентноеЗадание);
	//НаборЗаписей.Отбор.Событие.Установить(ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Запуск"));
	//НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	//НаборЗаписей.Отбор.Завершено.Установить(Ложь);
	//
	//НаборЗаписей.Прочитать();
	//
	//Начало = ТекущаяДатаСеанса();
	//Если НаборЗаписей.Количество() Тогда 
	//	Запись = НаборЗаписей[0];
	//	Начало = Запись.Начало;
	//	НаборЗаписей.Удалить(Запись);
	//	НаборЗаписей.Записать();
	//КонецЕсли;
	//
	//МенеджерЗаписи = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	//
	//МенеджерЗаписи.РегламентноеЗадание = РегламентноеЗадание;
	//МенеджерЗаписи.Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Ошибка");
	//МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	//МенеджерЗаписи.НомерСеанса = Истина;
	//МенеджерЗаписи.Период = Начало;
	//МенеджерЗаписи.Ошибка = Истина;
	//МенеджерЗаписи.ОписаниеОшибки = ОписаниеОшибки;
	//МенеджерЗаписи.РегламентноеЗадание = РегламентноеЗадание;
	//МенеджерЗаписи.Начало = ТекущаяДатаСеанса();
	//МенеджерЗаписи.Конец = ТекущаяДатаСеанса();
	//МенеджерЗаписи.Длительность = ТекущаяДатаСеанса() - Начало;
	//
	//МенеджерЗаписи.Записать(Истина);
	
	
	Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Запуск");
	Начало = ПолучитьДатуНачалаРегламентногоЗадания(РегламентноеЗадание, Событие);
	Если Не ЗначениеЗаполнено(Начало) Тогда
		Начало = ТекущаяДатаСеанса();
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.РегламентноеЗадание.Установить(РегламентноеЗадание);
	НаборЗаписей.Отбор.Событие.Установить(Событие);
	НаборЗаписей.Отбор.Пользователь.Установить(ПараметрыСеанса.ТекущийПользователь);
	НаборЗаписей.Отбор.Период.Установить(Начало);
	НаборЗаписей.Отбор.НомерСеанса.Установить(НомерСеансаИнформационнойБазы());
	
	НаборЗаписей.Прочитать();
	
	
	Если НаборЗаписей.Количество() Тогда 
		Запись = НаборЗаписей[0];
		Запись.Конец = ТекущаяДатаСеанса();
		Запись.Длительность = ТекущаяДатаСеанса() - Начало;		
		Запись.Ошибка = Истина;
		Запись.ОписаниеОшибки = ОписаниеОшибки;
		Запись.Завершено = Истина;
		
	Иначе
		Запись = НаборЗаписей.Добавить();
		Запись.Конец = ТекущаяДатаСеанса();
		Запись.НомерСеанса = НомерСеансаИнформационнойБазы();
		Запись.Пользователь = ПараметрыСеанса.ТекущийПользователь;
		Запись.Завершено = Истина;
		Запись.Ошибка = Истина;
		Запись.Завершено = Истина;
		Запись.ОписаниеОшибки = ОписаниеОшибки;
	КонецЕсли;
	
	НаборЗаписей.Записать();
		
КонецПроцедуры

Процедура ЗафиксироватьИзмененияНастроекРегламентогоЗадания(РегламентноеЗадание) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.ИзменениеНастроек");
	МенеджерЗаписи.РегламентноеЗадание = РегламентноеЗадание;
	МенеджерЗаписи.Начало = ТекущаяДатаСеанса();
	МенеджерЗаписи.ОписаниеОшибки = "Изменены настройки";
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.НомерСеанса = Истина;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗафиксироватьВключениеРегламентногоЗадания(РегламентноеЗадание) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Включение");
	МенеджерЗаписи.РегламентноеЗадание = РегламентноеЗадание;
	МенеджерЗаписи.Начало = ТекущаяДатаСеанса();
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.НомерСеанса = Истина;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Процедура ЗафиксироватьОтключениеРегламентногоЗадания(РегламентноеЗадание) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ИсторияРегламентныхЗаданий.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Событие = ПредопределенноеЗначение("Перечисление.СобытияРегламентныхЗаданий.Отключение");
	МенеджерЗаписи.РегламентноеЗадание = РегламентноеЗадание;
	МенеджерЗаписи.Начало = ТекущаяДатаСеанса();
	МенеджерЗаписи.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.НомерСеанса = Истина;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

Функция ПолучитьДатуНачалаРегламентногоЗадания(РегламентноеЗадание, Событие)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИсторияРегламентныхЗаданий.Начало
	|ИЗ
	|	РегистрСведений.ИсторияРегламентныхЗаданий КАК ИсторияРегламентныхЗаданий
	|ГДЕ
	|	НЕ ИсторияРегламентныхЗаданий.Завершено
	|	И ИсторияРегламентныхЗаданий.РегламентноеЗадание = &РегламентноеЗадание
	|	И ИсторияРегламентныхЗаданий.Событие = &Событие
	|	И ИсторияРегламентныхЗаданий.Пользователь = &Пользователь
	|	И ИсторияРегламентныхЗаданий.НомерСеанса = &НомерСеанса";
	
	Запрос.УстановитьПараметр("РегламентноеЗадание", РегламентноеЗадание);
	Запрос.УстановитьПараметр("Событие", Событие);
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("НомерСеанса", НомерСеансаИнформационнойБазы());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Начало;
		
КонецФункции