
Функция ЗарегистрироватьСообщениеКОтправке(Объект, Дата, Номер, Сообщение) Экспорт
	Если Не ЗначениеЗаполнено(Объект) Или Не ЗначениеЗаполнено(дата) Или Не ЗначениеЗаполнено(Номер) Или Не ЗначениеЗаполнено(Сообщение) Тогда 
		Сообщить("Поля: Объект отправки, Дата отправки, номер получателя и текст сообщения обязательны для заполнения");
		Отказ=Истина;
		Возврат Ложь;
	КонецЕсли;	
	Записьрег=РегистрыСведений.СМСРассылка.СоздатьНаборЗаписей();
	Записьрег.Отбор.Объект.Установить(Объект);
	Записьрег.Отбор.Дата.Установить(Дата);
	Записьрег.Отбор.Номер.Установить(Номер);
	Записьрег.Прочитать();
	Записьрег.Очистить();
	СтрокаЗаписи=Записьрег.Добавить();
	СтрокаЗаписи.Дата=Дата;
	СтрокаЗаписи.Объект=Объект;
	СтрокаЗаписи.Номер=Номер;
	СтрокаЗаписи.Сообщение=Сообщение;
	Записьрег.Записать();
	Возврат Истина;
КонецФункции
