
Процедура ВыполнитьПроведение(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "РазмещениеТоваров") тогда
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "РазмещениеТоваров",
		РегистрыНакопления_РазмещениеТоваров(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
	КонецЕсли;
	
	
	
КонецПроцедуры

Функция РегистрыНакопления_РазмещениеТоваров(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено)
	
	ТабТоваров = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("РазмещениеТоваров", ТабТоваров);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмещениеТоваровТовары.Ссылка КАК Регистратор,
		|	РазмещениеТоваровТовары.Ссылка.Дата КАК Период,
		|	РазмещениеТоваровТовары.ДокументОснование,
		|	РазмещениеТоваровТовары.Номенклатура,
		|	РазмещениеТоваровТовары.Качество,
		|	СУММА(РазмещениеТоваровТовары.Количество) КАК Количество,
		|	РазмещениеТоваровТовары.СтрокаЗаявки
		|ИЗ
		|	Документ.РазмещениеТоваров.Товары КАК РазмещениеТоваровТовары
		|ГДЕ
		|	РазмещениеТоваровТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РазмещениеТоваровТовары.Ссылка,
		|	РазмещениеТоваровТовары.СтрокаЗаявки,
		|	РазмещениеТоваровТовары.Качество,
		|	РазмещениеТоваровТовары.Номенклатура,
		|	РазмещениеТоваровТовары.ДокументОснование,
		|	РазмещениеТоваровТовары.Ссылка.Дата";
	
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаДокумента = РезультатЗапроса.Выгрузить();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаДокумента, ТабТоваров);
			
	Возврат ТабТоваров;
	
КонецФункции
