
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЗаказыПоставщикам Приход
	Движения.ЗаказыПоставщикам.Записывать = Истина;
	Движения.ЗаказыПоставщикам.Очистить();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ЗаказыПоставщикам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ДоговорКонтрагента = ТекСтрокаТовары.ДоговорКонтрагента;
		Движение.ТорговаяТочка = ТекСтрокаТовары.ТорговаяТочка;
		Движение.Склад = ТекСтрокаТовары.Склад;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.СтрокаЗаявки = ТекСтрокаТовары.СтрокаЗаявки;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.СуммаРегл = ТекСтрокаТовары.СуммаРегл;
		Движение.СуммаУпр = ТекСтрокаТовары.СуммаУпр;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
