
Функция ДанныеУчетнойЗаписиКонтрагента(Контрагент) Экспорт
	
	ДанныеУчетнойЗаписи = Новый Структура();	
	ДанныеУчетнойЗаписи.Вставить("УчетнаяЗапись", 	Неопределено);	
	ДанныеУчетнойЗаписи.Вставить("Логин", 			Неопределено);	
	ДанныеУчетнойЗаписи.Вставить("Пароль", 			Неопределено);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетныеЗаписиСайта.Ссылка КАК УчетнаяЗапись,
	               |	УчетныеЗаписиСайта.Код КАК Логин,
	               |	УчетныеЗаписиСайта.Пароль КАК Пароль
	               |ИЗ
	               |	Справочник.УчетныеЗаписиСайта КАК УчетныеЗаписиСайта
	               |ГДЕ
	               |	УчетныеЗаписиСайта.Владелец.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеУчетнойЗаписи, Выборка);
	КонецЕсли;
	
	Возврат ДанныеУчетнойЗаписи;
	
КонецФункции