Функция ПроверитьЛогинКонтрагентаВБазеСПб(вхЛогин) экспорт
		
	стрПодключения = "Provider=SQLOLEDB;Data Source=NNG9-V-SPB-01;Initial Catalog=SPB_Trade;Integrated Security=SSPI";
	
	Попытка
		Connection = Новый COMОбъект("ADODB.Connection");
		Connection.ConnectionString = стрПодключения;
		Connection.ConnectionTimeOut = 15;
		
		Connection.Open(Connection.ConnectionString);
		
	Исключение
		#Если Клиент Тогда
			Сообщить("не удалось проверить логин в базе СПб, запись элемента невозможна");
			Сообщить(ОписаниеОшибки());
		#КонецЕсли
		
		Возврат Истина;
		
	КонецПопытки;
	
	RS = Новый COMОбъект("ADODB.Recordset");
	
	ТекстЗапроса = "select DESCR as Наименование, CODE as Код from SC172 where SP8854 = '" + вхЛогин + "'";
	
	Отбойник = "";
	Попытка
		RS.Open(ТекстЗапроса, Connection);	
	
		Пока RS.EOF() = 0 Цикл
			Отбойник = "логин '" + вхЛогин + "' уже есть в базе СПб у контрагента " + СокрЛП(RS.Fields("Наименование").Value);
			Отбойник = Отбойник + " (" + СокрЛП(RS.Fields("Код").Value) + "), запись элемента невозможна";
			RS.MoveNext();
		
		КонецЦикла;
	
		RS.Close();
		Connection.Close();
		
	исключение
		#Если Клиент Тогда
			Сообщить("не удалось проверить логин в базе СПб, запись элемента невозможна");
			Сообщить(ОписаниеОшибки());
		#КонецЕсли
		
		Возврат Истина;
		
	КонецПопытки;
	
	Если НЕ ПустаяСтрока(Отбойник) Тогда
		#Если Клиент Тогда
			Сообщить(Отбойник);
		#КонецЕсли
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
		
КонецФункции

Функция ДанныеУчетнойЗаписиКонтрагента(Контрагент) Экспорт
	
	ДанныеУчетнойЗаписи = Новый Структура();	
	ДанныеУчетнойЗаписи.Вставить("УчетнаяЗапись", 	Неопределено);	
	ДанныеУчетнойЗаписи.Вставить("Логин", 			Неопределено);	
	ДанныеУчетнойЗаписи.Вставить("Пароль", 			Неопределено);	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетныеЗаписиСайта.Ссылка КАК УчетнаяЗапись,
	               |	УчетныеЗаписиСайта.Код КАК Логин,
	               |	УчетныеЗаписиСайта.Пароль КАК Пароль
	               |ИЗ
	               |	Справочник.УчетныеЗаписиСайта КАК УчетныеЗаписиСайта
	               |ГДЕ
	               |	УчетныеЗаписиСайта.Владелец.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Контрагент);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеУчетнойЗаписи, Выборка);
	КонецЕсли;
	
	Возврат ДанныеУчетнойЗаписи;
	
КонецФункции