Функция ПроверитьЛогинКонтрагентаВБазеСПб() экспорт
	стрПодключения = "Provider=SQLOLEDB;Data Source=NNG9-V-SPB-01;Initial Catalog=SPB_Trade;Integrated Security=SSPI";
	
	Попытка
		Connection = Новый COMОбъект("ADODB.Connection");
		Connection.ConnectionString = стрПодключения;
		Connection.ConnectionTimeOut = 15;
		
		Connection.Open(Connection.ConnectionString);
		
	Исключение
		#Если Клиент Тогда
			Сообщить("не удалось проверить логин в базе СПб, запись элемента невозможна");
			Сообщить(ОписаниеОшибки());
		#КонецЕсли
		
		Возврат Истина;
		
	КонецПопытки;
	
	RS = Новый COMОбъект("ADODB.Recordset");
	
	ТекстЗапроса = "select DESCR as Наименование, CODE as Код from SC172 where SP8854 = '" + СокрЛП(Код) + "'";
	
	Отбойник = "";
	Попытка
		RS.Open(ТекстЗапроса, Connection);	
	
		Пока RS.EOF() = 0 Цикл
			Отбойник = "логин '" + СокрЛП(Код) + "' уже есть в базе СПб у контрагента " + СокрЛП(RS.Fields("Наименование").Value);
			Отбойник = Отбойник + " (" + СокрЛП(RS.Fields("Код").Value) + "), запись элемента невозможна";
			RS.MoveNext();
		
		КонецЦикла;
	
		RS.Close();
		Connection.Close();
		
	исключение
		#Если Клиент Тогда
			Сообщить("не удалось проверить логин в базе СПб, запись элемента невозможна");
			Сообщить(ОписаниеОшибки());
		#КонецЕсли
		
		Возврат Истина;
		
	КонецПопытки;
	
	Если НЕ ПустаяСтрока(Отбойник) Тогда
		#Если Клиент Тогда
			Сообщить(Отбойник);
		#КонецЕсли
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
		
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: Контрагенты", Ложь) Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъектВУзлах(Ссылка.Владелец.Владелец, Метаданные.ПланыОбмена.ОбменПартКом83_Сайт);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ТекущаяДата() < '20190101000000' Тогда
		Отказ = ПроверитьЛогинКонтрагентаВБазеСПб();			
	КонецЕсли;
	
КонецПроцедуры
