
Процедура СформироватьОтчет(ДокументОбъект, ФормаОбъекта) Экспорт 
	
	лКлючАлгоритма = "Отчет_ИсполнениеСтрокЗаявок_МодульМенеджера_СформироватьОтчет";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////
	
	
	Форма = ПолучитьФорму("ФормаОтчета", ФормаОбъекта);
	Форма.ОтчетОбъект.СписокСтрокЗаявок = ПолучитьСписокСтрокЗаявокПоДокументу(ДокументОбъект);
	Форма.СформироватьОтчет();
	Форма.Открыть();
	
КонецПроцедуры

Функция ПолучитьСписокСтрокЗаявокПоДокументу(ДокументОбъект)
	
	лКлючАлгоритма = "Отчет_ИсполнениеСтрокЗаявок_МодульМенеджера_ПолучитьСписокСтрокЗаявокПоДокументу";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;
	///////////////////////////////////////////
	
	ИмяТабличнойЧасти = "";
	ИмяРеквизитаСтрокаЗаявки = "СтрокаЗаявки";
	СписокСтрокЗаявок = Новый СписокЗначений;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаявкаПокупателя") 
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КорректировкаЗаявкиПокупателя") 
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ЗаказПоставщику") 
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.КорректировкаЗаказаПоставщику")
		ИЛИ ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда 
		
		ИмяТабличнойЧасти = "Товары";
		
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		
		ИмяТабличнойЧасти = "РазмещениеСтрокПрихода";
		
	КонецЕсли;
	
	Если ИмяТабличнойЧасти <> "" Тогда 
		ТаблицаСтрок = ДокументОбъект[ИмяТабличнойЧасти].Выгрузить(,ИмяРеквизитаСтрокаЗаявки);
		ТаблицаСтрок.Свернуть(ИмяРеквизитаСтрокаЗаявки);
		
		ПустаяСтрока = ТаблицаСтрок.Найти(Справочники.ИдентификаторыСтрокЗаявок.ПустаяСсылка(),ИмяРеквизитаСтрокаЗаявки);
		
		Если ПустаяСтрока <> Неопределено Тогда 
			ТаблицаСтрок.Удалить(ПустаяСтрока);
		КонецЕсли;
				
		СписокСтрокЗаявок.ЗагрузитьЗначения(ТаблицаСтрок.ВыгрузитьКолонку(ИмяРеквизитаСтрокаЗаявки));
	КонецЕсли;
	
	Возврат СписокСтрокЗаявок;
	
КонецФункции