
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: ПараметрыФормированияЗаказовПоставщикам", Ложь) Тогда
		ЗарегистрироватьИзменениеПараметровФормированияЗаказов();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеПараметровФормированияЗаказов()
	
	ПланОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_Сайт;
	Для Каждого Запись Из ЭтотОбъект Цикл
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъектВУзлах(Запись.ПараметрФормированияЗаказовПоставщикам, ПланОбмена);
	КонецЦикла;
	
КонецПроцедуры