
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
АдресРазмещения  = Параметры.АдресРазмещения;
Если  ЗначениеЗаполнено(АдресРазмещения) тогда 
	ТабРаспределения  = ПолучитьИзВременногоХранилища(АдресРазмещения);
КонецЕсли;
	
	ЗаполнитьДеревоРаспределения(ТабРаспределения);


КонецПроцедуры

//&НаСервере
//ПроЦедура ОбработатьПараметрыФормы()
//	
//АдресРазмещения  = Параметры.АдресРазмещения;
//Если  ЗначениеЗаполнено(АдресРазмещения) тогда 
//	ТабРаспределения  = ПолучитьИзВременногоХранилища(АдресРазмещения);
//	//ЗначениеВРеквизитФормы(ТабРаспределения,"ТаблицаРазмещений");

//КонецЕсли;
//	
//КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДеревоРаспределения(ТаблицаРаспределения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК Пометка,
		|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.Номенклатура КАК Номенклатура,
		|	ВЫРАЗИТЬ(ПоступлениеТоваровУслугРазмещениеСтрокПрихода.Номенклатура КАК Справочник.Номенклатура).Артикул КАК Артикул,
		|	ВЫРАЗИТЬ(ПоступлениеТоваровУслугРазмещениеСтрокПрихода.Номенклатура КАК Справочник.Номенклатура).Изготовитель КАК Изготовитель,
		|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.СтрокаЗаявки,
		|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.Количество КАК Количество
		|ПОМЕСТИТЬ ВТРазмещений
		|ИЗ
		|	&ТаблицаРаспределения КАК ПоступлениеТоваровУслугРазмещениеСтрокПрихода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРазмещений.Пометка,
		|	ВТРазмещений.Номенклатура КАК Номенклатура,
		|	ВТРазмещений.Артикул КАК Артикул,
		|	ВТРазмещений.Изготовитель КАК Изготовитель,
		|	ВТРазмещений.СтрокаЗаявки КАК СтрокаЗаявки,
		|	ВТРазмещений.Количество КАК Количество
		|ИЗ
		|	ВТРазмещений КАК ВТРазмещений
		|ИТОГИ
		|	МАКСИМУМ(Артикул),
		|	МАКСИМУМ(Изготовитель),
		|	СУММА(Количество)
		|ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("ТаблицаРаспределения",ТаблицаРаспределения);
	РезультатЗапроса = Запрос.Выполнить();
	
  ДеревоРазмещенияИзЗапроса = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
  
    ЗначениеВРеквизитФормы(ДеревоРазмещенияИзЗапроса,"ДеревоРазмещений");

  
КонецПроцедуры	

//&НаСервере
//Процедура ПереразместитьВыбраноеНаСервере()
//	СтруктураПараметров = ЗаказыПоставщикамСервер.ПараметрыРазмещенияПоУмолчанию();
//	 ОтборНоменклатуры = новый Массив;
//	Для Каждого СтрокаДерева  из ДеревоРазмещений.ПолучитьЭлементы() цикл 
//		Если СтрокаДерева.Пометка тогда 
//			ОтборНоменклатуры.Добавить(СтрокаДерева.Номенклатура);
//		КонецЕсли;				
//	КонецЦикла;
//	
//	Если  ОтборНоменклатуры.Количество() тогда 
//		СтруктураПараметров.вставить("МассивОтбораНоменклатуры",ОтборНоменклатуры);
//		ЗаказыПоставщикамКлиентСервер.РазместитьДокументПоступленияПоЗаказам(
//	Иначе 
//		общего
//		

//	КонецПроцедуры
//	
&НаСервере	
Функция ПолучитьВыбраннуюНоменклатуру()
	ОтборНоменклатуры = новый Массив;
	Для Каждого СтрокаДерева  из ДеревоРазмещений.ПолучитьЭлементы() цикл 
		Если СтрокаДерева.Пометка тогда 
			ОтборНоменклатуры.Добавить(СтрокаДерева.Номенклатура);
		КонецЕсли;				
	КонецЦикла;
	
	Возврат ОтборНоменклатуры;
	
	
КонецФункции	

&НаКлиенте
Процедура ПереразместитьВыбраное(Команда)
	
	
	ОповеститьОВыборе(ПолучитьВыбраннуюНоменклатуру());

КонецПроцедуры
