
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	лКлючАлгоритма = "Документ_ПоступлениеТоваровУслуг_ФормаЧастичногоРазмещения_ПриСозданииНаСервере";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////	
	АдресРазмещения  = Параметры.АдресРазмещения;
	Если  ЗначениеЗаполнено(АдресРазмещения) тогда 
		ТабРаспределения  = ПолучитьИзВременногоХранилища(АдресРазмещения);
	КонецЕсли;
	
	ЗаполнитьДеревоРаспределения(ТабРаспределения);


КонецПроцедуры

//&НаСервере
//ПроЦедура ОбработатьПараметрыФормы()
//	
//АдресРазмещения  = Параметры.АдресРазмещения;
//Если  ЗначениеЗаполнено(АдресРазмещения) тогда 
//	ТабРаспределения  = ПолучитьИзВременногоХранилища(АдресРазмещения);
//	//ЗначениеВРеквизитФормы(ТабРаспределения,"ТаблицаРазмещений");

//КонецЕсли;
//	
//КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьДеревоРаспределения(ТаблицаРаспределения)
	лКлючАлгоритма = "Документ_ПоступлениеТоваровУслуг_ФормаЧастичногоРазмещения_ЗаполнитьДеревоРаспределения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛОЖЬ КАК Пометка,
	|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.Номенклатура КАК Номенклатура,
	|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.СтрокаЗаявки,
	|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.Количество КАК Количество
	|ПОМЕСТИТЬ ВТРазмещений
	|ИЗ
	|	&ТаблицаРаспределения КАК ПоступлениеТоваровУслугРазмещениеСтрокПрихода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРазмещений.Пометка,
	|	ВТРазмещений.Номенклатура КАК Номенклатура,
	|	ВТРазмещений.СтрокаЗаявки КАК СтрокаЗаявки,
	|	ВТРазмещений.Количество КАК Количество
	|ИЗ
	|	ВТРазмещений КАК ВТРазмещений
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("ТаблицаРаспределения",ТаблицаРаспределения);
	РезультатЗапроса = Запрос.Выполнить();
	
	ДеревоРазмещенияИзЗапроса = РезультатЗапроса.Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ЗначениеВРеквизитФормы(ДеревоРазмещенияИзЗапроса,"ДеревоРазмещений");
	
	
КонецПроцедуры	

//&НаСервере
//Процедура ПереразместитьВыбраноеНаСервере()
//	СтруктураПараметров = ЗаказыПоставщикамСервер.ПараметрыРазмещенияПоУмолчанию();
//	 ОтборНоменклатуры = новый Массив;
//	Для Каждого СтрокаДерева  из ДеревоРазмещений.ПолучитьЭлементы() цикл 
//		Если СтрокаДерева.Пометка тогда 
//			ОтборНоменклатуры.Добавить(СтрокаДерева.Номенклатура);
//		КонецЕсли;				
//	КонецЦикла;
//	
//	Если  ОтборНоменклатуры.Количество() тогда 
//		СтруктураПараметров.вставить("МассивОтбораНоменклатуры",ОтборНоменклатуры);
//		ЗаказыПоставщикамКлиентСервер.РазместитьДокументПоступленияПоЗаказам(
//	Иначе 
//		общего
//		

//	КонецПроцедуры
//	
&НаСервере	
Функция ПолучитьВыбраннуюНоменклатуру()
	лКлючАлгоритма = "Документ_ПоступлениеТоваровУслуг_ФормаЧастичногоРазмещения_ПолучитьВыбраннуюНоменклатуру";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////////////////////////////////////
	ОтборНоменклатуры = новый Массив;
	Для Каждого СтрокаДерева  из ДеревоРазмещений.ПолучитьЭлементы() цикл 
		Если СтрокаДерева.Пометка тогда 
			ОтборНоменклатуры.Добавить(СтрокаДерева.Номенклатура);
		КонецЕсли;				
	КонецЦикла;
	
	Возврат ОтборНоменклатуры;
	
	
КонецФункции	

&НаКлиенте
Процедура ПереразместитьВыбраное(Команда)
	лКлючАлгоритма = "Документ_ПоступлениеТоваровУслуг_ФормаЧастичногоРазмещения_ПереразместитьВыбраное";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////	
	ОповеститьОВыборе(ПолучитьВыбраннуюНоменклатуру());

КонецПроцедуры
