
Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	ГенерацияСобытий();
	
КонецПроцедуры

Процедура ГенерацияСобытий()
	
	//ОтразитьПросрочкуВозвратаТовараКлиентом();
	
	ОтразитьЗавершениеПоОтказам();
	
	ПеревестиВСтатусИстечениеСроковПервичный();
	
	ПеревестиВСтатусИстечениеСроков();
	
	ПеревестиВСтатусПопыткаОтмены();
	
КонецПроцедуры

//После перевода в отказ ждем 30 дней и завершаем процесс
Процедура ОтразитьЗавершениеПоОтказам()
	
	лКлючАлгоритма = "Обработка_ГенераторСобытийПроцессаВозвратов_МодульОбъекта_ОтразитьЗавершениеПоОтказам";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата,
		|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата.СтатусДокумента КАК СтатусДокумента,
		|	ЕСТЬNULL(РАЗНОСТЬДАТ(МАКСИМУМ(СобытияАктовРассмотренияВозвратаСрезПоследних.Период), &ТекущаяДата, ДЕНЬ), 0) КАК ПродолжительностьНахожденияВСтатусе
		|ИЗ
		|	РегистрСведений.СобытияАктовРассмотренияВозврата.СрезПоследних(
		|			,
		|			АктРассмотренияВозврата.СтатусДокумента = &СтатусДокумента
		|				И СтатусДокумента = &СтатусДокумента
		|				И НЕ ИдентификаторСобытияПрошлойСменыСтатуса = &ПустаяСтрока) КАК СобытияАктовРассмотренияВозвратаСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата,
		|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата.СтатусДокумента
		|
		|ИМЕЮЩИЕ
		|	ЕСТЬNULL(РАЗНОСТЬДАТ(МАКСИМУМ(СобытияАктовРассмотренияВозвратаСрезПоследних.Период), &ТекущаяДата, ДЕНЬ), 0) > &МаксДней";
	
	Запрос.УстановитьПараметр("СтатусДокумента", 	Справочники.СтатусыДокументов.АРВ_ГПРКОтказ);
	Запрос.УстановитьПараметр("ТекущаяДата", 		ТекущаяДата());
	Запрос.УстановитьПараметр("ПустаяСтрока", 		"");
	Запрос.УстановитьПараметр("МаксДней", 			30);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РегистрыСведений.СобытияКОбработкеАктовРассмотренияВозврата.Добавить(Выборка.АктРассмотренияВозврата, 
		Перечисления.ВидыСобытийКОбработкеПроцессаВозвратов.ВыполнитьПереходВСледующийСтатус, Выборка.СтатусДокумента);	

	КонецЦикла;
	
КонецПроцедуры

//За 2 дня до истечения срока возврата перевести в статус "ГВ.Истечение сроков"
Процедура ПеревестиВСтатусИстечениеСроков()
	
	лКлючАлгоритма = "Обработка_ГенераторСобытийПроцессаВозвратов_МодульОбъекта_ПеревестиВСтатусИстечениеСроков";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата
	|ИЗ
	|	РегистрСведений.СобытияАктовРассмотренияВозврата.СрезПоследних(
	|			,
	|			АктРассмотренияВозврата.СтатусДокумента = &СтатусДокумента
	|				И СтатусДокумента = &СтатусДокумента
	|				И НЕ ИдентификаторСобытияПрошлойСменыСтатуса = &ПустаяСтрока) КАК СобытияАктовРассмотренияВозвратаСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДатыКалендарей КАК ДатыКалендарей
	|		ПО (ДатыКалендарей.ДатаКалендаря МЕЖДУ &ТекущаяДата И СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата.СрокВозвратаКлиента)
	|			И (ДатыКалендарей.Календарь = &Календарь)
	|			И (ДатыКалендарей.ВидДня = &ВидДня)
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДатыКалендарей.ДатаКалендаря) = 2";
	
	Запрос.УстановитьПараметр("СтатусДокумента", 	Справочники.СтатусыДокументов.АРВ_ГВЖдемТовар);
	Запрос.УстановитьПараметр("ТекущаяДата", 		НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ПустаяСтрока", 		"");
	Запрос.УстановитьПараметр("Календарь", 			Справочники.Календари.Регламентированный);
	Запрос.УстановитьПараметр("ВидДня", 			Перечисления.ВидыДнейКалендаря.Рабочий);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РегистрыСведений.СобытияКОбработкеАктовРассмотренияВозврата.Добавить(Выборка.АктРассмотренияВозврата, 
		Перечисления.ВидыСобытийКОбработкеПроцессаВозвратов.ВыполнитьПереходВСледующийСтатус, Справочники.СтатусыДокументов.АРВ_ГВЖдемТовар);
		
	КонецЦикла;
	
КонецПроцедуры

// При истечении сроков возврата клиента перевести в статус "ПопыткаОтмены"
Процедура ПеревестиВСтатусПопыткаОтмены()
	
	лКлючАлгоритма = "Обработка_ГенераторСобытийПроцессаВозвратов_МодульОбъекта_ПеревестиВСтатусПопыткаОтмены";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата
	|ИЗ
	|	РегистрСведений.СобытияАктовРассмотренияВозврата.СрезПоследних(
	|			,
	|			АктРассмотренияВозврата.СтатусДокумента = &СтатусДокумента
	|				И СтатусДокумента = &СтатусДокумента
	|				И НЕ ИдентификаторСобытияПрошлойСменыСтатуса = &ПустаяСтрока) КАК СобытияАктовРассмотренияВозвратаСрезПоследних
	|ГДЕ
	|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата.СрокВозвратаКлиента <= &ТекущаяДата";
	
	Запрос.УстановитьПараметр("СтатусДокумента", 	Справочники.СтатусыДокументов.АРВ_ГВИстечениеСроков);
	Запрос.УстановитьПараметр("ТекущаяДата", 		НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ПустаяСтрока", 		"");
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РегистрыСведений.СобытияКОбработкеАктовРассмотренияВозврата.Добавить(Выборка.АктРассмотренияВозврата, 
		Перечисления.ВидыСобытийКОбработкеПроцессаВозвратов.ВыполнитьПереходВСледующийСтатус, Справочники.СтатусыДокументов.АРВ_ГВИстечениеСроков);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПеревестиВСтатусИстечениеСроковПервичный()
	
	лКлючАлгоритма = "Обработка_ГенераторСобытийПроцессаВозвратов_МодульОбъекта_ПеревестиВСтатусИстечениеСроковПервичный";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата
	|ИЗ
	|	РегистрСведений.СобытияАктовРассмотренияВозврата.СрезПоследних(
	|			,
	|			АктРассмотренияВозврата.СтатусДокумента = &СтатусДокумента
	|				И СтатусДокумента = &СтатусДокумента
	|				И НЕ ИдентификаторСобытияПрошлойСменыСтатуса = &ПустаяСтрока) КАК СобытияАктовРассмотренияВозвратаСрезПоследних
	|ГДЕ
	|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата.СрокВозвратаКлиента <= &ТекущаяДата";
	
	Запрос.УстановитьПараметр("СтатусДокумента", 	Справочники.СтатусыДокументов.АРВ_ГВЖдемТовар);
	Запрос.УстановитьПараметр("ТекущаяДата", 		НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ПустаяСтрока", 		"");
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		РегистрыСведений.СобытияКОбработкеАктовРассмотренияВозврата.Добавить(Выборка.АктРассмотренияВозврата, 
		Перечисления.ВидыСобытийКОбработкеПроцессаВозвратов.ВыполнитьПереходВСледующийСтатус, Справочники.СтатусыДокументов.АРВ_ГВЖдемТовар);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура  ОтразитьПросрочкуВозвратаТовараКлиентом()
	
	лКлючАлгоритма = "Обработка_ГенераторСобытийПроцессаВозвратов_МодульОбъекта_ОтразитьПросрочкуВозвратаТовараКлиентом";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	//Есть вопросы. почему не смотрим на срок возврата товара в акте?
	Возврат;

	ДнейПросрочкиМакс = Константы.КоличествоДнейОжиданияПриемкиВозврата.Получить();
	
	Если ДнейПросрочкиМакс = 0 Тогда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата КАК АктРассмотренияВозврата,
	|	ЕСТЬNULL(РАЗНОСТЬДАТ(МАКСИМУМ(СобытияАктовРассмотренияВозвратаСрезПоследних.Период), &ТекущаяДата, МИНУТА), 0) КАК ПродолжительностьНахожденияВСтатусе
	|ИЗ
	|	РегистрСведений.СобытияАктовРассмотренияВозврата.СрезПоследних(
	|			,
	|			АктРассмотренияВозврата.СтатусДокумента = &СтатусДокумента
	|				И НЕ АктРассмотренияВозврата.ПометкаУдаления
	|				И СтатусДокумента = &СтатусДокумента
	|				И НЕ ИдентификаторСобытияПрошлойСменыСтатуса = &ПустаяСтрока) КАК СобытияАктовРассмотренияВозвратаСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияАктовРассмотренияВозвратаСрезПоследних.АктРассмотренияВозврата
	|
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(РАЗНОСТЬДАТ(МАКСИМУМ(СобытияАктовРассмотренияВозвратаСрезПоследних.Период), &ТекущаяДата, МИНУТА), 0) > &МинутПросрочкиМакс";
	
	Запрос.УстановитьПараметр("СтатусДокумента", Справочники.СтатусыДокументов.АРВ_ГВЖдемТовар);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	Запрос.УстановитьПараметр("МинутПросрочкиМакс", ДнейПросрочкиМакс*1440);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		 РегистрыСведений.СобытияКОбработкеАктовРассмотренияВозврата.Добавить(Выборка.АктРассмотренияВозврата, 
		 																		Перечисления.ВидыСобытийКОбработкеПроцессаВозвратов.ПросроченСрокВозвратаТовараКлиентом);	
	КонецЦикла;
	
	
КонецПроцедуры














