
Функция ПолучитьВремяФилиала(Филиал) Экспорт

	ВремяФилиала = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремяЭкспрессДоставкиФилиалов.Время
		|ИЗ
		|	РегистрСведений.ВремяЭкспрессДоставкиФилиалов КАК ВремяЭкспрессДоставкиФилиалов
		|ГДЕ
		|	ВремяЭкспрессДоставкиФилиалов.Филиал = &Филиал";
	
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ВремяФилиала = Выборка.Время;
	КонецЕсли;
	
	Возврат ВремяФилиала;
	
КонецФункции

Процедура  УстановитьВремяФилиала(Филиал, ВремяЭД) Экспорт
	
	Если Не ЗначениеЗаполнено(Филиал) Тогда
		Возврат;
	КонецЕсли;
	
	МЗ = РегистрыСведений.ВремяЭкспрессДоставкиФилиалов.СоздатьМенеджерЗаписи();
	МЗ.Филиал = Филиал;
	МЗ.Время  = ВремяЭД;
	МЗ.Записать();
	
КонецПроцедуры