Процедура ОтобразитьОповещенияТекущемуПользователю() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	История.Период,
	|	История.Кому,
	|	История.ТекстОповещения,
	//Валиахметов А.А. http://jira.part-kom.ru/browse/XX-2549 25.05.2019
	|	История.ОбновитьПараметрыСеанса,
	|	История.ПараметрыОбновленияПараметровСеанса
	//Конец Валиахметов А.А. http://jira.part-kom.ru/browse/XX-2549 25.05.2019
	|ИЗ
	|	РегистрСведений._ИсторияОповещенийПользователей.СрезПоследних(
	|			&ТекущаяДата,
	|			Кому = &ТекущийПользователь
	|				И НЕ Прочитано
	|				И ДатаНачала <= &ТекущаяДата
	|				И ДатаОкончания >= &ТекущаяДата) КАК История"
	);
			
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		//Валиахметов А.А. http://jira.part-kom.ru/browse/XX-2549 25.05.2019
		Если Выборка.ОбновитьПараметрыСеанса Тогда 
			ОшибкаОбновленияПараметровСеанса = Ложь;
			ТекстОшибкиОбновленияПараметровСеанса = "";
			Попытка
				Если ПустаяСтрока(Выборка.ПараметрыОбновленияПараметровСеанса) Тогда 
					ИменаПараметровСеанса = Неопределено;
				Иначе
					ИменаПараметровСеанса = СтрРазделить(Выборка.ПараметрыОбновленияПараметровСеанса, ",");
				КонецЕсли;
				ПривилегированныйСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
			Исключение
				ОшибкаОбновленияПараметровСеанса = Истина;
				ТекстОшибкиОбновленияПараметровСеанса = ОписаниеОшибки();
			КонецПопытки;
			Набор = РегистрыСведений._ИсторияОповещенийПользователей.СоздатьНаборЗаписей();
			Набор.Отбор.Период.Установить(Выборка.Период);
			Набор.Отбор.Кому.Установить(Выборка.Кому);
			Набор.Прочитать();
			Для Каждого Запись Из Набор Цикл 
				Запись.Прочитано = Истина;
				Запись.ОшибкаОбновленияПараметровСеанса = ОшибкаОбновленияПараметровСеанса;
				Запись.ТекстОшибкиОбновленияПараметровСеанса = ТекстОшибкиОбновленияПараметровСеанса;
			КонецЦикла;
			Набор.Записать();
		Иначе
		//Конец Валиахметов А.А. http://jira.part-kom.ru/browse/XX-2549 25.05.2019
		
			ПоказатьОповещениеПользователя("Торговля8. Новое уведомление", , , БиблиотекаКартинок.Важно);
			//
			//СтруктураСообщения = Новый Структура;
			//СтруктураСообщения.Вставить("Период", Выборка.Период);
			//СтруктураСообщения.Вставить("Кому", Выборка.Кому);
			//ПометитьОповещениеПрочитанным(СтруктураСообщения);
			
			ФормаОповещения = ПолучитьОбщуюФорму("ФормаОповещенияПользователя");
			ФормаОповещения.Период = Выборка.Период;
			ФормаОповещения.Кому = Выборка.Кому;
			ФормаОповещения.ТекстСообщения = Выборка.ТекстОповещения;
			
			Если НЕ ФормаОповещения.Открыта() Тогда
				ФормаОповещения.Открыть();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПометитьОповещениеПрочитанным(СтруктураСообщения) Экспорт
	аНабор = РегистрыСведений._ИсторияОповещенийПользователей.СоздатьНаборЗаписей();
	аНабор.Отбор.Период.ВидСравнения = ВидСравнения.Равно;
	аНабор.Отбор.Период.Значение = СтруктураСообщения.Период;
	аНабор.Отбор.Период.Использование = Истина;
	аНабор.Отбор.Кому.ВидСравнения = ВидСравнения.Равно;
	аНабор.Отбор.Кому.Значение = СтруктураСообщения.Кому;
	аНабор.Отбор.Кому.Использование = Истина;
	
	аНабор.Прочитать();
	Для Каждого аЗапись ИЗ аНабор Цикл
		Если аЗапись.КоличествоПовторов = 10 Тогда
			аЗапись.Прочитано = Истина;
		Иначе
			Если СтруктураСообщения.Свойство("Завершить") Тогда
				Если  СтруктураСообщения.Завершить Тогда
					аЗапись.Прочитано = Истина;
				КонецЕсли;
				
			КонецЕсли;
			аЗапись.КоличествоПовторов = аЗапись.КоличествоПовторов + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	аНабор.Записать(Истина);
	
КонецПроцедуры
	
	