
Перем ТабДок, Секция;

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//Если Не РассылатьПокупателям И Не РассылатьПоставщикам Тогда 
	//	Отказ = Истина;
	//	Сообщить("Выберите хотя бы один вид контрагентов для рассылки: поставщиков или покупателей");
	//КонецЕсли;
	Если СтараяОрганизацияТребуется Тогда 
		ПроверяемыеРеквизиты.Добавить("СтараяОрганизация");
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьРассылку() Экспорт 
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Контрагент,
	               |	Контрагенты.ОсновнойДоговорКонтрагента.Организация КАК Организация
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	Контрагенты.ОсновнойДоговорКонтрагента.Организация В(&Организация)
	               |	И Контрагенты.Покупатель
	               |	И ВЫБОР
	               |			КОГДА &ВидДоговора = 1
	               |				ТОГДА Контрагенты.ОсновнойДоговорКонтрагента.ДоговорПриостановлен
	               |			КОГДА &ВидДоговора = 2
	               |				ТОГДА НЕ Контрагенты.ОсновнойДоговорКонтрагента.ДоговорПриостановлен
	               |			ИНАЧЕ ИСТИНА
	               |		КОНЕЦ";
	
	Запрос.УстановитьПараметр("Организация", Организации.ВыгрузитьКолонку(0));
	//Запрос.УстановитьПараметр("РассылатьПокупателям", РассылатьПокупателям);
	//Запрос.УстановитьПараметр("РассылатьПоставщикам", РассылатьПоставщикам);
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Если СтараяОрганизацияТребуется Тогда 
		ОтсеятьПоСтаройОрганизации(Таблица);
	КонецЕсли;
	
	//Если Не ВыгружатьЕслиНетДолгов Тогда 
	//	ОтсеятьБезДолгов(Таблица);
	//КонецЕсли;
	Таблица.Колонки.Добавить("Отослан", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Ошибка", Новый ОписаниеТипов("Булево")); 
	Таблица.Колонки.Добавить("ТекстОшибки", ОбщегоНазначения.ОписаниеТипаСтрока(300));
	
	СверТаблица = Таблица.Скопировать(, "Контрагент");
	СверТаблица.Свернуть("Контрагент");
	Для Каждого СтрокаСв Из СверТаблица Цикл 
		Строки = Таблица.НайтиСтроки(Новый Структура("Контрагент", СтрокаСв.Контрагент));
		Для Каждого СтрокаТЧ Из Строки Цикл 
			СтруктураОтчета = СформироватьОтчет(СтрокаТЧ.Контрагент, СтрокаТЧ.Организация);
			СтрокаТЧ.Отослан = ОтослатьПоПочте(СтруктураОтчета);
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтруктураОтчета, "Ошибка, ТекстОшибки");
			Если СтрокаТЧ.Ошибка Тогда 
				СтрокаТЧ.ТекстОшибки = "Ошибка: " + СтрокаТЧ.ТекстОшибки;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	//#Если Клиент Тогда 
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда 	
		СформироватьТабличныйДокумент(Таблица);
	КонецЕсли;
	//#КонецЕсли
КонецПроцедуры

Процедура ОтсеятьПоСтаройОрганизации(Таблица)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица.Контрагент,
	               |	Таблица.Организация
	               |ПОМЕСТИТЬ Таблица
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДоговорыКонтрагентов.Владелец
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	ДоговорыКонтрагентов.Организация = &Организация
	               |	И ДоговорыКонтрагентов.Владелец В
	               |			(ВЫБРАТЬ
	               |				Таблица.Контрагент
	               |			ИЗ
	               |				Таблица)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таблица.Контрагент,
	               |	Таблица.Организация
	               |ПОМЕСТИТЬ вт2
	               |ИЗ
	               |	Таблица КАК Таблица
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ вт КАК вт
	               |		ПО Таблица.Контрагент = вт.Владелец
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	вт2.Контрагент,
	               |	вт2.Организация
	               |ИЗ
	               |	вт2 КАК вт2
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	вт2.Контрагент,
	               |	&Организация
	               |ИЗ
	               |	вт2 КАК вт2";
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Запрос.УстановитьПараметр("Организация", СтараяОрганизация);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

Функция  СформироватьОтчет(Контрагент, Организация)
	
	СтруктураОтчета = Новый Структура("Ошибка,ТекстОшибки", Ложь, "");
	СтруктураОтчета.Вставить("Организация", Организация);
	СтруктураОтчета.Вставить("Контрагент", Контрагент);
	СтруктураОтчета.Вставить("Договор", Неопределено);
	СтруктураОтчета.Вставить("НачалоПериода", НачалоПериода);
	СтруктураОтчета.Вставить("ОкончаниеПериода", КонецПериода);
	СтруктураОтчета.Вставить("ТабличныйДокумент", Новый ТабличныйДокумент);
	
	Отчет = Отчеты.АктСверкиВзаиморасчетов.Создать();
	Отчет.ЗаполнитьАктСверки(СтруктураОтчета);
	
	Возврат СтруктураОтчета;
	
КонецФункции

Функция  ОтослатьПоПочте(СтруктураОтчета)
	
	Если Не СтруктураОтчета.Ошибка Тогда 		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	КонтактнаяИнформация.Представление КАК Адрес
		               |ИЗ
		               |	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
		               |ГДЕ
		               |	КонтактнаяИнформация.Объект = &Объект
		               |	И КонтактнаяИнформация.Вид = &ВидЭмейл
		               |	И КонтактнаяИнформация.Представление <> """"";
		Запрос.УстановитьПараметр("Объект", СтруктураОтчета.Контрагент);
		Запрос.УстановитьПараметр("ВидЭмейл", Справочники.ВидыКонтактнойИнформации.EmailДляОбменаДокументамиСКонтрагентами);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда 
			СтруктураОтчета.Ошибка = Истина;
			СтруктураОтчета.ТекстОшибки = "У контрагента" + СтруктураОтчета.Контрагент + " нет адреса для обмена документами";
			Возврат Ложь;
		КонецЕсли;
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
				
		Параметры = Новый Структура;
		Параметры.Вставить("Отчет", СтруктураОтчета.ТабличныйДокумент);
		Параметры.Вставить("ШаблонПисьма", Справочники.ШаблоныТекстовПисем.ПустаяСсылка());
		Параметры.Вставить("ВидТекстаПисьма", Перечисления.ВидыТекстовЭлектронныхПисем.Текст);
		Параметры.Вставить("АдресЭлектроннойПочтыКонтрагента", Выборка.Адрес);
		Параметры.Вставить("ОбъектПечати", СтруктураОтчета.Контрагент);
		Параметры.Вставить("ВложенияHTML", Ложь);
		Параметры.Вставить("ВложенияTXT", Ложь);
		Параметры.Вставить("ВложенияXLS", Истина);
		Параметры.Вставить("ВложенияMXL", Ложь);
		Параметры.Вставить("ИмяФайлаВложения", "Акт сверки взаиморасчетов");
		Параметры.Вставить("ТемаСообщения", "Акт сверки взаиморасчетов");
		Параметры.Вставить("ЗаполнятьТекстПисьма", Истина);
        Попытка
			Если ВыгружатьЕслиНетДолгов Или СтруктураОтчета.Сальдо <> 0 Тогда  
				УправлениеЭлектроннойПочтой.ОтправитьОтчет(Параметры);
				Возврат Истина;
			Иначе
				СтруктураОтчета.ТекстОшибки = "Нет долгов";
			КонецЕсли;
		Исключение
			СтруктураОтчета.Ошибка = Истина;
			СтруктураОтчета.ТекстОшибки = ОписаниеОшибки();
		КонецПопытки;		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура СформироватьТабличныйДокумент(Таблица)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Таблица.Контрагент,
	               |	Таблица.Организация,
	               |	Таблица.Отослан,
	               |	Таблица.Ошибка,
	               |	Таблица.ТекстОшибки
	               |ПОМЕСТИТЬ Таблица
	               |ИЗ
	               |	&Таблица КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таблица.Контрагент,
	               |	Таблица.Организация,
	               |	Таблица.Отослан,
	               |	Таблица.Ошибка,
	               |	Таблица.ТекстОшибки
	               |ИЗ
	               |	Таблица КАК Таблица
	               |ИТОГИ ПО
	               |	Таблица.Контрагент";
	Запрос.УстановитьПараметр("Таблица", Таблица);
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
    ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Макет");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(Шапка);
	
	Секция = ТабДок.ПолучитьОбласть("R2");
    ТабДок.НачатьАвтогруппировкуСтрок();
    ПечатьДерева (Дерево,,Дерево.Колонки);
    ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ПоместитьВоВременноеХранилище(ТабДок, Адрес);
	//ТабДок.Показать();
КонецПроцедуры

Процедура ПечатьДерева ( СтрокаДерева,Уровень = 0,Колонки)
    Для Каждого стр Из СтрокаДерева.Строки Цикл
        НомерКолонки = 0;
        отступ = "";
        Для н = 1 По Уровень Цикл   
            отступ = отступ + " ";
        КонецЦикла;
        Для Каждого КЛ Из Колонки Цикл
            НомерКолонки = НомерКолонки + 1;
            Секция.Область(1, НомерКолонки).Текст = ?(НомерКолонки = 1, отступ+стр[КЛ.Имя], стр[КЛ.Имя]);
        КонецЦикла;
        ТабДок.Вывести(Секция,Уровень+1);
        ПечатьДерева(стр,Уровень+1,Колонки);
    КонецЦикла;
КонецПроцедуры

