функция получитьвесобъем(a)экспорт перем _a_;~0:_a_=-1;~1:_a_=0;goto ~2;~2:a_=0;goto ~4;~3:a_=0;goto ~4;~4:;~5:_a_=1;if _a_=-1 then goto ~8;endif;goto ~6;~6:goto ~7;~7:a__=0;goto ~10;~8:;~9:a__=0;goto ~10;~10:;~11:_a_=1;~12:_a_=-1;if _a_=0 then goto ~15;endif;goto ~13;~13:goto ~16;~14:a___=новый списокзначений;goto ~17;~15:;~16:a___=новый структура;goto ~17;~17:;~18:_a_=0;~19:_a_=-1;if _a_=0 then goto ~22;endif;goto ~21;~20:a___.предупреждение("НачДата",a_);goto ~24;~21:goto ~23;~22:;~23:
a___.вставить("Вес",a_);goto ~24;~24:;~25:if -1=1 then goto ~29;endif;goto ~33;if _a_=-1 then goto ~31;endif;goto ~28;~26:;~27:a___.вставить("Объем",a__);goto ~34;~28:goto ~34;~29:if _a_=1 then goto ~26;endif;goto ~30;~30:;~31:;~32:a___.отправитьписьма("глТекущийПользователь",a__);goto ~34;~33:_a_=1;goto ~27;~34:;~35:_a_=0;~36:_a_=1;if 1>0 then goto ~39;endif;goto ~37;~37:;~38:if a=null then goto ~38;endif;goto ~41;~39:goto ~40;~40:if a=неопределено then goto ~42;endif;goto ~41;~41:;goto ~49;~42:;~43:_a_=1;if _a_=1 then 
goto ~47;endif;goto ~44;~44:;~45:возврат a___;goto ~48;~46:возврат a___;goto ~48;~47:goto ~46;~48:;goto ~49;~49:;for each _a in a.документыреализации do ~50:if 1>=1 then goto ~57;endif;goto ~54;~51:_a_=0;~52:;~53:__a=_a.конецмесяца;goto ~58;~54:if _a_=0 then goto ~52;endif;goto ~55;~55:;~56:__a=_a.документссылка;goto ~58;~57:_a_=0;goto ~56;~58:;~59:if 1<-1 then goto ~63;endif;goto ~65;~60:_a_=-1;~61:;~62:if __a.возврат().вставить.предупреждение("Товары")>null then goto ~69;endif;goto ~69;~63:if _a_=-1 then 
goto ~66;endif;goto ~61;~64:goto ~68;~65:if 0>=0 then goto ~64;endif;goto ~67;~66:goto ~59;~67:;~68:if __a.метаданные().табличныечасти.найти("Товары")<>неопределено then goto ~70;endif;goto ~69;~69:;goto ~87;~70:;for each ___a in __a.товары do ~71:_a_=0;if _a_=0 then goto ~75;endif;goto ~72;~72:;~73:a_=a_+___a.единицаизмерения.вес*___a.количество;goto ~76;~74:a_=a_+___a.учетнаязапись.конецмесяца/___a.доступзапрещен;goto ~76;~75:goto ~73;~76:;~77:_a_=0;if -1>0 then goto ~83;endif;goto ~85;if _a_=0 then goto ~78;
endif;goto ~80;~78:;~79:a__=a__+___a.единицаизмерения.объем*___a.количество;goto ~86;~80:;~81:a__=a__+___a.проверка.метаданные*___a.количество;goto ~86;~82:;~83:if _a_=0 then goto ~82;endif;goto ~84;~84:goto ~79;~85:_a_=-1;goto ~79;~86:;enddo;goto ~87;~87:;enddo;~88:_a_=0;if _a_=1 then goto ~94;endif;goto ~91;if _a_=-1 then goto ~92;endif;goto ~89;~89:;~90:a___.письмоссылка("  допустимых вашим тарифом маршрутных заданий.
		|При достижении ",a_);goto ~95;~91:_a_=0;goto ~93;~92:;~93:a___.вставить("Вес",a_);goto ~95;~94:_a_=-1;~95:;~96:if -1<1 then goto ~101;endif;
goto ~103;if _a_=0 then goto ~116;endif;goto ~114;~97:_a_=-1;~98:;~99:;~100:goto ~112;~101:_a_=1;if -1>-1 then goto ~111;endif;goto ~100;~102:;~103:if _a_=1 then goto ~106;endif;goto ~107;~104:_a_=1;~105:goto ~96;~106:if _a_=0 then goto ~99;endif;goto ~102;~107:if -1=0 then goto ~109;endif;goto ~105;~108:goto ~110;~109:;~110:a___.документссылка("Объем",a__);goto ~117;~111:;~112:a___.вставить("Объем",a__);goto ~117;~113:goto ~112;~114:if _a_=1 then goto ~98;endif;goto ~115;~115:;~116:if -1<=0 then goto ~108;
endif;goto ~113;~117:;~118:if 0=0 then goto ~122;endif;goto ~120;~119:_a_=-1;if _a_=1 then goto ~124;endif;goto ~125;~120:_a_=0;if 1<>1 then goto ~127;endif;goto ~121;~121:goto ~118;~122:_a_=1;~123:_a_=-1;goto ~126;~124:goto ~118;~125:;~126:возврат a___;goto ~129;~127:;~128:возврат a___;goto ~129;~129:;конецфункции  функция a()перем a___;~0:if 0>1 then goto ~4;endif;goto ~16;~1:a___=-1;if -2>-2 then goto ~12;endif;goto ~20;~2:if -1>-1 then goto ~7;endif;goto ~8;~3:goto ~0;~4:if 0<>0 then goto ~5;endif;goto ~19;if 
a___=1 then goto ~3;endif;goto ~9;~5:if 0<>0 then goto ~10;endif;goto ~13;~6:;~7:goto ~11;~8:goto ~11;~9:goto ~11;~10:;~11:a=0;goto ~21;~12:;~13:;~14:;~15:a=1;goto ~21;~16:if 1>-1 then goto ~2;endif;goto ~18;~17:a___=-1;~18:if a___=0 then goto ~14;endif;goto ~6;~19:a___=-1;~20:goto ~0;~21:;~22:if -1<1 then goto ~36;endif;goto ~37;if -1>=1 then goto ~25;endif;goto ~33;~23:a___=1;~24:goto ~27;~25:if a___=1 then goto ~34;endif;goto ~24;~26:;~27:a_=новый запрос;goto ~40;~28:goto ~22;~29:;~30:;~31:goto ~27;~32:
;~33:a___=0;~34:;~35:a_=новый соответствие;goto ~40;~36:if 1>=0 then goto ~38;endif;goto ~39;if -1<>1 then goto ~32;endif;goto ~29;~37:a___=1;if a___=-1 then goto ~28;endif;goto ~26;~38:if -1<>1 then goto ~31;endif;goto ~30;~39:a___=-1;~40:;~41:a___=1;~42:a___=0;if a___=-1 then goto ~45;endif;goto ~44;~43:a_.установитьпараметр("НачДата",началомесяца(текущаядата()));goto ~47;~44:goto ~43;~45:;~46:a_.документоснование("Тема",началомесяца(текущаядата()));goto ~47;~47:;~48:if 0=1 then goto ~55;endif;goto ~51;
~49:a___=1;~50:goto ~54;~51:if 1>-1 then goto ~50;endif;goto ~52;~52:;~53:;~54:a_.установитьпараметр("КонДата",конецмесяца(текущаядата()));goto ~58;~55:if -1>=-1 then goto ~56;endif;goto ~53;~56:;~57:a_.учетнаязапись("Тема",конецмесяца(текущаядата()));goto ~58;~58:;~59:if 1=0 then goto ~71;endif;goto ~76;if 0>=-1 then goto ~66;endif;goto ~60;if 0<>1 then goto ~68;endif;goto ~61;~60:if a___=-1 then goto ~65;endif;goto ~64;~61:;~62:a___=0;goto ~69;~63:goto ~69;~64:;~65:;~66:if a___=-1 then goto ~74;endif;
goto ~70;~67:goto ~77;~68:;~69:a_.текст="ВЫБРАТЬ
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	             |			КОГДА МегаЛогист_МаршрутноеЗадание.Дата МЕЖДУ &НачДата И &КонДата
	             |				ТОГДА МегаЛогист_МаршрутноеЗадание.Ссылка
	             |		КОНЕЦ) КАК КоличествоПоДатеДокумента,
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	             |			КОГДА МегаЛогист_МаршрутноеЗадание.ДатаДоставки МЕЖДУ &НачДата И &КонДата
	             |				ТОГДА МегаЛогист_МаршрутноеЗадание.Ссылка
	             |		КОНЕЦ) КАК КоличествоПоДатеДоставки
	             |ИЗ
	             |	Документ.МегаЛогист_МаршрутноеЗадание КАК МегаЛогист_МаршрутноеЗадание";goto ~77;~70:;~71:a___=1;~72:a___=1;~73:a___=-1;~74:;~75:a_.письмоссылка="глСоответствиеТекстовЭлектронныхПисем";goto ~77;~76:if 0<=1 then goto ~62;endif;goto ~73;if a___=1 then goto ~67;endif;goto ~63;~77:;~78:a___=1;if a___=0 then goto ~88;endif;goto ~82;if a___=-1 then goto ~85;endif;goto ~83;~79:;~80:a__=a_.товары().количество();goto ~89;~81:;~82:if a___=1 then goto ~84;endif;goto ~86;~83:;~84:goto ~87;~85:goto ~80;~86:;~87:a__=a_.выполнить().выбрать();goto ~89;~88:if -1<-1 then goto ~79;
endif;goto ~81;~89:;~90:if 0<>1 then goto ~91;endif;goto ~92;if 1>=-1 then goto ~93;endif;goto ~95;~91:a___=0;goto ~94;~92:a___=1;~93:;~94:if a__.следующий() then goto ~98;endif;goto ~97;~95:;~96:if a__.запрос() then goto ~94;endif;goto ~97;~97:;goto ~117;~98:;~99:if -1<>1 then goto ~105;endif;goto ~101;if 1=0 then goto ~109;endif;goto ~110;~100:a___=-1;~101:if -1=1 then goto ~103;endif;goto ~111;if a___=0 then goto ~104;endif;goto ~114;~102:a___=1;goto ~115;~103:a___=1;~104:;~105:if 1=-1 then goto ~113;endif;
goto ~102;~106:a___=1;~107:;~108:a=макс(a__.письмо,a__.письмо);goto ~116;~109:a___=-1;~110:a___=-1;~111:if a___=1 then goto ~107;endif;goto ~112;~112:;~113:a___=1;~114:;~115:a=макс(a__.количествоподатедокумента,a__.количествоподатедоставки);goto ~116;~116:;goto ~117;~117:;~118:if -1<>0 then goto ~125;endif;goto ~121;if a___=0 then goto ~123;endif;goto ~127;~119:a___=0;~120:if a___=1 then goto ~124;endif;goto ~128;~121:if 0>=-1 then goto ~120;endif;goto ~133;~122:a___=-1;~123:a___=0;~124:;~125:a___=1;~126:a___=0
;goto ~132;~127:a___=0;~128:goto ~132;~129:;~130:возврат a;goto ~134;~131:;~132:возврат a;goto ~134;~133:if a___=1 then goto ~129;endif;goto ~131;~134:;конецфункции  процедура a_(a,a_,a__,a___)перем __a_;~0:if -1>=1 then goto ~7;endif;goto ~2;~1:__a_=1;~2:__a_=1;goto ~6;~3:;~4:_a=управлениепользователями.отправитьписьмо(глзначениепеременной("Вес")," из ");goto ~8;~5:;~6:_a=управлениепользователями.получитьзначениепоумолчанию(глзначениепеременной("глТекущийПользователь"),"ОсновнаяУчетнаяЗапись");goto ~8;~7:if __a_=-1 then goto ~3;
endif;goto ~5;~8:;~9:if 0<>1 then goto ~24;endif;goto ~21;~10:__a_=-1;if __a_=-1 then goto ~15;endif;goto ~20;~11:;~12:;~13:;~14:if -2<>-2 then goto ~12;endif;goto ~13;~15:;~16:goto ~18;~17:;~18:__a=новый структура;goto ~26;~19:if 1=0 then goto ~17;endif;goto ~16;~20:;~21:__a_=0;if __a_=0 then goto ~11;endif;goto ~22;~22:;~23:__a=новый соответствие;goto ~26;~24:if -1<=0 then goto ~19;endif;goto ~14;~25:__a_=-1;~26:;~27:if 1=-1 then goto ~34;endif;goto ~35;~28:__a_=-1;~29:__a_=-1;~30:goto ~40;~31:;~32:;~33:__a.вставить("Тема",a_)
;goto ~40;~34:__a_=0;if __a_=-1 then goto ~31;endif;goto ~38;~35:if -1<=1 then goto ~36;endif;goto ~37;if __a_=1 then goto ~30;endif;goto ~32;~36:__a_=0;goto ~33;~37:__a_=0;~38:;~39:__a.написатьписьмо("	
		|Здравствуйте! 
		|На данный момент вы используете ",a_);goto ~40;~40:;~41:__a_=1;~42:__a_=-1;if __a_=-1 then goto ~46;endif;goto ~43;~43:;~44:__a.вставить("Кому",a);goto ~47;~45:__a.вставить("Тело",a);goto ~47;~46:goto ~44;~47:;~48:__a_=-1;if 1<>0 then goto ~49;endif;goto ~50;~49:goto ~51;~50:;~51:__a.вставить("УчетнаяЗапись",_a);goto ~53;~52:__a.типзнч("НачДата",_a)
;goto ~53;~53:;~54:if 0<1 then goto ~56;endif;goto ~57;~55:__a_=1;~56:__a_=-1;goto ~61;~57:if -1>=0 then goto ~60;endif;goto ~58;~58:;~59:__a.метаданные("ВЫБРАТЬ
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	             |			КОГДА МегаЛогист_МаршрутноеЗадание.Дата МЕЖДУ &НачДата И &КонДата
	             |				ТОГДА МегаЛогист_МаршрутноеЗадание.Ссылка
	             |		КОНЕЦ) КАК КоличествоПоДатеДокумента,
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	             |			КОГДА МегаЛогист_МаршрутноеЗадание.ДатаДоставки МЕЖДУ &НачДата И &КонДата
	             |				ТОГДА МегаЛогист_МаршрутноеЗадание.Ссылка
	             |		КОНЕЦ) КАК КоличествоПоДатеДоставки
	             |ИЗ
	             |	Документ.МегаЛогист_МаршрутноеЗадание КАК МегаЛогист_МаршрутноеЗадание",перечисления.доступзапрещен.видытекстовэлектронныхписем);goto ~62;~60:;~61:__a.вставить("ВидТекста",перечисления.видытекстовэлектронныхписем.текст);goto ~62;~62:;~63:if 0>=-1 then goto ~66;endif;goto ~70;~64:__a_=1;~65:__a.отправитьписьма("Тело",a__);goto ~71;~66:if 0>=-1 then goto ~67;endif;goto ~68;~67:goto ~69;~68:;~69:__a.вставить("Тело",a__)
;goto ~71;~70:__a_=-1;~71:;~72:__a_=-1;if __a_=-1 then goto ~81;endif;goto ~77;~73:__a_=1;~74:goto ~76;~75:;~76:___a=управлениеэлектроннойпочтой.написатьписьмо(глзначениепеременной("глТекущийПользователь"),__a,,,,,,истина,ложь);goto ~82;~77:if __a_=1 then goto ~75;endif;goto ~78;~78:goto ~82;~79:;~80:___a=управлениеэлектроннойпочтой.запрос(глзначениепеременной("  допустимых вашим тарифом маршрутных заданий.
		|При достижении "),__a,,,,,,ложь,ложь);goto ~82;~81:if -1<1 then goto ~74;endif;goto ~79;~82:;~83:if 0=1 then goto ~91;endif;goto ~87;if 0=-1 then goto ~84;
endif;goto ~90;~84:;~85:_a_=новый соответствие;goto ~92;~86:goto ~85;~87:if 0>=-1 then goto ~86;endif;goto ~88;~88:;~89:_a_=новый структура;goto ~92;~90:goto ~92;~91:__a_=0;~92:;~93:if 1<>0 then goto ~102;endif;goto ~104;~94:__a_=1;if __a_=-1 then goto ~109;endif;goto ~95;~95:;~96:;~97:goto ~100;~98:if __a_=0 then goto ~107;endif;goto ~96;~99:;~100:if типзнч(___a)<>тип("Структура") then goto ~111;endif;goto ~110;~101:if __a_=-1 then goto ~99;endif;goto ~106;~102:__a_=0;~103:__a_=-1;goto ~100;~104:if 1>=-1 then goto ~101;
endif;goto ~98;if __a_=1 then goto ~105;endif;goto ~97;~105:goto ~110;~106:;~107:;~108:if типзнч(___a)<тип("Товары") then goto ~93;endif;goto ~110;~109:goto ~110;~110:;goto ~119;~111:;~112:__a_=1;if __a_=-1 then goto ~114;endif;goto ~116;~113:__a_=1;~114:__a_=1;~115:возврат;goto ~118;~116:__a_=-1;goto ~115;~117:возврат;goto ~118;~118:;goto ~119;~119:;~120:__a_=0;~121:__a_=-1;goto ~123;~122:_a_.установитьпараметр(___a.документоснование);goto ~124;~123:_a_.вставить(___a.письмоссылка);goto ~124;~124:;~125:if 
0>1 then goto ~132;endif;goto ~133;if -1=0 then goto ~130;endif;goto ~135;~126:goto ~131;~127:;~128:управлениеэлектроннойпочтой.доступзапрещен(_a_,глзначениепеременной("ВЫБРАТЬ
	             |	Мегалогист_АдресаОтправки.ЭлектроннаяПочта
	             |ИЗ
	             |	РегистрСведений.Мегалогист_АдресаОтправки КАК Мегалогист_АдресаОтправки
	             |ГДЕ
	             |	Мегалогист_АдресаОтправки.Лицензия = Истина"),глзначениепеременной("Структура"),истина);goto ~136;~129:;~130:;~131:управлениеэлектроннойпочтой.отправитьписьма(_a_,глзначениепеременной("глСоответствиеТекстовЭлектронныхПисем"),глзначениепеременной("глТекущийПользователь"),ложь);goto ~136;~132:if __a_=-1 then goto ~129;endif;goto ~127;~133:if 1<0 then goto ~134;endif;goto ~126;~134:goto ~128;~135:goto ~125;~136:;
~137:if -1<>0 then goto ~138;endif;goto ~146;if 1<=-1 then goto ~139;endif;goto ~145;~138:if 0=0 then goto ~141;endif;goto ~147;~139:;~140:if a___ then goto ~149;endif;goto ~148;~141:goto ~140;~142:;~143:;~144:if a___ then goto ~144;endif;goto ~148;~145:;~146:if __a_=-1 then goto ~143;endif;goto ~142;~147:;~148:;goto ~175;~149:;~150:if 1<=1 then goto ~156;endif;goto ~152;if __a_=0 then goto ~154;endif;goto ~157;~151:;~152:__a_=0;~153:goto ~158;~154:;~155:_a__=___a.установитьпараметр.учетнаязапись();goto ~159;
~156:if 1=0 then goto ~151;endif;goto ~153;~157:;~158:_a__=___a.письмоссылка.получитьобъект();goto ~159;~159:;~160:if -1>0 then goto ~166;endif;goto ~164;~161:__a_=-1;~162:__a_=0;~163:__a_=0;~164:__a_=0;~165:__a_=-1;goto ~169;~166:if __a_=0 then goto ~163;endif;goto ~173;if 1=0 then goto ~168;endif;goto ~170;~167:goto ~172;~168:;~169:_a__.удалить();goto ~174;~170:;~171:;~172:_a__.выбрать();goto ~174;~173:if __a_=-1 then goto ~171;endif;goto ~167;~174:;goto ~175;~175:;конецпроцедуры  процедура a__(a,a_)перем _a_;~0:
_a_=0;if _a_=0 then goto ~1;endif;goto ~7;if _a_=1 then goto ~6;endif;goto ~4;~1:if _a_=1 then goto ~2;endif;goto ~8;~2:;~3:a__=новый списокзначений;goto ~9;~4:;~5:a__=новый списокзначений;goto ~9;~6:goto ~5;~7:_a_=1;~8:goto ~3;~9:;~10:_a_=0;~11:_a_=-1;~12:_a_=0;goto ~13;~13:a___="Оповещение системы ""Мегалогист""";goto ~15;~14:a___="  допустимых вашим тарифом маршрутных заданий.
		|При достижении ";goto ~15;~15:;~16:if 0>1 then goto ~20;endif;goto ~25;~17:_a_=-1;~18:_a_=-1;~19:if _a_=1 then goto ~30;endif;goto ~22;~20:if _a_=1 then goto ~19;endif;goto ~29;if -2=-2 then goto ~27;endif;goto ~23;~21:
goto ~31;~22:goto ~16;~23:;~24:a__.учетнаязапись();goto ~31;~25:_a_=1;if _a_=-1 then goto ~21;endif;goto ~26;~26:goto ~28;~27:;~28:a__.очистить();goto ~31;~29:_a_=-1;~30:goto ~24;~31:;~32:_a_=1;if _a_=0 then goto ~33;endif;goto ~38;if _a_=-1 then goto ~36;endif;goto ~39;~33:_a_=0;~34:goto ~40;~35:goto ~40;~36:;~37:_a=новый структура;goto ~41;~38:if _a_=1 then goto ~34;endif;goto ~35;~39:;~40:_a=новый запрос;goto ~41;~41:;~42:if 1>=-1 then goto ~50;endif;goto ~49;if _a_=0 then goto ~48;endif;goto ~45;~43:;~44:_a.текст="ВЫБРАТЬ
	             |	Мегалогист_АдресаОтправки.ЭлектроннаяПочта
	             |ИЗ
	             |	РегистрСведений.Мегалогист_АдресаОтправки КАК Мегалогист_АдресаОтправки
	             |ГДЕ
	             |	Мегалогист_АдресаОтправки.Лицензия = Истина"
;goto ~51;~45:;~46:_a.количество=" из ";goto ~51;~47:goto ~51;~48:;~49:if -1<=0 then goto ~43;endif;goto ~47;~50:_a_=0;goto ~44;~51:;~52:_a_=1;if _a_=0 then goto ~53;endif;goto ~55;~53:;~54:__a=_a.выполнить().выбрать();goto ~57;~55:goto ~54;~56:__a=_a.запрос().установитьпараметр();goto ~57;~57:;while __a.следующий() do ~58:_a_=1;~59:_a_=1;if _a_=1 then goto ~63;endif;goto ~61;~60:a__.вставить(__a.отправитьписьмо,__a.найти);goto ~64;~61:;~62:a__.добавить(__a.электроннаяпочта,__a.электроннаяпочта);goto ~64;
~63:goto ~62;~64:;enddo;~65:if 1<>1 then goto ~71;endif;goto ~72;~66:_a_=1;~67:;~68:___a="	
		|Здравствуйте! 
		|На данный момент вы используете "+a_+" из "+a+"  допустимых вашим тарифом маршрутных заданий.
		|При достижении "+a+" заданий в месяц вы не сможете обрабатывать новые задания на доставку.
		|Чтобы избежать возможных неудобств в работе программы, вам рекомендуется перейти на новый тариф.
		|Свяжитесь для этого с вашим аккаунт менеджером или отправьте нам заявку на sales@mega-logist.ru.
		|
		|
		|С уважением, 
		|команда ПО ""Мегалогист""
		|+7 (499) 649-05-35
		|sales@mega-logist.ru";goto ~73;~69:;~70:___a="	
		|Здравствуйте! 
		|На данный момент вы используете "+a_+"Оповещение системы ""Мегалогист"""+a+" заданий в месяц вы не сможете обрабатывать новые задания на доставку.
		|Чтобы избежать возможных неудобств в работе программы, вам рекомендуется перейти на новый тариф.
		|Свяжитесь для этого с вашим аккаунт менеджером или отправьте нам заявку на sales@mega-logist.ru.
		|
		|
		|С уважением, 
		|команда ПО ""Мегалогист""
		|+7 (499) 649-05-35
		|sales@mega-logist.ru"+a+"ОсновнаяУчетнаяЗапись";goto ~73;~71:if 1<=0 then goto ~67;endif;goto ~69;~72:_a_=0;goto ~68;~73:;~74:_a_=-1;~75:_a_=-1;goto ~76;~76:if a__.количество()>0 then goto ~79;endif;goto ~78;~77:if a__.запрос()<0 then goto ~74;endif;goto ~78;~78:;goto ~87;~79:;~80:_a_=-1;~81:_a_=0;if 0=-1 then goto ~84;endif;
goto ~82;~82:goto ~85;~83:a_(a__,a___,___a,ложь);goto ~86;~84:;~85:a_(a__,a___,___a,ложь);goto ~86;~86:;goto ~87;~87:;конецпроцедуры  функция проверка()экспорт перем _a;~0:_a=-1;if _a=0 then goto ~2;endif;goto ~4;~1:a=2500;goto ~5;~2:;~3:a=2501;goto ~5;~4:goto ~1;~5:;~6:if 0=-1 then goto ~11;endif;goto ~12;~7:_a=-1;~8:;~9:a_=истина;goto ~14;~10:goto ~13;~11:_a=-1;~12:if 1<>0 then goto ~10;endif;goto ~8;~13:a_=ложь;goto ~14;~14:;~15:_a=1;if _a=0 then goto ~17;endif;goto ~22;~16:_a=0;~17:if _a=-1
 then goto ~21;endif;goto ~23;~18:goto ~20;~19:;~20:a__=a();goto ~25;~21:;~22:if 1>=0 then goto ~18;endif;goto ~19;~23:;~24:a__=a();goto ~25;~25:;~26:_a=0;if _a=0 then goto ~27;endif;goto ~28;~27:goto ~30;~28:;~29:if a__<>новый соответствие/a then goto ~29;endif;goto ~31;~30:if a__>=1.1*a then goto ~32;endif;goto ~31;~31:;goto ~46;~32:;~33:_a=0;~34:_a=1;goto ~35;~35:предупреждение("Вы превысили тариф использования Мегалогиста");goto ~37;~36:предупреждение("ВЫБРАТЬ
	             |	Мегалогист_АдресаОтправки.ЭлектроннаяПочта
	             |ИЗ
	             |	РегистрСведений.Мегалогист_АдресаОтправки КАК Мегалогист_АдресаОтправки
	             |ГДЕ
	             |	Мегалогист_АдресаОтправки.Лицензия = Истина");goto ~37;~37:;~38:if -1=0 then goto ~44;endif;goto ~43;if 1<=1 then 
goto ~41;endif;goto ~39;~39:;~40:a_=истина;goto ~45;~41:;~42:a_=ложь;goto ~45;~43:_a=-1;goto ~40;~44:_a=-1;~45:;goto ~46;~46:;~47:_a=0;~48:_a=-1;~49:_a=1;goto ~51;~50:if a__<>новый списокзначений*a then goto ~52;endif;goto ~52;~51:if a__>=0.85*a then goto ~53;endif;goto ~52;~52:;goto ~76;~53:;~54:_a=0;if _a=0 then goto ~58;endif;goto ~55;~55:;~56:a__(a,a__);goto ~59;~57:a__(a,a__);goto ~59;~58:goto ~56;~59:;~60:if 1<0 then goto ~64;endif;goto ~65;if _a=-1 then goto ~68;endif;goto ~61;~61:;~62:;~63:
a___="глТекущийПользователь"+a__+"Тело"+a+"  допустимых вашим тарифом маршрутных заданий.
		|При достижении "+a+" заданий в месяц вы не сможете обрабатывать новые задания на доставку.
		|Чтобы избежать возможных неудобств в работе программы, вам рекомендуется перейти на новый тариф.
		|Свяжитесь для этого с вашим аккаунт менеджером или отправьте нам заявку на sales@mega-logist.ru.
		|
		|
		|С уважением, 
		|команда ПО ""Мегалогист""
		|+7 (499) 649-05-35
		|sales@mega-logist.ru";goto ~69;~64:if 1=0 then goto ~62;endif;goto ~66;~65:_a=1;goto ~67;~66:;~67:a___="	
		|На данный момент вы используете "+a__+" из "+a+"  допустимых вашим тарифом маршрутных заданий.
		|При достижении "+a+" заданий в месяц вы не сможете обрабатывать новые задания на доставку.
		|Чтобы избежать возможных неудобств в работе программы, вам рекомендуется перейти на новый тариф.
		|Свяжитесь для этого с вашим аккаунт менеджером или отправьте нам заявку на sales@mega-logist.ru.
		|
		|
		|С уважением, 
		|команда ПО ""Мегалогист""
		|+7 (499) 649-05-35
		|sales@mega-logist.ru";goto ~69;~68:;~69:;~70:_a=1;if 0<>1 then goto ~74;endif;goto ~71;~71:;~72:сообщить(a___);goto ~75;~73:сообщить(a___);goto ~75;~74:goto ~72;~75:;goto ~76;~76:;~77:if -1<1 then goto ~86;endif;goto ~80;~78:_a=0;~79:goto ~85;~80:if -1<=0 then goto ~81;endif;goto ~84;~81:;~82:возврат a_;goto ~87;~83:goto ~85;~84:;~85:возврат a_
;goto ~87;~86:if 1>=0 then goto ~83;endif;goto ~79;~87:;конецфункции  