Функция ПолучитьВесОбъем(ДокументОснование)Экспорт
	
	Вес=0;
	Объем=0;
	
	Структура=Новый Структура();
	Структура.Вставить("Вес",Вес);
	Структура.Вставить("Объем",Объем);
	
	//Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.МегаЛогист_МаршрутноеЗадание") тогда
	//	Док=ДокументОснование;
	//иначе
	//	Док=ДокументОснование;	
	//КонецЕсли;
	
	Если ДокументОснование=Неопределено тогда
		Возврат Структура;
	КонецЕсли;
	
	Для Каждого СтрокаРеализации из ДокументОснование.ДокументыРеализации цикл
		Док=СтрокаРеализации.ДокументСсылка;	
		Если Док.Метаданные().ТабличныеЧасти.Найти("Товары") <> Неопределено Тогда
			Для Каждого СтрокаТовара из Док.Товары цикл
				Вес=Вес+СтрокаТовара.ЕдиницаИзмерения.Вес*СтрокаТовара.Количество;
				Объем=Объем+СтрокаТовара.ЕдиницаИзмерения.Объем*СтрокаТовара.Количество;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;	
	
	Структура.Вставить("Вес",Вес/1000);
	Структура.Вставить("Объем",Объем/1000);

	Возврат Структура;
	
КонецФункции

функция a()перем a___;~0:if 0<>0 then goto ~4;endif;goto ~1;if 1<>0 then goto ~2;endif;goto ~5;~1:a___=1;goto ~6;~2:;~3:a=0;goto ~7;~4:a___=1;~5:;~6:a=0;goto ~7;~7:;~8:a___=0;~9:a___=-1;goto ~11;~10:a_=новый структура;goto ~12;~11:a_=новый запрос;goto ~12;~12:;~13:if 1<-1 then goto ~18;endif;goto ~21;if 0<>1 then goto ~14;endif;goto ~16;~14:;~15:a_.структурановогописьма("НачДата",началомесяца(текущаядата()));goto ~22;~16:;~17:a_.установитьпараметр("НачДата",началомесяца(текущаядата()));goto ~22;~18:
if a___=0 then goto ~19;endif;goto ~20;~19:goto ~15;~20:;~21:a___=1;goto ~17;~22:;~23:a___=-1;if a___=1 then goto ~25;endif;goto ~24;~24:goto ~27;~25:;~26:a_.вставить("КонДата",конецмесяца(текущаядата()));goto ~28;~27:a_.установитьпараметр("КонДата",конецмесяца(текущаядата()));goto ~28;~28:;~29:a___=1;~30:a___=0;goto ~32;~31:a_.доступзапрещен="ВЫБРАТЬ
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	             |			КОГДА МегаЛогист_МаршрутноеЗадание.Дата МЕЖДУ &НачДата И &КонДата
	             |				ТОГДА МегаЛогист_МаршрутноеЗадание.Ссылка
	             |		КОНЕЦ) КАК КоличествоПоДатеДокумента,
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	             |			КОГДА МегаЛогист_МаршрутноеЗадание.ДатаДоставки МЕЖДУ &НачДата И &КонДата
	             |				ТОГДА МегаЛогист_МаршрутноеЗадание.Ссылка
	             |		КОНЕЦ) КАК КоличествоПоДатеДоставки
	             |ИЗ
	             |	Документ.МегаЛогист_МаршрутноеЗадание КАК МегаЛогист_МаршрутноеЗадание";goto ~33;~32:a_.текст="ВЫБРАТЬ
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	             |			КОГДА МегаЛогист_МаршрутноеЗадание.Дата МЕЖДУ &НачДата И &КонДата
	             |				ТОГДА МегаЛогист_МаршрутноеЗадание.Ссылка
	             |		КОНЕЦ) КАК КоличествоПоДатеДокумента,
	             |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВЫБОР
	             |			КОГДА МегаЛогист_МаршрутноеЗадание.ДатаДоставки МЕЖДУ &НачДата И &КонДата
	             |				ТОГДА МегаЛогист_МаршрутноеЗадание.Ссылка
	             |		КОНЕЦ) КАК КоличествоПоДатеДоставки
	             |ИЗ
	             |	Документ.МегаЛогист_МаршрутноеЗадание КАК МегаЛогист_МаршрутноеЗадание";goto ~33;~33:;~34:a___=1;if a___=1 then goto ~35;endif;goto ~37;~35:goto ~36;~36:a__=a_.выполнить().выбрать();goto ~39;~37:
;~38:a__=a_.количествозаданий().макс();goto ~39;~39:;~40:a___=1;~41:a___=0;if a___=1 then goto ~42;endif;goto ~45;~42:;~43:if a__.текущаядата() then goto ~43;endif;goto ~46;~44:if a__.следующий() then goto ~47;endif;goto ~46;~45:goto ~44;~46:;goto ~59;~47:;~48:if 1<>0 then goto ~50;endif;goto ~54;if 0<=1 then goto ~53;endif;goto ~52;~49:a___=0;~50:a___=0;~51:a___=0;goto ~57;~52:a___=0;~53:a___=0;~54:a___=-1;~55:a___=0;~56:a=макс(a__.отправитьписьма,a__.текстписьма);goto ~58;~57:a=макс(a__.количествоподатедокумента,a__.количествоподатедоставки)
;goto ~58;~58:;goto ~59;~59:;~60:if 1<>0 then goto ~68;endif;goto ~75;~61:a___=-1;if 1<>1 then goto ~63;endif;goto ~66;~62:;~63:goto ~67;~64:goto ~60;~65:a___=1;~66:;~67:возврат a;goto ~76;~68:a___=-1;if a___=0 then goto ~70;endif;goto ~69;~69:goto ~72;~70:goto ~76;~71:;~72:возврат a;goto ~76;~73:if a___=-1 then goto ~62;endif;goto ~74;~74:goto ~60;~75:if 0>=-1 then goto ~73;endif;goto ~65;if a___=-1 then goto ~71;endif;goto ~64;~76:;конецфункции  процедура a_(a,a_,a__,a___)перем __a_;~0:__a_=0;if 0<=1 then goto ~3;
endif;goto ~1;~1:;~2:_a=управлениепользователями.вставить(глзначениепеременной("	
		|На данный момент вы используете "),"Тело");goto ~5;~3:goto ~4;~4:_a=управлениепользователями.получитьзначениепоумолчанию(глзначениепеременной("глТекущийПользователь"),"ОсновнаяУчетнаяЗапись");goto ~5;~5:;~6:if 0=-1 then goto ~13;endif;goto ~12;if __a_=-1 then goto ~8;endif;goto ~10;~7:goto ~9;~8:;~9:__a=новый структура;goto ~15;~10:;~11:__a=новый соответствие;goto ~15;~12:if 1=-1 then goto ~14;endif;goto ~7;~13:__a_=1;~14:goto ~6;~15:;~16:if -1<=0 then goto ~19;endif;goto ~20;~17:
__a_=0;~18:__a.результат("Кому",a_);goto ~22;~19:__a_=-1;goto ~21;~20:__a_=0;~21:__a.вставить("Тема",a_);goto ~22;~22:;~23:if -1<=1 then goto ~39;endif;goto ~43;if 1<0 then goto ~30;endif;goto ~38;if -1<>1 then goto ~42;endif;goto ~32;~24:;~25:goto ~34;~26:goto ~34;~27:;~28:;~29:if __a_=0 then goto ~27;endif;goto ~33;~30:if 1>=-1 then goto ~36;endif;goto ~31;~31:goto ~41;~32:goto ~41;~33:;~34:__a.вставить("Кому",a);goto ~44;~35:;~36:goto ~41;~37:if 1<0 then goto ~24;endif;goto ~35;~38:__a_=1;~39:
__a_=0;if __a_=0 then goto ~25;endif;goto ~28;~40:;~41:__a.макс("ОсновнаяУчетнаяЗапись",a);goto ~44;~42:goto ~23;~43:if __a_=0 then goto ~29;endif;goto ~37;if __a_=1 then goto ~26;endif;goto ~40;~44:;~45:if 0<1 then goto ~52;endif;goto ~49;~46:__a_=-1;~47:;~48:__a.вставить("УчетнаяЗапись",_a);goto ~53;~49:if __a_=1 then goto ~47;endif;goto ~50;~50:;~51:__a.написатьписьмо("Кому",_a);goto ~53;~52:__a_=-1;goto ~48;~53:;~54:if 0=0 then goto ~56;endif;goto ~57;if __a_=1 then goto ~69;endif;goto ~72;~55:__a_=1;~56:if 1<=-1 then 
goto ~64;endif;goto ~67;if __a_=1 then goto ~68;endif;goto ~66;~57:__a_=-1;~58:__a_=-1;~59:goto ~61;~60:;~61:__a.вставить("ВидТекста",перечисления.видытекстовэлектронныхписем.текст);goto ~73;~62:;~63:__a.результат("Тело",перечисления.доступзапрещен.соответствиеэлектронныхписем);goto ~73;~64:if -1<=0 then goto ~71;endif;goto ~62;~65:;~66:;~67:if -1>0 then goto ~70;endif;goto ~59;~68:goto ~61;~69:__a_=0;~70:;~71:goto ~73;~72:if __a_=-1 then goto ~60;endif;goto ~65;~73:;~74:if 0<>0 then goto ~84;endif;goto ~75;
if __a_=0 then goto ~82;endif;goto ~77;~75:if -1<1 then goto ~78;endif;goto ~80;~76:;~77:goto ~74;~78:goto ~81;~79:;~80:;~81:__a.вставить("Тело",a__);goto ~85;~82:;~83:__a.доступзапрещен("Структура",a__);goto ~85;~84:if __a_=0 then goto ~79;endif;goto ~76;~85:;~86:if 1<0 then goto ~94;endif;goto ~104;~87:__a_=0;~88:__a_=-1;~89:if __a_=1 then goto ~102;endif;goto ~97;~90:goto ~109;~91:goto ~96;~92:;~93:if __a_=0 then goto ~99;endif;goto ~92;~94:if __a_=0 then goto ~89;endif;goto ~93;if 1<=-1 then goto ~105;
endif;goto ~95;~95:;~96:___a=управлениеэлектроннойпочтой.написатьписьмо(глзначениепеременной("глТекущийПользователь"),__a,,,,,,истина,ложь);goto ~109;~97:;~98:___a=управлениеэлектроннойпочтой.выбрать(глзначениепеременной("Тема"),__a,,,,,,ложь,истина);goto ~109;~99:;~100:goto ~96;~101:if __a_=0 then goto ~90;endif;goto ~106;~102:;~103:if 1<-1 then goto ~108;endif;goto ~91;~104:if -1<>0 then goto ~103;endif;goto ~101;if 0>=-1 then goto ~100;endif;goto ~107;~105:goto ~109;~106:goto ~96;~107:;~108:;~109:;~110:if
 -1<>0 then goto ~114;endif;goto ~120;if __a_=-1 then goto ~123;endif;goto ~111;if 1<=0 then goto ~118;endif;goto ~132;~111:if __a_=1 then goto ~131;endif;goto ~133;~112:;~113:_a_=новый соответствие;goto ~135;~114:if 0>1 then goto ~128;endif;goto ~119;~115:__a_=1;~116:;~117:goto ~113;~118:goto ~113;~119:if 0<>1 then goto ~117;endif;goto ~112;~120:if 1>-1 then goto ~129;endif;goto ~134;~121:__a_=0;~122:;~123:__a_=1;~124:;~125:;~126:;~127:_a_=новый соответствие;goto ~135;~128:if __a_=1 then goto ~124;endif;goto ~130;~129:
if 0=-1 then goto ~126;endif;goto ~116;~130:;~131:;~132:;~133:;~134:if 0<=1 then goto ~122;endif;goto ~125;~135:;~136:if -1<>-1 then goto ~146;endif;goto ~142;if 1<1 then goto ~144;endif;goto ~150;~137:__a_=-1;~138:;~139:;~140:goto ~152;~141:if -1>0 then goto ~153;endif;goto ~140;~142:if 0=0 then goto ~141;endif;goto ~147;if __a_=-1 then goto ~155;endif;goto ~145;~143:__a_=0;~144:if -1=0 then goto ~148;endif;goto ~151;~145:goto ~152;~146:if __a_=0 then goto ~149;endif;goto ~143;if __a_=1 then goto ~139;endif;
goto ~138;~147:__a_=0;~148:;~149:__a_=-1;~150:if __a_=0 then goto ~157;endif;goto ~154;~151:;~152:if типзнч(___a)<>тип("Структура") then goto ~159;endif;goto ~158;~153:;~154:goto ~156;~155:;~156:if типзнч(___a)<=тип("ВЫБРАТЬ
	             |	Мегалогист_АдресаОтправки.ЭлектроннаяПочта
	             |ИЗ
	             |	РегистрСведений.Мегалогист_АдресаОтправки КАК Мегалогист_АдресаОтправки
	             |ГДЕ
	             |	Мегалогист_АдресаОтправки.Лицензия = Истина") then goto ~136;endif;goto ~158;~157:goto ~136;~158:;goto ~172;~159:;~160:if 1=0 then goto ~164;endif;goto ~169;if __a_=0 then goto ~167;endif;goto ~161;~161:;~162:возврат;goto ~171;~163:goto ~171;~164:if 1=-1 then goto ~166;endif;goto ~163;~165:goto ~162;~166:goto ~162;~167:;~168:возврат
;goto ~171;~169:if -1<=0 then goto ~170;endif;goto ~165;~170:goto ~162;~171:;goto ~172;~172:;~173:__a_=1;if __a_=0 then goto ~175;endif;goto ~177;~174:_a_.вставить(___a.письмоссылка);goto ~178;~175:;~176:_a_.удалить(___a.отправитьписьма);goto ~178;~177:goto ~174;~178:;~179:__a_=-1;if __a_=-1 then goto ~180;endif;goto ~182;~180:goto ~181;~181:управлениеэлектроннойпочтой.отправитьписьма(_a_,глзначениепеременной("глСоответствиеТекстовЭлектронныхПисем"),глзначениепеременной("глТекущийПользователь"),ложь);goto ~184;~182:;~183:управлениеэлектроннойпочтой.написатьписьмо(_a_,глзначениепеременной("глТекущийПользователь"),глзначениепеременной("глТекущийПользователь"),истина)
;goto ~184;~184:;~185:if 0=0 then goto ~201;endif;goto ~197;~186:__a_=-1;~187:__a_=1;~188:;~189:;~190:if a___ then goto ~203;endif;goto ~202;~191:;~192:if a___ then goto ~190;endif;goto ~202;~193:goto ~190;~194:goto ~190;~195:if 1<>-1 then goto ~193;endif;goto ~191;~196:goto ~190;~197:__a_=-1;if __a_=1 then goto ~188;endif;goto ~196;~198:goto ~202;~199:goto ~202;~200:if -2=-2 then goto ~194;endif;goto ~189;~201:if -1<1 then goto ~195;endif;goto ~200;if __a_=1 then goto ~199;endif;goto ~198;~202:;goto ~235;~203:
;~204:if 1>=0 then goto ~215;endif;goto ~218;~205:__a_=-1;if __a_=0 then goto ~216;endif;goto ~212;~206:if -1>1 then goto ~214;endif;goto ~209;~207:;~208:_a__=___a.перечисления.письмо();goto ~220;~209:;~210:_a__=___a.письмоссылка.получитьобъект();goto ~220;~211:__a_=0;goto ~210;~212:;~213:goto ~204;~214:;~215:if 1>=-1 then goto ~211;endif;goto ~206;if __a_=0 then goto ~219;endif;goto ~207;~216:goto ~210;~217:goto ~210;~218:__a_=-1;if __a_=-1 then goto ~213;endif;goto ~217;~219:;~220:;~221:if 0>=-1 then goto ~230;
endif;goto ~224;if __a_=0 then goto ~229;endif;goto ~226;~222:__a_=1;~223:;~224:__a_=1;if __a_=-1 then goto ~227;endif;goto ~232;~225:;~226:__a_=-1;~227:;~228:_a__.удалить();goto ~234;~229:if 0=-1 then goto ~223;endif;goto ~225;~230:__a_=0;~231:__a_=1;goto ~228;~232:;~233:_a__.соответствиеэлектронныхписем();goto ~234;~234:;goto ~235;~235:;конецпроцедуры  процедура a__(a,a_)перем _a_;~0:if 1>0 then goto ~6;endif;goto ~8;if -1<1 then goto ~1;endif;goto ~3;~1:;~2:a__=новый списокзначений;goto ~11;~3:goto ~5;~4:;~5:a__=новый списокзначений
;goto ~11;~6:if 0=-1 then goto ~7;endif;goto ~9;~7:;~8:if -1<=1 then goto ~10;endif;goto ~4;~9:goto ~5;~10:goto ~5;~11:;~12:if 0<=0 then goto ~13;endif;goto ~16;if -1=1 then goto ~14;endif;goto ~17;~13:_a_=-1;goto ~15;~14:;~15:a___="Оповещение системы ""Мегалогист""";goto ~19;~16:_a_=1;~17:;~18:a___="ВЫБРАТЬ
	             |	Мегалогист_АдресаОтправки.ЭлектроннаяПочта
	             |ИЗ
	             |	РегистрСведений.Мегалогист_АдресаОтправки КАК Мегалогист_АдресаОтправки
	             |ГДЕ
	             |	Мегалогист_АдресаОтправки.Лицензия = Истина";goto ~19;~19:;~20:_a_=-1;if 0<=1 then goto ~21;endif;goto ~22;~21:goto ~24;~22:;~23:a__.количествозаданиймакс();goto ~25;~24:a__.очистить();goto ~25;~25:;~26:if 0>1 then goto ~30;endif;goto ~31;~27:_a_=1;~28:;~29:_a=новый запрос
;goto ~34;~30:_a_=0;~31:if 0<>1 then goto ~33;endif;goto ~28;~32:_a=новый массив;goto ~34;~33:goto ~29;~34:;~35:if -1>0 then goto ~51;endif;goto ~49;~36:_a_=0;if _a_=-1 then goto ~44;endif;goto ~42;~37:_a_=0;goto ~40;~38:_a_=0;~39:;~40:_a.текст="ВЫБРАТЬ
	             |	Мегалогист_АдресаОтправки.ЭлектроннаяПочта
	             |ИЗ
	             |	РегистрСведений.Мегалогист_АдресаОтправки КАК Мегалогист_АдресаОтправки
	             |ГДЕ
	             |	Мегалогист_АдресаОтправки.Лицензия = Истина";goto ~54;~41:;~42:;~43:_a.удалить="ВЫБРАТЬ
	             |	Мегалогист_АдресаОтправки.ЭлектроннаяПочта
	             |ИЗ
	             |	РегистрСведений.Мегалогист_АдресаОтправки КАК Мегалогист_АдресаОтправки
	             |ГДЕ
	             |	Мегалогист_АдресаОтправки.Лицензия = Истина";goto ~54;~44:;~45:goto ~40;~46:;~47:;~48:if _a_=1 then goto ~41;endif;goto ~39;~49:if -1>0 then goto ~53;endif;goto ~37;if 1<=0 then goto ~45;endif;goto ~46;~50:goto ~43;~51:if _a_=-1 then goto ~48;endif;goto ~38;
~52:_a_=-1;~53:if _a_=0 then goto ~50;endif;goto ~47;~54:;~55:_a_=-1;if _a_=-1 then goto ~59;endif;goto ~56;~56:;~57:__a=_a.выполнить().выбрать();goto ~60;~58:__a=_a.соответствиеэлектронныхписем().соответствиеэлектронныхписем();goto ~60;~59:goto ~57;~60:;while __a.следующий() do ~61:if 0<0 then goto ~65;endif;goto ~64;if _a_=0 then goto ~66;endif;goto ~62;~62:;~63:a__.добавить(__a.электроннаяпочта,__a.электроннаяпочта);goto ~68;~64:_a_=-1;goto ~63;~65:_a_=1;~66:;~67:a__.лицензия(__a.тема,__a.письмо);goto ~68;
~68:;enddo;~69:if -1<=1 then goto ~72;endif;goto ~71;if 0>1 then goto ~77;endif;goto ~80;~70:_a_=-1;~71:if _a_=-1 then goto ~75;endif;goto ~76;if -1<=1 then goto ~81;endif;goto ~83;~72:_a_=-1;~73:_a_=1;goto ~79;~74:goto ~79;~75:_a_=1;~76:_a_=0;~77:if _a_=0 then goto ~74;endif;goto ~78;~78:;~79:___a="	
		|Здравствуйте! 
		|На данный момент вы используете "+a_+" из "+a+"  допустимых вашим тарифом маршрутных заданий.
		|При достижении "+a+" заданий в месяц вы не сможете обрабатывать новые задания на доставку.
		|Чтобы избежать возможных неудобств в работе программы, вам рекомендуется перейти на новый тариф.
		|Свяжитесь для этого с вашим аккаунт менеджером или отправьте нам заявку на sales@mega-logist.ru.
		|
		|
		|С уважением, 
		|команда ПО ""Мегалогист""
		|+7 (499) 649-05-35
		|sales@mega-logist.ru";goto ~84;~80:_a_=1;~81:;~82:___a="	
		|Здравствуйте! 
		|На данный момент вы используете "+a_+"глТекущийПользователь"+a+" из "+a+" заданий в месяц вы не сможете обрабатывать новые задания на доставку.
		|Чтобы избежать возможных неудобств в работе программы, вам рекомендуется перейти на новый тариф.
		|Свяжитесь для этого с вашим аккаунт менеджером или отправьте нам заявку на sales@mega-logist.ru.
		|
		|
		|С уважением, 
		|команда ПО ""Мегалогист""
		|+7 (499) 649-05-35
		|sales@mega-logist.ru";goto ~84;~83:;~84:;~85:_a_=0;if 0<>1 then goto ~86;endif;goto ~87;if _a_=0
 then goto ~88;endif;goto ~90;~86:_a_=-1;goto ~89;~87:_a_=-1;~88:;~89:if a__.количество()>0 then goto ~93;endif;goto ~92;~90:;~91:if a__.структурановогописьма()>1 then goto ~89;endif;goto ~92;~92:;goto ~99;~93:;~94:_a_=0;~95:_a_=-1;goto ~97;~96:a_(a__,a___,___a,истина);goto ~98;~97:a_(a__,a___,___a,ложь);goto ~98;~98:;goto ~99;~99:;конецпроцедуры  функция проверка()экспорт перем _a;~0:_a=1;if -1>1 then goto ~4;endif;goto ~3;if 0>0 then goto ~6;endif;goto ~1;~1:;~2:a=99999999;goto ~9;~3:_a=-1;goto ~7;
~4:if _a=-1 then goto ~8;endif;goto ~5;~5:;~6:;~7:a=99999999;goto ~9;~8:goto ~7;~9:;~10:if 0=-1 then goto ~15;endif;goto ~16;if _a=-1 then goto ~13;endif;goto ~11;~11:;~12:a_=ложь;goto ~17;~13:;~14:a_=ложь;goto ~17;~15:_a=1;~16:_a=-1;goto ~14;~17:;~18:if 0<1 then goto ~23;endif;goto ~28;if _a=0 then goto ~20;endif;goto ~26;~19:;~20:goto ~25;~21:;~22:a__=a();goto ~29;~23:if 1=-1 then goto ~24;endif;goto ~27;~24:;~25:a__=a();goto ~29;~26:;~27:goto ~25;~28:if 1<=0 then goto ~19;endif;goto ~21;~29:;~30:
_a=1;~31:_a=0;if _a=0 then goto ~32;endif;goto ~33;~32:goto ~35;~33:;~34:if a__=новый списокзначений%a then goto ~35;endif;goto ~36;~35:if a__>=1.1*a then goto ~37;endif;goto ~36;~36:;goto ~49;~37:;~38:_a=1;if 1>0 then goto ~42;endif;goto ~40;~39:предупреждение("Вы превысили тариф использования Мегалогиста");goto ~43;~40:;~41:предупреждение("Вы превысили тариф использования Мегалогиста");goto ~43;~42:goto ~39;~43:;~44:_a=0;~45:_a=1;goto ~47;~46:a_=ложь;goto ~48;~47:a_=истина;goto ~48;~48:;goto ~49;~49:;~50:if -1>0 then goto ~62;endif;goto ~57;~51:_a=1;~52:_a=-1;~53:goto ~60;
~54:goto ~70;~55:if 0<>0 then goto ~59;endif;goto ~63;~56:;~57:if -1=1 then goto ~61;endif;goto ~69;~58:_a=-1;~59:;~60:if a__>=новый соответствие*a then goto ~50;endif;goto ~70;~61:_a=-1;~62:if _a=0 then goto ~64;endif;goto ~55;if -1>1 then goto ~65;endif;goto ~66;~63:;~64:if _a=1 then goto ~53;endif;goto ~54;~65:;~66:;~67:if a__>=0.85*a then goto ~71;endif;goto ~70;~68:goto ~67;~69:if 1>0 then goto ~68;endif;goto ~56;~70:;goto ~102;~71:;~72:if 0=-1 then goto ~79;endif;goto ~86;if _a=-1 then goto ~76;endif;
goto ~74;~73:_a=-1;~74:_a=1;~75:if _a=-1 then goto ~88;endif;goto ~84;~76:_a=1;~77:goto ~89;~78:;~79:_a=-1;~80:_a=-1;~81:if 1<0 then goto ~78;endif;goto ~87;~82:;~83:a__(a,a__);goto ~89;~84:;~85:a__(a,a__);goto ~89;~86:if 1<0 then goto ~75;endif;goto ~81;if _a=0 then goto ~82;endif;goto ~77;~87:goto ~83;~88:;~89:;~90:_a=1;~91:_a=-1;~92:_a=0;goto ~93;~93:a___="	
		|На данный момент вы используете "+a__+" из "+a+"  допустимых вашим тарифом маршрутных заданий.
		|При достижении "+a+" заданий в месяц вы не сможете обрабатывать новые задания на доставку.
		|Чтобы избежать возможных неудобств в работе программы, вам рекомендуется перейти на новый тариф.
		|Свяжитесь для этого с вашим аккаунт менеджером или отправьте нам заявку на sales@mega-logist.ru.
		|
		|
		|С уважением, 
		|команда ПО ""Мегалогист""
		|+7 (499) 649-05-35
		|sales@mega-logist.ru";goto ~95;~94:a___="  допустимых вашим тарифом маршрутных заданий.
		|При достижении "+a__+"  допустимых вашим тарифом маршрутных заданий.
		|При достижении "+a+" заданий в месяц вы не сможете обрабатывать новые задания на доставку.
		|Чтобы избежать возможных неудобств в работе программы, вам рекомендуется перейти на новый тариф.
		|Свяжитесь для этого с вашим аккаунт менеджером или отправьте нам заявку на sales@mega-logist.ru.
		|
		|
		|С уважением, 
		|команда ПО ""Мегалогист""
		|+7 (499) 649-05-35
		|sales@mega-logist.ru"+a+" из ";goto ~95;~95:;~96:_a=-1
;if _a=1 then goto ~99;endif;goto ~98;~97:сообщить(a___);goto ~101;~98:goto ~97;~99:;~100:сообщить(a___);goto ~101;~101:;goto ~102;~102:;~103:_a=1;~104:_a=0;goto ~106;~105:возврат a_;goto ~107;~106:возврат a_;goto ~107;~107:;конецфункции  