Процедура ВыполнитьПроверку() экспорт
	
	Если НЕ ЗначениеЗаполнено(ДатаН) тогда
		ДатаН = ДобавитьМесяц(ТекущаяДата(),-1);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ДатаК) тогда
		ДатаК = КонецДня(ТекущаяДата())+1;
	КонецЕсли;
	
	
Запрос = Новый Запрос;
Запрос.Текст = 
"ВЫБРАТЬ
|	РеализацияТоваровУслуг.Ссылка,
|	РеализацияТоваровУслуг.express_delivery_request_id,
|	РеализацияТоваровУслуг.ЭД_init,
|	РеализацияТоваровУслуг.ЭД_СуммаБесплатнойЭД,
|	РеализацияТоваровУслуг.ЭД_СтоимостьУслугиЭДрубли
|ПОМЕСТИТЬ эд
|ИЗ
|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
|ГДЕ
|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаН И &ДатаК
|	И РеализацияТоваровУслуг.ТипДоставки = &ТипДоставки
|	И РеализацияТоваровУслуг.Источник = &Источник
|	И РеализацияТоваровУслуг.ЭД_ВидОплаты = &ЭД_ВидОплаты
|	И РеализацияТоваровУслуг.ЭД_СтоимостьУслугиЭДрубли > 0
|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
|	//И РеализацияТоваровУслуг.express_delivery_request_id = ""ED138710""
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	эд.Ссылка,
|	эд.express_delivery_request_id,
|	эд.ЭД_init,
|	эд.ЭД_СуммаБесплатнойЭД,
|	эд.ЭД_СтоимостьУслугиЭДрубли,
|	РеализацияТоваровУслугТовары.НомерСтроки,
|	РеализацияТоваровУслугТовары.Количество,
|	РеализацияТоваровУслугТовары.Цена,
|	РеализацияТоваровУслугТовары.ЦенаСоСкидкой,
|	РеализацияТоваровУслугТовары.ЭД_Цена_Номенклатура,
|	РеализацияТоваровУслугТовары.ЭД_Сумма_Услуга,
|	РеализацияТоваровУслугТовары.Сумма,
|	РеализацияТоваровУслугТовары.ЦенаСоСкидкой * РеализацияТоваровУслугТовары.Количество КАК СуммаРасчетная
|ПОМЕСТИТЬ тч
|ИЗ
|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
|		ЛЕВОЕ СОЕДИНЕНИЕ эд КАК эд
|		ПО РеализацияТоваровУслугТовары.Ссылка = эд.Ссылка
|ГДЕ
|	РеализацияТоваровУслугТовары.Ссылка В
|			(ВЫБРАТЬ
|				эд.Ссылка
|			ИЗ
|				эд)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	тч.express_delivery_request_id,
|	МАКСИМУМ(тч.ЭД_СуммаБесплатнойЭД) КАК ЭД_СуммаБесплатнойЭД,
|	МАКСИМУМ(тч.ЭД_СтоимостьУслугиЭДрубли) КАК ЭД_СтоимостьУслугиЭДрубли,
|	СУММА(тч.Сумма) КАК Сумма,
|	СУММА(тч.СуммаРасчетная) КАК СуммаРасчетная,
|	СУММА(тч.ЭД_Сумма_Услуга) КАК ЭД_Сумма_Услуга,
|	ВЫБОР
|		КОГДА СУММА(тч.СуммаРасчетная) - СУММА(тч.Сумма) = СУММА(тч.ЭД_Сумма_Услуга) и СУММА(тч.ЭД_Сумма_Услуга) = МАКСИМУМ(тч.ЭД_СтоимостьУслугиЭДрубли) ТОГДА ИСТИНА
|		ИНАЧЕ ЛОЖЬ
|	КОНЕЦ КАК НеХватаетУслуги
|ИЗ
|	тч КАК тч
|
|СГРУППИРОВАТЬ ПО
|	тч.express_delivery_request_id
|
|ИМЕЮЩИЕ
|	НЕ СУММА(тч.СуммаРасчетная) = СУММА(тч.Сумма)
|	И СУММА(тч.Сумма) < МАКСИМУМ(тч.ЭД_СуммаБесплатнойЭД)
|	И 
|	ВЫБОР
|		КОГДА СУММА(тч.СуммаРасчетная) - СУММА(тч.Сумма) = СУММА(тч.ЭД_Сумма_Услуга) и СУММА(тч.ЭД_Сумма_Услуга) = МАКСИМУМ(тч.ЭД_СтоимостьУслугиЭДрубли) ТОГДА ИСТИНА
|		ИНАЧЕ ЛОЖЬ
|	КОНЕЦ = Истина";

Запрос.УстановитьПараметр("Источник", Перечисления.ИсточникиРеализаций.Сайт);
Запрос.УстановитьПараметр("ТипДоставки", Справочники.ТипыДоставки.ЭкспрессДоставка);
Запрос.УстановитьПараметр("ЭД_ВидОплаты", Перечисления.ВидыОплатыЭД.ВЦенеТовара);
Запрос.УстановитьПараметр("ДатаК", ДатаК);
Запрос.УстановитьПараметр("ДатаН", ДатаН);
Результат = Запрос.Выполнить().Выгрузить();	

Сообщить("за период " + СокрЛП(ПредставлениеПериода(ДатаН,ДатаК)) + " найдено проблемных ЭД : " + СокрЛП(Результат.Количество()));

сч = 0;
счсч = 0;
Для каждого ЭД из Результат цикл
	сч = сч + 1;
	Ответ = Истина;
	Ответ = SMSоповещение.РассчитатьУслугуЭД(ЭД.express_delivery_request_id, Ложь);
	Сообщить(СокрлП(сч) + ". " + СокрлП(ЭД.express_delivery_request_id) + " = " + СокрЛП(Ответ) );
	Если НЕ Ответ тогда
		счсч = счсч + 1;	
	КонецЕсли;
КонецЦикла;
Сообщить(" обработано = "+ СокрлП(сч));
Сообщить(" из них отказов = "+ СокрлП(счсч));
	
КонецПроцедуры

Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	ВыполнитьПроверку();
	
КонецПроцедуры	