
Функция ПолучитьЗначениеИК( пПутьКИК ) Экспорт
	
	ЗначениеИК = Неопределено;
	
	НайденныйЭлемент = Справочники.ИменованныеКонстантыПроцессов.НайтиПоНаименованию(пПутьКИК);	
	Если ЗначениеЗаполнено(НайденныйЭлемент) Тогда
		ЗначениеИК = НайденныйЭлемент.Значение;
	Иначе
		ВызватьИсключение "Не найдена именованная константа по имени """+пПутьКИК+"""!";
	КонецЕсли;
	
	Возврат ЗначениеИК;
	
КонецФункции	//ИК

Функция ПолучитьЗначениеИКИзАлгоритма( ТекущийАлгоритм, пПутьКИК ) Экспорт
	
	ЗначениеИК = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АлгоритмыПроцессовЛокальныеИменованныеКонстанты.Значение
		|ИЗ
		|	Справочник.АлгоритмыПроцессов.ЛокальныеИменованныеКонстанты КАК АлгоритмыПроцессовЛокальныеИменованныеКонстанты
		|ГДЕ
		|	АлгоритмыПроцессовЛокальныеИменованныеКонстанты.Ссылка = &ТекущийАлгоритм
		|	И АлгоритмыПроцессовЛокальныеИменованныеКонстанты.Имя = &пПутьКИК";
	
	Запрос.УстановитьПараметр("пПутьКИК", пПутьКИК);
	Запрос.УстановитьПараметр("ТекущийАлгоритм", ТекущийАлгоритм);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗначениеИК = Выборка.Значение;
	КонецЕсли;
	
	Если ЗначениеИК = Неопределено Тогда
		 ВызватьИсключение "Не найдена локальная именованная константа по имени """+пПутьКИК+""" для алгоритма """+ТекущийАлгоритм+"""!";
	КонецЕсли;
	
	Возврат ЗначениеИК;
	
КонецФункции	//ИК
