Перем мМенеджерОбъекта;

Процедура ПриКопировании(ОбъектКопирования)
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПриКопировании";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	СозданВ77 = Ложь;
	СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяНовый;//VMI-17
КонецПроцедуры

#Область Печать


// Функция формирует табличный документ с печатной формой универсального корректировочного документа
//
// Возвращаемое значение:
//  Табличный документ - печатная форма универсального корректировочного документа
//
Функция ПечатьУниверсальногоКорректировочногоДокумента() Экспорт
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПечатьУниверсальногоКорректировочногоДокумента";
	лЗамена = АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено; 
		Выполнить(лЗамена); 
		Возврат АлгоритмыЗначениеВозврата; 
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////"
	
	ВидОперацииУКД = Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение;
	
	Если ВидОперацииУКД <> Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение Тогда
		ТекстСообщения = НСтр("ru = 'Применение формы универсального корректировочного документа возможно только для документов 
				|с видом операции ""Корректировка по согласованию сторон""!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеДляПечати = Документы.ВозвратТоваровОтПокупателя.ПодготовитьДанныеДляПечатиУниверсальногоКорректировочногоДокумента(Ссылка);
	
	Возврат  Документы.ВозвратТоваровОтПокупателя.ПечатьУниверсальногоКорректировочногоДокумента(ДанныеДляПечати);

КонецФункции

#Если Клиент Тогда
	
// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
//  Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//  ИмяМакета - строка, название макета.
//
Процедура Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_Печать";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если ЭтоНовый() Тогда
		Предупреждение(НСтр("ru = 'Документ можно распечатать только после его записи'"));
		Возврат;
	ИначеЕсли Не УправлениеДопПравамиПользователей.РазрешитьПечатьНепроведенныхДокументов(Проведен) Тогда
		Предупреждение(НСтр("ru = Недостаточно полномочий для печати непроведенного документа!'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ РаботаСДиалогами.ПроверитьМодифицированность(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Получить экземпляр документа на печать
	Если ИмяМакета = "УниверсальныйКорректировочныйДокумент" Тогда
		ТабДокумент = ПечатьУниверсальногоКорректировочногоДокумента();
	//ИначеЕсли ИмяМакета = "СчетНаОплату" Тогда	
	//		ТабДокумент = ПечатьСчетаНаОплату();	
	КонецЕсли;
	
	УниверсальныеМеханизмы.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, ОбщегоНазначения.СформироватьЗаголовокДокумента(ЭтотОбъект), Ссылка);
	
КонецПроцедуры // Печать

Функция ПечатьСчетаНаОплату(Макет = Неопределено) Экспорт
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПечатьСчетаНаОплату";
	лЗамена = АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено; 
		Выполнить(лЗамена); 
		Возврат АлгоритмыЗначениеВозврата; 
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////"
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПечатьСчетаНаОплату";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////
	
	ПараметрыПечати = ПолучитьПараметрыПечатиСчетаЗаказа();
	
	ТабДокумент  = Новый ТабличныйДокумент;
	
	// Зададим параметры макета
	ТабДокумент.ПолеСверху              = 0;
	ТабДокумент.ПолеСлева               = 0;
	ТабДокумент.ПолеСнизу               = 0;
	ТабДокумент.ПолеСправа              = 0;
	ТабДокумент.АвтоМасштаб             = Истина;
	ТабДокумент.ОриентацияСтраницы      = ОриентацияСтраницы.Портрет;
	ТабДокумент.КоличествоЭкземпляров   = 1;
	ТабДокумент.ТолькоПросмотр          = Истина;
	
	ПечатьИзВнешнейОбработки = Макет <> Неопределено;
	Если НЕ ПечатьИзВнешнейОбработки Тогда
		Макет = ПолучитьОбщийМакет("СчетНаОплату");
	КонецЕсли;
	
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);

	Если ПараметрыПечати.Свойство("Основание") Тогда
		
		Если Контрагент <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ГоловнойКонтрагент") Тогда
			ДоговорИсточник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ГоловнойКонтрагент.ОсновнойДоговорКонтрагента");
		Иначе
			ДоговорИсточник = ДоговорКонтрагента;
		КонецЕсли;
		
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДоговорИсточник, "ДоговорНаОферту, Номер, Дата, ДатаДоговораОферты");
		
		Если ЗначениеЗаполнено(ДоговорИсточник) И РеквизитыДоговора.ДоговорНаОферту Тогда 
			ТекстОснования = "Оферта №"+РеквизитыДоговора.Номер+" от "+Формат(РеквизитыДоговора.ДатаДоговораОферты, "ДФ=dd.MM.yyyy")+"г.";
		Иначе
			ТекстОснования = "Договор купли продажи №"+РеквизитыДоговора.Номер+" от "+Формат(РеквизитыДоговора.Дата, "ДФ=dd.MM.yyyy")+"г.";
		КонецЕсли;
		
		ПараметрыПечати.Основание = ТекстОснования;
		
	КонецЕсли;
	
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакетаШапкатаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ОбластьМакетаШапкатаблицы);
	
	КоличествоСтрок = ПараметрыПечати.Позиции.Количество();
	
	// - Выводим строки таблицы
	ОбластьМакета  = Макет.ПолучитьОбласть("Строка");
	Для Каждого ПараметрыПозиции Из ПараметрыПечати.Позиции Цикл 

		ОбластьМакета.Параметры.Заполнить(ПараметрыПозиции);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// - Проверим возможность вывода табличного документа
		СтрокаСПодвалом = Новый Массив;
		СтрокаСПодвалом.Добавить(ОбластьМакета);
		Если НЕ ТабДокумент.ПроверитьВывод(СтрокаСПодвалом) Тогда
			
			Если КоличествоСтрок > 0 Тогда
				// - Вывод разделителя и заголовка таблицы на новой странице
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ОбластьМакетаШапкатаблицы);
			КонецЕсли;
			
		КонецЕсли;
				
	КонецЦикла;
	
	// Выводим итоги
	ОбластьМакета  = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);	
	
	Если ПараметрыПечати.УчитыватьНДС Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
		ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЕсли;
	
	// Вывести Сумму прописью
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
	ОбластьМакета.Параметры.Заполнить(ПараметрыПечати);
	ТабДокумент.Вывести(ОбластьМакета);
	
	//Голубев 20190325 вернулись к печати логотипов в печатных формах
	ОбластьМакетаРеклама = Макет.ПолучитьОбласть("Реклама");
	ТабДокумент.Вывести(ОбластьМакетаРеклама);
	
	Возврат ТабДокумент;
	
КонецФункции  // ПечатьСчетаНаОплату()  (Карпычев 31.01.18) 	

Функция ПолучитьПараметрыПечатиСчетаЗаказа() Экспорт
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПолучитьПараметрыПечатиСчетаЗаказа";
	лЗамена = АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено; 
		Выполнить(лЗамена); 
		Возврат АлгоритмыЗначениеВозврата; 
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////"
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПолучитьПараметрыПечатиСчетаЗаказа";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////
	
	ПараметрыПечати = Новый Структура;
	Позиции = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент",    ЭтотОбъект.Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателя.Номер,
	|	ВозвратТоваровОтПокупателя.Дата,
	|	ВозвратТоваровОтПокупателя.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВозвратТоваровОтПокупателя.ДоговорКонтрагента.Номер КАК ДоговорКонтрагентаНомер,
	|	ВозвратТоваровОтПокупателя.ДоговорКонтрагента.Дата КАК ДоговорКонтрагентаДата,
	|	ВозвратТоваровОтПокупателя.Организация,
	|	ВозвратТоваровОтПокупателя.Контрагент КАК Получатель,
	|	ВозвратТоваровОтПокупателя.Контрагент.Код КАК КодКлиента,
	|	ВозвратТоваровОтПокупателя.Организация КАК Руководители,
	|	ВозвратТоваровОтПокупателя.Организация КАК Поставщик,
	|	ВозвратТоваровОтПокупателя.СуммаДокумента,
	|	ВозвратТоваровОтПокупателя.ВалютаДокумента,
	|	ВозвратТоваровОтПокупателя.УчитыватьНДС КАК УчитыватьНДС,
	|	ВозвратТоваровОтПокупателя.Организация.УчитыватьНДС КАК УчитыватьНДС_,
	|	ВозвратТоваровОтПокупателя.СуммаВключаетНДС,
	|	ВЫБОР
	|		КОГДА ВозвратТоваровОтПокупателя.Контрагент.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоФизЛицо
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
	|ГДЕ
	|	ВозвратТоваровОтПокупателя.Ссылка = &ТекущийДокумент";
	
	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("УчитыватьНДС"   , Шапка.УчитыватьНДС);
	
	УниверсальныеМеханизмы.ОпределитьКурсыДокументаДляПечати(ЭтотОбъект, Запрос);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(ВложенныйЗапрос.Номенклатура.НаименованиеПолное КАК СТРОКА(1000)) КАК ТоварНаименование,
	|	ВложенныйЗапрос.Номенклатура.Наименование КАК ТоварНаименованиеКраткое,
	|	"""" КАК ТоварКод,
	|	ВложенныйЗапрос.Номенклатура.Артикул КАК ТоварАртикул,
	|	ВложенныйЗапрос.Номенклатура.Изготовитель.Наименование КАК ТоварПроизводительНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.Представление КАК БазоваяЕдиницаНаименование,
	|	ВложенныйЗапрос.ЕдиницаИзмерения.ЕдиницаПоКлассификатору.Код КАК БазоваяЕдиницаКодПоОКЕИ,
	|	ВложенныйЗапрос.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВложенныйЗапрос.ЕдиницаИзмеренияМест.Представление КАК ВидУпаковки,
	|	1 КАК КоличествоВОдномМесте,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.КоличествоМест > 0
	|			ТОГДА ВложенныйЗапрос.КоличествоМест * ВложенныйЗапрос.ЕдиницаИзмеренияМест.Вес
	|		ИНАЧЕ ВложенныйЗапрос.Количество * ВложенныйЗапрос.ЕдиницаИзмерения.Вес
	|	КОНЕЦ КАК МассаБрутто,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.Серия КАК Серия,
	|	ВложенныйЗапрос.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА НЕ ВложенныйЗапрос.ЦенаСоСкидкой = 0
	|			ТОГДА ВложенныйЗапрос.ЦенаСоСкидкой
	|		ИНАЧЕ ВложенныйЗапрос.Цена
	|	КОНЕЦ КАК Цена,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ПроцентСкидкиНаценки = 0
	|				И ВложенныйЗапрос.ПроцентАвтоматическихСкидок = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьСкидкиПоСтроке,
	|	ВложенныйЗапрос.Количество КАК Количество,
	|	ВложенныйЗапрос.КоличествоМест КАК КоличествоМест,
	|	ВложенныйЗапрос.Сумма КАК Сумма,
	|	ВложенныйЗапрос.СуммаНДС КАК СуммаНДС,
	|	ВложенныйЗапрос.НомерСтроки КАК НомерСтроки,
	|	ВложенныйЗапрос.Метка КАК Метка,
	|	ВложенныйЗапрос.ПроцентСкидкиНаценки + ВложенныйЗапрос.ПроцентАвтоматическихСкидок КАК Скидка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВозвратТоваровОтПокупателя.Номенклатура КАК Номенклатура,
	|		ВозвратТоваровОтПокупателя.Коэффициент КАК Коэффициент,
	|		ВозвратТоваровОтПокупателя.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ВозвратТоваровОтПокупателя.ЕдиницаИзмерения КАК ЕдиницаИзмеренияМест,
	|		ВозвратТоваровОтПокупателя.ЕдиницаИзмерения.Коэффициент КАК КоэффициентМест,
	|		NULL КАК Характеристика,
	|		NULL КАК Серия,
	|		ВЫБОР
	|			КОГДА &УчитыватьНДС
	|				ТОГДА ВозвратТоваровОтПокупателя.СтавкаНДС
	|			ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.БезНДС)
	|		КОНЕЦ КАК СтавкаНДС,
	|		ВозвратТоваровОтПокупателя.Цена * &Курс / &Кратность КАК Цена,
	|		ВозвратТоваровОтПокупателя.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|		0 КАК ПроцентАвтоматическихСкидок,
	|		СУММА(ВозвратТоваровОтПокупателя.Количество) КАК Количество,
	|		СУММА(ВозвратТоваровОтПокупателя.Количество) КАК КоличествоМест,
	|		СУММА(ВозвратТоваровОтПокупателя.Сумма * &Курс / &Кратность) КАК Сумма,
	|		СУММА(ВЫБОР
	|				КОГДА &УчитыватьНДС
	|					ТОГДА ВозвратТоваровОтПокупателя.СуммаНДС * &Курс / &Кратность
	|				ИНАЧЕ 0
	|			КОНЕЦ) КАК СуммаНДС,
	|		МИНИМУМ(ВозвратТоваровОтПокупателя.НомерСтроки) КАК НомерСтроки,
	|		0 КАК Метка,
	|		ВозвратТоваровОтПокупателя.Цена * &Курс / &Кратность КАК ЦенаСоСкидкой
	|	ИЗ
	|		Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателя
	|	ГДЕ
	|		ВозвратТоваровОтПокупателя.Ссылка = &ТекущийДокумент
	|		И ВозвратТоваровОтПокупателя.Количество > 0
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВозвратТоваровОтПокупателя.Номенклатура,
	|		ВозвратТоваровОтПокупателя.Коэффициент,
	|		ВозвратТоваровОтПокупателя.ЕдиницаИзмерения,
	|		ВозвратТоваровОтПокупателя.СтавкаНДС,
	|		ВозвратТоваровОтПокупателя.Цена,
	|		ВозвратТоваровОтПокупателя.ПроцентСкидкиНаценки,
	|		ВозвратТоваровОтПокупателя.ЕдиницаИзмерения.Коэффициент,
	|		ВозвратТоваровОтПокупателя.Цена,
	|		ВозвратТоваровОтПокупателя.ЕдиницаИзмерения) КАК ВложенныйЗапрос";
	
	// +++ Карпычев (02.03.18)
	СтрокаВыборкиПоляСодержания = ОбработкаТабличныхЧастей.ПолучитьЧастьЗапросаДляВыбораСодержания("ВозвратТоваровОтПокупателя");
	
	
	// --- Карпычев (02.03.18)
	
	ЗапросТовары = Запрос.Выполнить().Выгрузить();
		
	ПараметрыПечати.Вставить("УчитыватьНДС", Шапка.УчитыватьНДС);
	СведенияОПоставщике = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата);
	ПараметрыПечати.Вставить("ИНН", СведенияОПоставщике.ИНН);
	ПараметрыПечати.Вставить("КПП", СведенияОПоставщике.КПП);
	ПредставлениеПоставщикаДляПлатПоручения = "";
	Если ЗначениеЗаполнено(БанковскийСчет) Тогда
		Банк       = БанковскийСчет.Банк;//?(Не ЗначениеЗаполнено(БанковскийСчетОрганизации.БанкДляРасчетов), БанковскийСчетОрганизации.Банк, БанковскийСчетОрганизации.БанкДляРасчетов);
		НомерСчета = БанковскийСчет.НомерСчета;
	ИначеЕсли ЗначениеЗаполнено(Организация.ОсновнойБанковскийСчет) Тогда 
		Банк       = Организация.ОсновнойБанковскийСчет.Банк;
		НомерСчета = Организация.ОсновнойБанковскийСчет.НомерСчета;
	Иначе 	
		Банк       = СведенияОПоставщике.Банк;
		НомерСчета = СведенияОПоставщике.НомерСчета;
	КонецЕсли;	
	БИК        = Банк.Код;
	КоррСчет   = Банк.КоррСчет;
	ГородБанка = Банк.Город;
	
	ПараметрыПечати.Вставить("Покупатель", Шапка.Получатель);
	ПараметрыПечати.Вставить("Поставщик", Шапка.Поставщик);
	Попытка
		Дог="";
		Если НЕ ЗначениеЗаполнено(Шапка.Получатель.ГоловнойКонтрагент) Тогда 
			Если Шапка.ДоговорКонтрагента.ДоговорНаОферту Тогда 
				Дог="Оферта №"+Шапка.ДоговорКонтрагента.НомерЗаявкиОферты+" от "+Шапка.ДоговорКонтрагента.ДатаДоговораОферты;
			Иначе
				Дог="договор купли продажи №"+Шапка.ДоговорКонтрагента.Номер+" от "+Шапка.ДоговорКонтрагента.Дата;
			КонецЕсли;
		Иначе
			Догт=Шапка.Получатель.ГоловнойКонтрагент.ОсновнойДоговорКонтрагента;
			Если Догт.ДоговорНаОферту Тогда 
				Дог="Оферта №"+Догт.НомерЗаявкиОферты+" от "+Догт.ДатаДоговораОферты;
			Иначе
				Дог="договор купли продажи №"+Догт.Номер+" от "+Догт.Дата;
			КонецЕсли;
		КонецЕсли;	
	Исключение
		Дог=Строка(Шапка.ДоговорКонтрагента) + ?(ПустаяСтрока(Шапка.ДоговорКонтрагентаНомер), "", " " + Шапка.ДоговорКонтрагентаНомер + " от " + Формат(Шапка.ДоговорКонтрагентаДата, "ДФ='дд.ММ.гггг'") + " г.");
	КонецПопытки;
	ПараметрыПечати.Вставить("Основание", Дог);
	ПараметрыПечати.Вставить("ДоговорКонтрагента", Шапка.ДоговорКонтрагента);
	ПараметрыПечати.Вставить("БИКБанкаПолучателя", БИК);
	ПараметрыПечати.Вставить("БанкПолучателя", Банк);
	ПараметрыПечати.Вставить("БанкПолучателяПредставление", СокрЛП(Банк) + " " + ГородБанка);
	ПараметрыПечати.Вставить("СчетБанкаПолучателя", КоррСчет);
	ПараметрыПечати.Вставить("СчетБанкаПолучателяПредставление", КоррСчет);
	ПараметрыПечати.Вставить("СчетПолучателяПредставление", НомерСчета);
	ПараметрыПечати.Вставить("СчетПолучателя", НомерСчета);
	ПредставлениеПоставщикаДляПлатПоручения = БанковскийСчет.ТекстКорреспондента;
	Если ПустаяСтрока(ПредставлениеПоставщикаДляПлатПоручения) Тогда
		ПредставлениеПоставщикаДляПлатПоручения = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
	КонецЕсли;
	ПараметрыПечати.Вставить("ПредставлениеПоставщикаДляПлатПоручения", ПредставлениеПоставщикаДляПлатПоручения);
	//ПараметрыПечати.Вставить("ТекстЗаголовка", ОбщегоНазначения.СформироватьЗаголовокДокумента(Шапка, "Счет на оплату"));
	ПараметрыПечати.Вставить("ТекстЗаголовка", "Счет на оплату № " + ПреобразоватьНомерДокумента(ОбщегоНазначения.ПолучитьНомерНаПечать(Шапка)) + " от " + Формат(Шапка.Дата, "ДФ='дд ММММ гггг'") + " г.");
	ПараметрыПечати.Вставить("ПредставлениеПоставщика", ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,"));
	СведенияОПолучателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
	ПараметрыПечати.Вставить("ПредставлениеПолучателя", ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,"));

	ПараметрыПечати.Вставить("ЕстьСкидки", Ложь);
	ПараметрыПечати.Вставить("ВыводитьКоды", Истина);
	
	Сумма    = 0;
	СуммаНДС = 0;
	ВсегоСкидок    = 0;
	ВсегоБезСкидок = 0;

	Для Каждого ВыборкаСтрокТовары Из ЗапросТовары Цикл 
		
		ПараметрыПозиции = Новый Структура;

		ПараметрыПозиции.Вставить("Номенклатура", ВыборкаСтрокТовары.Номенклатура);
		ПараметрыПозиции.Вставить("НомерСтроки", ЗапросТовары.Индекс(ВыборкаСтрокТовары) + 1);

		Если ПараметрыПечати.ВыводитьКоды Тогда
			ПараметрыПозиции.Вставить("ТоварАртикул", ВыборкаСтрокТовары.ТоварАртикул);
		КонецЕсли;

		Если ВыборкаСтрокТовары.Номенклатура.Услуга Тогда 
			ВыборкаСтрокТовары.ТоварНаименование = ВыборкаСтрокТовары.Номенклатура.Наименование;
			ВыборкаСтрокТовары.ТоварНаименованиеКраткое = ВыборкаСтрокТовары.Номенклатура.Наименование;
			ВыборкаСтрокТовары.БазоваяЕдиницаКодПоОКЕИ = "--";
			ВыборкаСтрокТовары.ЕдиницаИзмерения = "--";
			ВыборкаСтрокТовары.БазоваяЕдиницаНаименование = "--";
		КонецЕсли;	
		ПараметрыПозиции.Вставить("Количество", ВыборкаСтрокТовары.Количество);
		ПараметрыПозиции.Вставить("ЕдиницаИзмерения", ВыборкаСтрокТовары.ЕдиницаИзмерения);
		ПараметрыПозиции.Вставить("Цена", ВыборкаСтрокТовары.Цена);
		ПараметрыПозиции.Вставить("ТоварПроизводительНаименование", СокрП(ВыборкаСтрокТовары.ТоварПроизводительНаименование));
		Если НЕ ПустаяСтрока(СокрЛП(ВыборкаСтрокТовары.ТоварНаименование)) Тогда
			ПараметрыПозиции.Вставить("Товар", СокрЛП(ВыборкаСтрокТовары.ТоварНаименование));
		Иначе
			ПараметрыПозиции.Вставить("Товар", СокрЛП(ВыборкаСтрокТовары.ТоварНаименованиеКраткое));
		КонецЕсли;

		Скидка = Ценообразование.ПолучитьСуммуСкидки(ВыборкаСтрокТовары.Сумма, ВыборкаСтрокТовары.Скидка);

		Если ПараметрыПечати.ЕстьСкидки Тогда
			ПараметрыПозиции.Вставить("Скидка", Скидка);
			ПараметрыПозиции.Вставить("СуммаБезСкидки", ВыборкаСтрокТовары.Сумма + Скидка);
		КонецЕсли;

		ПараметрыПозиции.Вставить("Сумма", ВыборкаСтрокТовары.Сумма); 
		
		Сумма          = Сумма       + ВыборкаСтрокТовары.Сумма;
		СуммаНДС       = СуммаНДС    + ВыборкаСтрокТовары.СуммаНДС;
		ВсегоСкидок    = ВсегоСкидок + Скидка;
		ВсегоБезСкидок = Сумма       + ВсегоСкидок;
		
		Позиции.Добавить(ПараметрыПозиции);

	КонецЦикла;
	
	ПараметрыПечати.Вставить("Позиции", Позиции);

	// Вывести Итого
	Если ПараметрыПечати.ЕстьСкидки Тогда
		ПараметрыПечати.Вставить("ВсегоСкидок", ВсегоСкидок);
		ПараметрыПечати.Вставить("ВсегоБезСкидок", ВсегоБезСкидок);
	КонецЕсли;
	ПараметрыПечати.Вставить("Всего", ОбщегоНазначения.ФорматСумм(Сумма));

	// Вывести ИтогоНДС
	Если ПараметрыПечати.УчитыватьНДС Тогда
		ПараметрыПечати.Вставить("НДС", ?(Шапка.СуммаВключаетНДС, "В том числе НДС:", "Сумма НДС:"));
		ПараметрыПечати.Вставить("ВсегоНДС", ОбщегоНазначения.ФорматСумм(ЗапросТовары.Итог("СуммаНДС")));
	КонецЕсли;

	// Вывести Сумму прописью
	СуммаКПрописи = Сумма + ?(Шапка.СуммаВключаетНДС, 0, СуммаНДС);
	ПараметрыПечати.Вставить("ИтоговаяСтрока", "Всего наименований " + ЗапросТовары.Количество()
	+ ", на сумму " + ОбщегоНазначения.ФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента));
	ПараметрыПечати.Вставить("СуммаПрописью", ОбщегоНазначения.СформироватьСуммуПрописью(СуммаКПрописи, Шапка.ВалютаДокумента));

	// Вывести подписи
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(Шапка.Руководители, Шапка.Дата,);
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;

	ПараметрыПечати.Вставить("ФИОРуководителя", "/" + Руководитель  + "/");
	ПараметрыПечати.Вставить("ФИОБухгалтера", "/" + Бухгалтер     + "/");
	ПараметрыПечати.Вставить("ФИООтветственный", "/" + ПараметрыСеанса.ТекущийПользователь + "/");
	
	ПараметрыПечати.Вставить("КодКлиента", "ID клиента: " + Шапка.КодКлиента);

	Возврат ПараметрыПечати;
	
КонецФункции  // --- ПечатьСчетаНаОплату()   (Карпычев 31.01.18)		

Функция ПреобразоватьНомерДокумента(ИсходнаяСтрока)
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПреобразоватьНомерДокумента";
	лЗамена = АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено; 
		Выполнить(лЗамена); 
		Возврат АлгоритмыЗначениеВозврата; 
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////"
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПреобразоватьНомерДокумента";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда		
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;
	
	///////////////////////////////////////////////////////////////////////////
	
	КонечнаяСтрока = "";
	Для й = 1 По СтрДлина(ИсходнаяСтрока) Цикл
		ТекущийСимвол = Сред(ИсходнаяСтрока, й, 1);
		Если Найти("0123456789", ТекущийСимвол) > 0 Тогда
			КонечнаяСтрока = КонечнаяСтрока + ТекущийСимвол; 
		КонецЕсли;	
	КонецЦикла;
	
	// - удаление ведущих нулей
	Пока Лев(КонечнаяСтрока, 1) = "0" Цикл
		КонечнаяСтрока = Сред(КонечнаяСтрока, 2);
	КонецЦикла;
	
	Возврат КонечнаяСтрока;	
	
КонецФункции // --- Карпычев (02.02.18)

#КонецЕсли

Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПолучитьСтруктуруПечатныхФорм";
	лЗамена = АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено; 
		Выполнить(лЗамена); 
		Возврат АлгоритмыЗначениеВозврата; 
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////"

	СтруктураМакетов = Новый Структура;

	СтруктураМакетов.Вставить("УниверсальныйКорректировочныйДокумент", "Универсальный корректировочный документ (УКД)");
	//СтруктураМакетов.Вставить("СчетНаОплату"                     , "Счет на оплату");

	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ОбработкаЗаполнения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктРассмотренияВозврата") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		//Шапка
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктРассмотренияВозврата.Организация,
		|	АктРассмотренияВозврата.Организация.ОсновнойБанковскийСчет КАК БанковскийСчет,
		|	АктРассмотренияВозврата.КодВозврата,
		|	АктРассмотренияВозврата.Контрагент,
		|	АктРассмотренияВозврата.Контрагент.ОсновнаяТорговаяТочка КАК ТорговаяТочка,
		|	АктРассмотренияВозврата.ДокументПродажи КАК ДокументОснование,
		|	АктРассмотренияВозврата.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	АктРассмотренияВозврата.ДокументПродажи.Склад.ФизическийСклад.СкладВозвратов КАК Склад,
		|	АктРассмотренияВозврата.СуммаВключаетНДС КАК СуммаВключаетНДС,
		|	АктРассмотренияВозврата.УчитыватьНДС КАК УчитыватьНДС,
		|	АктРассмотренияВозврата.НомерСчетаФактурыКлиента КАК НомерВходящегоДокументаСФ,
		|	АктРассмотренияВозврата.ДатаСчетаФактурыКлиента КАК ДатаВходящегоДокументаСФ
		|ИЗ
		|	Документ.АктРассмотренияВозврата КАК АктРассмотренияВозврата
		|ГДЕ
		|	АктРассмотренияВозврата.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Шапка,,);
		
		Дата 					= ТекущаяДата();
		СтатусДокумента 		= Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяНовый;
		АктРассмотренияВозврата = ДанныеЗаполнения;
		Филиал 					= Справочники.Контрагенты.ФилиалКонтрагента(Контрагент);
		ВалютаДокумента			= ПараметрыСеанса.ВалютаРубль;
		КратностьВзаиморасчетов = 1;
		КурсВзаиморасчетов 		= 1;
		ВидОперации 			= Документы.ВозвратТоваровОтПокупателя.ОпределитьВидОперации(Дата, Шапка.Контрагент);

		//Товары
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктРассмотренияВозвратаТовары.Номенклатура,
		|	АктРассмотренияВозвратаТовары.ЕдиницаИзмерения,
		|	АктРассмотренияВозвратаТовары.Коэффициент,
		|	АктРассмотренияВозвратаТовары.Качество,
		|	0 КАК Количество,
		|	АктРассмотренияВозвратаТовары.КоличествоПлан КАК КоличествоПлан,
		|	АктРассмотренияВозвратаТовары.ЦенаПослеУценки КАК Цена,
		|	АктРассмотренияВозвратаТовары.СтавкаНДС,
		|	АктРассмотренияВозвратаТовары.СуммаНДС,
		|	АктРассмотренияВозвратаТовары.Сумма,
		|	АктРассмотренияВозвратаТовары.СтрокаЗаявки.IDSite КАК IDSite,
		|	АктРассмотренияВозвратаТовары.СтрокаЗаявки,
		|	АктРассмотренияВозвратаТовары.СтрокаПрихода,
		|	АктРассмотренияВозвратаТовары.СебестоимостьЦена,
		|	АктРассмотренияВозвратаТовары.Себестоимость
		|ИЗ
		|	Документ.АктРассмотренияВозврата.Товары КАК АктРассмотренияВозвратаТовары
		|ГДЕ
		|	АктРассмотренияВозвратаТовары.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	АктРассмотренияВозвратаТовары.НомерСтроки";
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		Результат = Запрос.Выполнить();
		
		Товары.Загрузить(Результат.Выгрузить());
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,,"Номер,Дата,СтатусДокумента");
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателяТовары.СтрокаЗаявки КАК СтрокаЗаявки,
		|	СУММА(ВозвратТоваровОтПокупателяТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ втВозвраты
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|ГДЕ
		|	ВозвратТоваровОтПокупателяТовары.Ссылка.ДокументОснование = &Ссылка
		|	И ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен
		|	И ВозвратТоваровОтПокупателяТовары.Ссылка.СтатусДокумента = &СтатусДокумента
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратТоваровОтПокупателяТовары.СтрокаЗаявки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СтрокаЗаявки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.Качество,
		|	РеализацияТоваровУслугТовары.Количество - ЕСТЬNULL(втВозвраты.Количество, 0) КАК КоличествоПлан,
		|	РеализацияТоваровУслугТовары.ЕдиницаИзмерения,
		|	РеализацияТоваровУслугТовары.Коэффициент,
		|	РеализацияТоваровУслугТовары.Цена,
		|	РеализацияТоваровУслугТовары.Сумма * РеализацияТоваровУслугТовары.Количество - ЕСТЬNULL(втВозвраты.Количество, 0) / РеализацияТоваровУслугТовары.Количество КАК Сумма,
		|	РеализацияТоваровУслугТовары.СтавкаНДС,
		|	РеализацияТоваровУслугТовары.СуммаНДС * РеализацияТоваровУслугТовары.Количество - ЕСТЬNULL(втВозвраты.Количество, 0) / РеализацияТоваровУслугТовары.Количество КАК СуммаНДС,
		|	РеализацияТоваровУслугТовары.СтрокаЗаявки,
		|	РеализацияТоваровУслугТовары.КомментарийИзСайта,
		|	РеализацияТоваровУслугТовары.IDSite,
		|	РеализацияТоваровУслугТовары.ПроцентСкидкиНаценки,
		|	РеализацияТоваровУслугТовары.Количество - ЕСТЬNULL(втВозвраты.Количество, 0) КАК Количество
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ втВозвраты КАК втВозвраты
		|		ПО РеализацияТоваровУслугТовары.СтрокаЗаявки = втВозвраты.СтрокаЗаявки
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугТовары.Количество - ЕСТЬNULL(втВозвраты.Количество, 0) > 0";
		//Запрос = Новый Запрос("ВЫБРАТЬ
		//                      |	РеализацияТоваровУслугТовары.Номенклатура,
		//                      |	РеализацияТоваровУслугТовары.Качество,
		//                      |	РеализацияТоваровУслугТовары.Количество,
		//                      |	РеализацияТоваровУслугТовары.ЕдиницаИзмерения,
		//                      |	РеализацияТоваровУслугТовары.Коэффициент,
		//                      |	РеализацияТоваровУслугТовары.Цена,
		//                      |	РеализацияТоваровУслугТовары.Сумма,
		//                      |	РеализацияТоваровУслугТовары.СтавкаНДС,
		//                      |	РеализацияТоваровУслугТовары.СуммаНДС,
		//                      |	РеализацияТоваровУслугТовары.СтрокаЗаявки КАК СтрокаЗаявки,
		//                      |	РеализацияТоваровУслугТовары.КомментарийИзСайта,
		//                      |	РеализацияТоваровУслугТовары.IDSite,
		//                      |	РеализацияТоваровУслугТовары.ПроцентСкидкиНаценки,
		//                      |	РеализацияТоваровУслугТовары.КоличествоПлан,
		//                      |	РеализацияТоваровУслугТовары.Ссылка
		//                      |ПОМЕСТИТЬ втТЧ
		//                      |ИЗ
		//                      |	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		//                      |ГДЕ
		//                      |	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		//                      |
		//                      |ИНДЕКСИРОВАТЬ ПО
		//                      |	СтрокаЗаявки
		//                      |;
		//                      |
		//                      |////////////////////////////////////////////////////////////////////////////////
		//                      |ВЫБРАТЬ
		//                      |	втТЧ.Номенклатура,
		//                      |	втТЧ.Качество,
		//                      |	втТЧ.Количество - ЕСТЬNULL(ТоварыКОтгрузкеОбороты.КоличествоОборот, 0) - ЕСТЬNULL(ПродажиОбороты.КоличествоВозвратОборот, 0) КАК Количество,
		//                      |	втТЧ.ЕдиницаИзмерения,
		//                      |	втТЧ.Коэффициент,
		//                      |	втТЧ.Цена,
		//                      |	втТЧ.Сумма * (втТЧ.Количество - ЕСТЬNULL(ТоварыКОтгрузкеОбороты.КоличествоОборот, 0) - ЕСТЬNULL(ПродажиОбороты.КоличествоВозвратОборот, 0)) / втТЧ.Количество КАК Сумма,
		//                      |	втТЧ.СтавкаНДС,
		//                      |	втТЧ.СуммаНДС * (втТЧ.Количество - ЕСТЬNULL(ТоварыКОтгрузкеОбороты.КоличествоОборот, 0) - ЕСТЬNULL(ПродажиОбороты.КоличествоВозвратОборот, 0)) / втТЧ.Количество КАК СуммаНДС,
		//                      |	втТЧ.СтрокаЗаявки,
		//                      |	втТЧ.КомментарийИзСайта,
		//                      |	втТЧ.IDSite,
		//                      |	втТЧ.ПроцентСкидкиНаценки,
		//                      |	втТЧ.Количество - ЕСТЬNULL(ТоварыКОтгрузкеОбороты.КоличествоОборот, 0) - ЕСТЬNULL(ПродажиОбороты.КоличествоВозвратОборот, 0) КАК КоличествоПлан,
		//                      |	втТЧ.Количество КАК КоличествоРеализации,
		//                      |	втТЧ.Сумма КАК СуммаРеализации,
		//                      |	втТЧ.Ссылка КАК Реализация
		//                      |ИЗ
		//                      |	втТЧ КАК втТЧ
		//                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКОтгрузке.Обороты(
		//                      |				НЕОПРЕДЕЛЕНО,
		//                      |				&ТекущаяДата,
		//                      |				,
		//                      |				СтрокаЗаявки В
		//                      |						(ВЫБРАТЬ
		//                      |							втТЧ.СтрокаЗаявки
		//                      |						ИЗ
		//                      |							втТЧ КАК втТЧ)
		//                      |					И Статус = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ВозвратТоваровОтПокупателя)) КАК ТоварыКОтгрузкеОбороты
		//                      |		ПО втТЧ.СтрокаЗаявки = ТоварыКОтгрузкеОбороты.СтрокаЗаявки
		//                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(
		//                      |				НЕОПРЕДЕЛЕНО,
		//                      |				&ТекущаяДата,
		//                      |				,
		//                      |				СтрокаЗаявки В
		//                      |						(ВЫБРАТЬ
		//                      |							втТЧ.СтрокаЗаявки
		//                      |						ИЗ
		//                      |							втТЧ КАК втТЧ)
		//                      |					И Статус = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.РеализацияТоваровУслуг)) КАК ПродажиОбороты
		//                      |		ПО втТЧ.СтрокаЗаявки = ПродажиОбороты.СтрокаЗаявки
		//                      |ГДЕ
		//                      |	втТЧ.Количество - ЕСТЬNULL(ТоварыКОтгрузкеОбороты.КоличествоОборот, 0) - ЕСТЬNULL(ПродажиОбороты.КоличествоВозвратОборот, 0) > 0");
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		//Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Запрос.УстановитьПараметр("СтатусДокумента", Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяПринят);
		
		Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяНовый;
		ДокументОснование = ДанныеЗаполнения;
		Дата = ТекущаяДата();
		ДополнительныеСвойства.Вставить("ВводНаОсновании");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ОбработкаПроведения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	ЭтотОбъект.ДополнительныеСвойства.Контроль.Вставить("НовыеЗначения",
	Новый Соответствие);
	ЭтотОбъект.ДополнительныеСвойства.Контроль.НовыеЗначения.Вставить(
	Метаданные.Последовательности.ПоРасчетамСКонтрагентами, 
	мМенеджерОбъекта.ПолучитьЗначенияРеквизитовКонтроля(ЭтотОбъект.Ссылка,
	Метаданные.Последовательности.ПоРасчетамСКонтрагентами));
	
	лПараметры = Новый Структура;
	лПараметры.Вставить("ДанныеОбъекта", ЭтотОбъект.ДополнительныеСвойства);
	мМенеджерОбъекта.ВыполнитьПроведение(Ссылка, Отказ, лПараметры);
	
	Если Не глЗначениеПеременной("НовоеПроведениеПоВзаиморасчетам") Тогда 
		РаботаСПоследовательностямиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, "ПоРасчетамСКонтрагентами");
	КонецЕсли;
	
	
	КонтролироватьСтрокиЗаявокВозвратовПоАктам = Константы.КонтролироватьСтрокиЗаявокВозвратовПоАктам.Получить();
	Если КонтролироватьСтрокиЗаявокВозвратовПоАктам И ЗначениеЗаполнено(АктРассмотренияВозврата) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ Различные
		|	ВозвратТоваровОтПокупателяТовары.СтрокаЗаявки,
		|	ВозвратТоваровОтПокупателяТовары.Ссылка
		|ПОМЕСТИТЬ СтрокиВозврата
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
		|ГДЕ
		|	ВозвратТоваровОтПокупателяТовары.Ссылка = &Возврат
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ Различные
		|	АктРассмотренияВозвратаТовары.СтрокаЗаявки,
		|	АктРассмотренияВозвратаТовары.Ссылка
		|ПОМЕСТИТЬ СтрокиАкта
		|ИЗ
		|	Документ.АктРассмотренияВозврата.Товары КАК АктРассмотренияВозвратаТовары
		|ГДЕ
		|	АктРассмотренияВозвратаТовары.Ссылка = &Акт
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателяТовары.СтрокаЗаявки КАК СтрокаЗаявкиВозврат,
		|	АктРассмотренияВозвратаТовары.СтрокаЗаявки КАК СтрокаЗаявкиАРВ
		|ИЗ
		|	СтрокиВозврата КАК ВозвратТоваровОтПокупателяТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтрокиАкта КАК АктРассмотренияВозвратаТовары
		|		ПО ВозвратТоваровОтПокупателяТовары.СтрокаЗаявки = АктРассмотренияВозвратаТовары.СтрокаЗаявки
		|ГДЕ
		|	АктРассмотренияВозвратаТовары.СтрокаЗаявки ЕСТЬ NULL";
		Запрос.УстановитьПараметр("Возврат", Ссылка);
		Запрос.УстановитьПараметр("Акт", АктРассмотренияВозврата);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		ТекстОшибки = "";
		Пока Выборка.Следующий() Цикл
			ТекстОшибки = ТекстОшибки + Символы.ПС+ "Строка заявки "+Выборка.СтрокаЗаявкиВозврат+" отсутствует в Акте возврата!";
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			Сообщить(ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецЕсли;
		
	КонецЕсли;
	
	// ЛНА, Замер  APDEX ++(
	Попытка		
		APDEX_ОценкаПроизводительностиКлиентСервер.ЗакончитьЗамерВремени("ВозвратТоваровОтПокупателя_Проведение", "Кол-во строк: "+Товары.Количество(), , Ссылка);
	Исключение
	КонецПопытки;
	//)--
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ОбработкаУдаленияПроведения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	лПараметры = Новый Структура;
	лПараметры.Вставить("ДанныеОбъекта", ЭтотОбъект.ДополнительныеСвойства);
	мМенеджерОбъекта.ВыполнитьОтменуПроведения(Ссылка, Отказ, лПараметры);
	
	Если Не глЗначениеПеременной("НовоеПроведениеПоВзаиморасчетам") Тогда 
		РаботаСПоследовательностямиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, "ПоРасчетамСКонтрагентами");
	КонецЕсли;
	
	//ХудинВВ 11032019 XX-2071
	СнятьПризнакПечатиУКДОтправитьСообщениеПриУдаленииПроведения(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПередЗаписью";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	// ЛНА, Замер  APDEX ++(
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		APDEX_ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени("ВозвратТоваровОтПокупателя_Проведение");
		
	КонецЕсли;
	//)--
	
	//#XX-453 Kalinin V.A. ( 2018-09-03 )
	// Чтобы не засирать модуль вынес все заполнение в отдельный модуль 
	ЗаполнитьНезаполненыеЗначенияДокумента();
	
	Если НЕ ЗначениеЗаполнено(КонтрагентВзаиморасчетов) ИЛИ НЕ ЗначениеЗаполнено(ДоговорКонтрагентаВзаиморасчетов) Тогда
		УстановитьКонтрагентаВзаиморасчетов();
	КонецЕсли;
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		СсылкаНаДокумент = ЭтотОбъект.ПолучитьСсылкуНового();
		Если СсылкаНаДокумент.Пустая() Тогда 
			СсылкаНаДокумент = Документы.ВозвратТоваровОтПокупателя.ПолучитьСсылку();
			ЭтотОбъект.УстановитьСсылкуНового(СсылкаНаДокумент);
		КонецЕсли;
	Иначе
		СсылкаНаДокумент = Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОснование) Тогда 	//Генерируем строки прихода для возврата товаров от покупателя без основания
		СтруктураПоиска = Новый Структура("СтрокаПрихода", Справочники.ИдентификаторыСтрокПриходов.ПустаяСсылка());
		НайденныеСтроки = Товары.НайтиСтроки(СтруктураПоиска);
		Для Каждого ТекСтрока Из НайденныеСтроки Цикл
			
			СсылкаНаОбъект = Справочники.ИдентификаторыСтрокПриходов.ПолучитьСсылку();
			
			НоваяСтрокаПрихода = Справочники.ИдентификаторыСтрокПриходов.СоздатьЭлемент();
			НоваяСтрокаПрихода.Дата = ЭтотОбъект.Дата;
			НоваяСтрокаПрихода.Приход = СсылкаНаДокумент;
			НоваяСтрокаПрихода.УстановитьСсылкуНового(СсылкаНаОбъект);
			НоваяСтрокаПрихода.Наименование = СсылкаНаОбъект.УникальныйИдентификатор();
			НоваяСтрокаПрихода.Записать();
			
			ТекСтрока.СтрокаПрихода = НоваяСтрокаПрихода.Ссылка;
			
		КонецЦикла;
	КонецЕсли;	
	
	//Если ОбменДанными.Загрузка  Тогда
	//	Возврат;
	//КонецЕсли;

	//ХудинВВ Зачем очищаются допсвойства?
	//Очищение оставим, чтобы что-нибудь не сломалось.
	СнятьОграничениеПоДатеЗапрета 	= ДополнительныеСвойства.Свойство("СнятьОграничениеПоДатеЗапрета");
	РежимБога 						= ДополнительныеСвойства.Свойство("РежимБога");
	
	ЭтотОбъект.ДополнительныеСвойства.Очистить();
	ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	//ХудинВВ вставим обратно, если были
	Если СнятьОграничениеПоДатеЗапрета Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СнятьОграничениеПоДатеЗапрета", Истина);
	КонецЕсли;
	Если РежимБога Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("РежимБога", Истина);
	КонецЕсли;
	
	Если (РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения) тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("Контроль", Новый Структура);
		Если НЕ ЭтоНовый() тогда
			ЭтотОбъект.ДополнительныеСвойства.Контроль.Вставить("СтарыеЗначения", Новый Соответствие);
			ЭтотОбъект.ДополнительныеСвойства.Контроль.СтарыеЗначения.Вставить(
			Метаданные.Последовательности.ПоРасчетамСКонтрагентами, мМенеджерОбъекта.ПолучитьЗначенияРеквизитовКонтроля(
			ЭтотОбъект.Ссылка, Метаданные.Последовательности.ПоРасчетамСКонтрагентами));
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтатусДокумента) Тогда
		СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяНовый
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДокументОснование) И УчитыватьНДС Тогда
		РеквизитыДокументаПродажи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Дата");
		ОбратнаяРеализацияПриВозвратеОтКлиента =  ВидОперации = Перечисления.ВидыОперацийВозвратаОтПокупателя.ОбратнаяРеализация;

		Если РеквизитыДокументаПродажи.Дата < Дата(2019,1,1)  Тогда
			Для Каждого СтрокаТЧ Из Товары Цикл 
				Если СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС20 И ОбратнаяРеализацияПриВозвратеОтКлиента = Ложь Тогда 
					СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, ЭтотОбъект);
				ИначеЕсли СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС18 И ОбратнаяРеализацияПриВозвратеОтКлиента = Истина Тогда 
					СтрокаТЧ.СтавкаНДС = Перечисления.СтавкиНДС.НДС20;
					ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТЧ, ЭтотОбъект);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	СуммаДокумента = УчетНДС.ПолучитьСуммуДокументаСНДС(ЭтотОбъект, "Товары");
	//Если Лев(Номер,1)="D" Тогда 
	//	Сообщить("Документ создан в 1с7. В 1с8 его менять запрещено. Все изменения в 1с8 нужно так же выполнить и в 1с!");
	//	Если Не (РольДоступна("полныеПрава") Или РольДоступна("Склад")) Тогда 
	//		Отказ=Истина;
	//		Возврат;
	//	КонецЕсли;	
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(АктРассмотренияВозврата) 
		И (СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяРазмещен
		ИЛИ СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяРазмещенДляЭкспертизы)
		И Не ЗначениеЗаполнено(ЗавершилРазмещение) Тогда
		ЗавершилРазмещение = ПараметрыСеанса.ТекущийПользователь;
		ДатаЗавершенияРазмещения = ТекущаяДата();		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(АктРассмотренияВозврата) 
		И Не ЗначениеЗаполнено(ДокументОснование) Тогда
		ВызватьИсключение "Для возвратов по акту возврата необходимо указание документа-основания";
	КонецЕсли;
	
	//Не может быть размещено больше, чем приняли
	Если ЗначениеЗаполнено(АктРассмотренияВозврата) 
		И (СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяРазмещен
		ИЛИ СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяРазмещенДляЭкспертизы) Тогда
		Для каждого СтрокаТЧ Из Товары Цикл
			Если СтрокаТЧ.КоличествоРазмещено > СтрокаТЧ.Количество Тогда
				ВызватьИсключение "По товару """+СтрокаТЧ.Номенклатура+""" в строке """+СтрокаТЧ.НомерСтроки+""" размещено больше, чем принято!";
			КонецЕсли;		
		КонецЦикла;
	КонецЕсли;
	
	//По одному акту нельзя вводить несколько возвратов
	Если ЗначениеЗаполнено(АктРассмотренияВозврата) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателя.Ссылка
		|ИЗ
		|	Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
		|ГДЕ
		|	ВозвратТоваровОтПокупателя.АктРассмотренияВозврата = &АктРассмотренияВозврата
		|	И ВозвратТоваровОтПокупателя.Ссылка <> &Ссылка";
		
		Запрос.УстановитьПараметр("АктРассмотренияВозврата", АктРассмотренияВозврата);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Количество() > 0 Тогда
			Отказ = Истина;
			ВызватьИсключение "По документу """+АктРассмотренияВозврата+""" уже создан документ возврата от покупателя!";
		КонецЕсли;
		
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение
			И НЕ РазрешитьВозвратНаФизическийСклад Тогда
			Если Не Склад.Возвраты Тогда
				Отказ = Истина;
				ВызватьИсключение "Возвраты по актам могут приниматься только на склады возвратов!";
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	//В очередь на отправку
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И (СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяПринят 
		ИЛИ СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяРазмещен)
		И Дата >= Дата(2019,1,1)
		И ЗначениеЗаполнено(ДокументОснование) Тогда
		
		СостояниеОтправкиДокумента = РегистрыСведений.ОчередьОтправкиДокументовОтгрузки.СостояниеДокумента(Ссылка);
		Если СостояниеОтправкиДокумента.Документ = Неопределено Тогда
			ДополнительныеСвойства.Вставить("ДобавитьВОчередьОтправкиДокументовОтгрузки");
		КонецЕсли;
	КонецЕсли;
	
	
	Филиал = Справочники.Контрагенты.ФилиалКонтрагента(Контрагент);
	
	ПересчитатьСуммуТабличнойЧастиПриИзмененииСтатуса();
	
	//Семенов И.П. 18.03.2019 XX-2073(
	Если Не Отказ 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		РегистрыСведений.РегистрацияОбъектовДляВыгрузкиВБухгалтерию.Зарегистрировать(ЭтотОбъект);
	КонецЕсли;
	//)Семенов И.П.
КонецПроцедуры

Процедура ПересчитатьСуммуТабличнойЧастиПриИзмененииСтатуса()
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПересчитатьСуммуТабличнойЧастиПриИзмененииСтатуса";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	СтарыйСтатус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "СтатусДокумента");
	ТекущийСтатус = СтатусДокумента;
	
	Если СтарыйСтатус <> ТекущийСтатус
		И (СтарыйСтатус = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяНовый
		ИЛИ ТекущийСтатус = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяНовый)
		И ЗначениеЗаполнено(АктРассмотренияВозврата) Тогда
		
		ПересчитатьСуммуТабличнойЧасти();	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНезаполненыеЗначенияДокумента()
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ЗаполнитьНезаполненыеЗначенияДокумента";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	//#XX-100 Kalinin V.A. ( 2018-06-15 )
	Если Не ЗначениеЗаполнено(Менеджер) тогда 
		ЗапросМенеджеров = новый  Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	МенеджерыТорговыхТочекСрезПоследних.Менеджер
		|ИЗ
		|	РегистрСведений.МенеджерыТорговыхТочек.СрезПоследних(
		|			,
		|			ВидМенеджера = ЗНАЧЕНИЕ(Перечисление.ВидыМенеджеров.Продажи)
		|				И ТорговаяТочка = &ТорговаяТочка) КАК МенеджерыТорговыхТочекСрезПоследних" );
		ЗапросМенеджеров.УстановитьПараметр("ТорговаяТочка",ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент,"ОсновнаяТорговаяТочка"));
		
		Результат = ЗапросМенеджеров.Выполнить();
		Если не Результат.Пустой() тогда 
			Выборка  = Результат.Выбрать();
			Выборка.Следующий();
			Менеджер = Выборка.Менеджер;
		КонецЕсли;
	КонецЕсли;		
	
	// + 20180903 Пушкин XX-660
	Филиал = Документы.ЗаявкаПокупателя.ВернутьФилиал(Контрагент);
	// - 20180903 Пушкин XX-660
	
	//Заполнение строк заявок в документе
	Если ЗначениеЗаполнено(ДокументОснование) тогда 
		ТаблицаРеализации  =  ОбщегоНазначения.ЗначенияРеквизитовТабличнойЧастиОбъекта(ДокументОснование,"Товары","СтрокаЗаявки,Номенклатура,IDSite");
		Для каждого СтрокаВозврата из Товары цикл 
			НайдСтрока = ТаблицаРеализации.Найти(СтрокаВозврата.Номенклатура,"Номенклатура");
			Если НЕ НайдСтрока = Неопределено тогда 
				Если Не ЗначениеЗаполнено(СтрокаВозврата.СтрокаЗаявки) Тогда
					ЗаполнитьЗначенияСвойств(СтрокаВозврата,НайдСтрока,"СтрокаЗаявки,IDSite");
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПриУстановкеНовогоНомера";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	//ОбщегоНазначения.ДобавитьПрефиксОрганизации(ЭтотОбъект, Префикс);
	//ОбщегоНазначения.ДобавитьПрефиксУзла(Префикс);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПриЗаписи";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если ОбменДанными.Загрузка И НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		//если это мать его колобок, нужно получить из 1с7 документ основание
		СсылкаНаРеализацию = ПодключитьсяКБазеСемерки(Ссылка.УникальныйИдентификатор());
		Если Лев(СсылкаНаРеализацию, 1) = "{" Тогда
			СсылкаНаРеализацию = Прав(СсылкаНаРеализацию, СтрДлина(СсылкаНаРеализацию) - 1);
		КонецЕсли;
		Если Прав(СсылкаНаРеализацию, 1) = "}" Тогда
			СсылкаНаРеализацию = Лев(СсылкаНаРеализацию, СтрДлина(СсылкаНаРеализацию) - 1);
		КонецЕсли;
		Если СсылкаНаРеализацию <> Неопределено Тогда
			ДокОснование = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(СсылкаНаРеализацию));
			Если ЗначениеЗаполнено(ДокОснование) Тогда
				ДокументОснование = ДокОснование;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	//Если РежимЗаписи = РежимЗаписиДокумента.Проведение тогда 
	КорректировкаСебестоимостиТоваров();
	//КонецЕсли;
	
	ОтразитьСобытиеКОбработкеАктовРассмотренияВозврата();
	
	Если ВидОперации = Перечисления.ВидыОперацийВозвратаОтПокупателя.ОбратнаяРеализация Тогда
		МЗ = РегистрыСведений.НомераСчетовФактур.СоздатьМенеджерЗаписи();
		МЗ.ДатаСчетаФактуры = ДатаВходящегоДокументаСФ;
		МЗ.НомерСчетаФактуры = НомерВходящегоДокументаСФ;
		МЗ.Объект = Ссылка;
		МЗ.Записать();
	КонецЕсли;
	
	Если НЕ Отказ тогда
		Документы.ВозвратТоваровОтПокупателя.СоздатьУдалитьСчетФактуру(Ссылка, Ложь);
	КонецЕсли;

	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ВозвратТоваровОтПокупателяТовары.СтрокаПрихода
	//               |ИЗ
	//               |	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	//               |ГДЕ
	//               |	ВозвратТоваровОтПокупателяТовары.Ссылка = &Ссылка
	//               |	И ВозвратТоваровОтПокупателяТовары.СтрокаПрихода.Приход = ЗНАЧЕНИЕ(Документ.ВозвратТоваровОтПокупателя.ПустаяСсылка)";
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Объект = Выборка.СтрокаПрихода.ПолучитьОбъект();
	//	Объект.Приход = Ссылка;
	//	Объект.Записать();
	//	
	//КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ОбработкаПроверкиЗаполнения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	ПроверяемыеРеквизиты.Добавить("Организация");
	ПроверяемыеРеквизиты.Добавить("Контрагент");
	ПроверяемыеРеквизиты.Добавить("ДоговорКонтрагента");
	ПроверяемыеРеквизиты.Добавить("Склад");
	ПроверяемыеРеквизиты.Добавить("Товары.Цена");
	
	Если Не ЗначениеЗаполнено(АктРассмотренияВозврата) Тогда
		//Это документ из 77
		ПроверяемыеРеквизиты.Добавить("Товары.Количество");
		ПроверяемыеРеквизиты.Добавить("Товары.Сумма");
	Иначе
		
		//Проверка суммы
		// Сумма считается от принятого количества, она должна быть заполнена в этом статусе
		Если СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяПринят
			ИЛИ СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяРазмещен
			ИЛИ СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяПринятДляЭкспертизы
			ИЛИ СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяРазмещенДляЭкспертизы Тогда
			ПроверяемыеРеквизиты.Добавить("Товары.Сумма");
		КонецЕсли;
		
		//Проверка количества
		ПроверяемыеРеквизиты.Добавить("Товары.КоличествоПлан");
		//Если документ принят, заполнять принятое количество необязательно, тк клиент мог не привезти товар
		//Если документ размещен, заполнять размещенное количество необязательно, тк склад мог потерять все что принял
		
		//Должна быть заполнена возвращаемая партия
		ПроверяемыеРеквизиты.Добавить("Товары.СтрокаПрихода");
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПередУдалением";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если НЕ Отказ тогда
		Документы.ВозвратТоваровОтПокупателя.СоздатьУдалитьСчетФактуру(Ссылка, Истина);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ПроцессВозвратов

Процедура ОтразитьСобытиеКОбработкеАктовРассмотренияВозврата()
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ОтразитьСобытиеКОбработкеАктовРассмотренияВозврата";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	лРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Проведен, СтатусДокумента, КодВозврата, АктРассмотренияВозврата, СостояниеОтменыВТоплог");
	
	Если Не ЗначениеЗаполнено(лРеквизиты.АктРассмотренияВозврата) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не лРеквизиты.Проведен Тогда
		Возврат;
	КонецЕсли;
	
	Если лРеквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяНовый
		И НЕ лРеквизиты.СостояниеОтменыВТоплог = Перечисления.СостоянияОтменыЗаказаНаПриемкуВТоплог.НеОтменен Тогда 
		//ХудинВВ 27022019 XX-1868 Если не смогли отменить приемку в топлоге, нужно двинуть процесс дальше
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.СобытияКОбработкеАктовРассмотренияВозврата.Добавить(лРеквизиты.АктРассмотренияВозврата, 
	Перечисления.ВидыСобытийКОбработкеПроцессаВозвратов.ЗагрузкаВозвратаОтПокупателяИзТопЛог, 
	Ссылка);
	
КонецПроцедуры

//ХудинВВ 11032019 XX-2071
Процедура СнятьПризнакПечатиУКДОтправитьСообщениеПриУдаленииПроведения(Отказ)
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_СнятьПризнакПечатиУКДОтправитьСообщениеПриУдаленииПроведения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ (СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяПринят
		ИЛИ СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяРазмещен) Тогда
		Возврат;
	КонецЕсли;
	
	//Если есть принятые возвраты по той же РТУ, по которым напечатаны укд, то нужно снять отметку печати
	//и отправить сообщение по электропочте об этом
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратТоваровОтПокупателя.Ссылка,
		|	ДатыПечатиДокументов.Напечатан,
		|	ДатыПечатиДокументов.ДатаПечати,
		|	ДатыПечатиДокументов.Пользователь.Представление КАК ПользовательПредставление,
		|	ВозвратТоваровОтПокупателя.Организация,
		|	ВозвратТоваровОтПокупателя.Контрагент.Представление КАК КонтрагентПредставление,
		|	ВозвратТоваровОтПокупателя.Филиал.Представление КАК ФилиалПредставление,
		|	ВозвратТоваровОтПокупателя.Представление
		|ИЗ
		|	РегистрСведений.ДатыПечатиДокументов КАК ДатыПечатиДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя КАК ВозвратТоваровОтПокупателя
		|		ПО ДатыПечатиДокументов.Документ = ВозвратТоваровОтПокупателя.Ссылка
		|			И (ДатыПечатиДокументов.ВидПечатногоДокумента = ЗНАЧЕНИЕ(Перечисление.ВидыПечатныхДокументов.УКД))
		|ГДЕ
		|	ВозвратТоваровОтПокупателя.МоментВремени > &МоментВремени
		|	И ВозвратТоваровОтПокупателя.Проведен
		|	И ВозвратТоваровОтПокупателя.ДокументОснование = &ДокументОснование
		|	И ЕСТЬNULL(ДатыПечатиДокументов.Напечатан, ЛОЖЬ)
		|	И (ВозвратТоваровОтПокупателя.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ВозвратТоваровОтПокупателяПринят)
		|			ИЛИ ВозвратТоваровОтПокупателя.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ВозвратТоваровОтПокупателяРазмещен))";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТекстСообщения = "Список распечатанных УКД, у которых снята отметка о печати, для перепечатывания:"+Символы.ПС+Символы.ПС;
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = ТекстСообщения + "" + 
		Выборка.Представление+", "+Выборка.КонтрагентПредставление+", "+Выборка.ФилиалПредставление + 
		" (напечатан "+Выборка.ПользовательПредставление+", "+Выборка.ДатаПечати+")"+Символы.ПС; 
		
		РегистрыСведений.ДатыПечатиДокументов.Отменить(Выборка.Ссылка, Перечисления.ВидыПечатныхДокументов.УКД);
	КонецЦикла;
	
	Если Выборка.Количество() > 0 Тогда
		
		КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(Ссылка, 
		Справочники.СобытияДляОтправкиЭлектронныхПисем.УдалениеВозвратаОтПокупателяПерепечататьУКД,
		ТекстСообщения,
		,
		Истина,
		,
		"Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_СнятьПризнакПечатиУКДОтправитьСообщениеПриУдаленииПроведения");	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура КорректировкаСебестоимостиТоваров() Экспорт 
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_КорректировкаСебестоимостиТоваров";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если ЗначениеЗаполнено(АктРассмотренияВозврата) Тогда
		Возврат;
	КонецЕсли;
	
	//# Kalinin V.A. ( 2018-06-30 )
	ЗапросСценами = новый Запрос("ВЫБРАТЬ
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	|	ВозвратТоваровОтПокупателяТовары.Качество,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Склад,
	|	ВозвратТоваровОтПокупателяТовары.СтрокаЗаявки,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.ТорговаяТочка,
	|	СУММА(ВозвратТоваровОтПокупателяТовары.Количество) КАК КоличествоВозврат,
	|	СУММА(ВозвратТоваровОтПокупателяТовары.Сумма) КАК СуммаРеглВозврат,
	|	СУММА(ВозвратТоваровОтПокупателяТовары.Сумма) КАК СуммаУпрВозврат,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка КАК Регистратор,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Дата КАК Период,
	|	СРЕДНЕЕ(ВозвратТоваровОтПокупателяТовары.Себестоимость) КАК Себестоимость,
	|	ВозвратТоваровОтПокупателяТовары.СебестоимостьЦена
	|ПОМЕСТИТЬ ВтДанные
	|ИЗ
	|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
	|ГДЕ
	|	ВозвратТоваровОтПокупателяТовары.Ссылка = &Ссылка
	|	И ВозвратТоваровОтПокупателяТовары.Себестоимость = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
	|	ВозвратТоваровОтПокупателяТовары.Качество,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Склад,
	|	ВозвратТоваровОтПокупателяТовары.СтрокаЗаявки,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.ТорговаяТочка,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка,
	|	ВозвратТоваровОтПокупателяТовары.Ссылка.Дата,
	|	ВозвратТоваровОтПокупателяТовары.СебестоимостьЦена
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СРЕДНЕЕ(Продажи.СебестоимостьРубли / Продажи.Количество) КАК Себестоимость,
	|	Продажи.Номенклатура
	|ПОМЕСТИТЬ ВтПродажи
	|ИЗ
	|	РегистрНакопления.Продажи КАК Продажи
	|ГДЕ
	|	Продажи.Регистратор = ВЫРАЗИТЬ(&Ссылка КАК Документ.ВозвратТоваровОтПокупателя).ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	Продажи.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтДанные.Номенклатура,
	|	ВтДанные.Качество,
	|	ВтДанные.Склад,
	|	ВтДанные.СтрокаЗаявки,
	|	ВтДанные.ТорговаяТочка,
	|	ВтДанные.КоличествоВозврат,
	|	ВтДанные.СуммаРеглВозврат,
	|	ВтДанные.СуммаУпрВозврат,
	|	ВтДанные.Регистратор,
	|	ВтДанные.Период,
	|	ВЫБОР
	|		КОГДА ВтДанные.Себестоимость = 0
	|			ТОГДА ЕСТЬNULL(ВтПродажи.Себестоимость, 0) * ВтДанные.КоличествоВозврат
	|		ИНАЧЕ ВтДанные.Себестоимость
	|	КОНЕЦ КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА ВтДанные.СебестоимостьЦена = 0
	|			ТОГДА ЕСТЬNULL(ВтПродажи.Себестоимость, 0)
	|		ИНАЧЕ ВтДанные.СебестоимостьЦена
	|	КОНЕЦ КАК СебестоимостьЦена
	|ПОМЕСТИТЬ ВТДанныеИПродажи
	|ИЗ
	|	ВтДанные КАК ВтДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтПродажи КАК ВтПродажи
	|		ПО ВтДанные.Номенклатура = ВтПродажи.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииТоваров.Номенклатура,
	|	МАКСИМУМ(ПартииТоваров.СуммаРубли / ПартииТоваров.Количество) КАК СебестоимостьЦена
	|ПОМЕСТИТЬ ЦенаПартии
	|ИЗ
	|	РегистрНакопления.ПартииТоваров КАК ПартииТоваров
	|ГДЕ
	|	ПартииТоваров.ВидДвижения = ЗНАЧЕНИЕ(виддвижениянакопления.ПРИХОД)
	|	И ПартииТоваров.Номенклатура В
	|			(ВЫБРАТЬ
	|				ВТДанныеИПродажи.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ВТДанныеИПродажи КАК ВТДанныеИПродажи
	|			ГДЕ
	|				ВТДанныеИПродажи.Себестоимость = 0)
	|	И ПартииТоваров.Период <= &Момент
	|	И ПартииТоваров.Регистратор ССЫЛКА Документ.ПоступлениеТоваровУслуг
	|
	|СГРУППИРОВАТЬ ПО
	|	ПартииТоваров.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТДанныеИПродажи.Номенклатура,
	|	ВТДанныеИПродажи.Качество,
	|	ВТДанныеИПродажи.Склад,
	|	ВТДанныеИПродажи.СтрокаЗаявки,
	|	ВТДанныеИПродажи.ТорговаяТочка,
	|	ВТДанныеИПродажи.КоличествоВозврат,
	|	ВТДанныеИПродажи.СуммаРеглВозврат,
	|	ВТДанныеИПродажи.СуммаУпрВозврат,
	|	ВТДанныеИПродажи.Регистратор,
	|	ВТДанныеИПродажи.Период,
	|	ВЫБОР
	|		КОГДА ВТДанныеИПродажи.Себестоимость = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЦенаПартии.СебестоимостьЦена, 0) = 0
	|						ТОГДА ВТДанныеИПродажи.СтрокаЗаявки.ЦенаЗакупки * ВТДанныеИПродажи.КоличествоВозврат
	|					ИНАЧЕ ЦенаПартии.СебестоимостьЦена * ВТДанныеИПродажи.КоличествоВозврат
	|				КОНЕЦ
	|		ИНАЧЕ ВТДанныеИПродажи.Себестоимость
	|	КОНЕЦ КАК Себестоимость,
	|	ВЫБОР
	|		КОГДА ВТДанныеИПродажи.Себестоимость = 0
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(ЦенаПартии.СебестоимостьЦена, 0) = 0
	|						ТОГДА ВТДанныеИПродажи.СтрокаЗаявки.ЦенаЗакупки
	|					ИНАЧЕ ЦенаПартии.СебестоимостьЦена
	|				КОНЕЦ
	|		ИНАЧЕ ВТДанныеИПродажи.Себестоимость
	|	КОНЕЦ КАК СебестоимостьЦена
	|ИЗ
	|	ВТДанныеИПродажи КАК ВТДанныеИПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦенаПартии КАК ЦенаПартии
	|		ПО ВТДанныеИПродажи.Номенклатура = ЦенаПартии.Номенклатура
	|			И (ВТДанныеИПродажи.Себестоимость = 0)" );
	
	ЗапросСценами.УстановитьПараметр("Момент",Дата);
	ЗапросСценами.УстановитьПараметр("Ссылка",Ссылка);
	Выборка =  ЗапросСценами.Выполнить().Выбрать();
	Пока выборка.Следующий() цикл 
		СтрокиТоваров = Товары.НайтиСтроки(Новый Структура("Номенклатура",Выборка.Номенклатура));
		Для Каждого СтрокаТоваров из СтрокиТоваров цикл 
			ЗаполнитьЗначенияСвойств(СтрокаТоваров,Выборка,"СебестоимостьЦена,Себестоимость");
		КонецЦикла;				
	КонецЦикла;				
	
	
	
	
	
КонецПроцедуры	

Функция ПолучитьЗаписиПоследовательности(вхПоследовательность) Экспорт
	
	лМетаданныеПоследовательности = Неопределено;	
	Если (ТипЗнч(вхПоследовательность) = Тип("Строка")) тогда
		лМетаданныеПоследовательности = Метаданные.Последовательности.Найти(вхПоследовательность);
	ИначеЕсли (ТипЗнч(вхПоследовательность) = Тип("ОбъектМетаданных")) И Метаданные.Последовательности.Содержит(вхПоследовательность) тогда
		лМетаданныеПоследовательности = вхПоследовательность;
	КонецЕсли;
	
	Если (лМетаданныеПоследовательности = Неопределено) тогда
		ВызватьИсключение "[ПолучитьДанныеДляПоследовательности]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лМетаданныеДокумента = Метаданные();
	Если НЕ лМетаданныеПоследовательности.Документы.Содержит(лМетаданныеДокумента) тогда
		ВызватьИсключение "[ПолучитьДанныеДляПоследовательности]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лЭтоОтменаПроведения = Ложь;
	лРежимЗаписи = Неопределено;
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("РежимЗаписи", лРежимЗаписи) тогда
		лЭтоОтменаПроведения = (лРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;
	
	лРезультат = ОбщегоНазначения.СоздатьСтруктуруПоследовательности(лМетаданныеПоследовательности);
	Если (лМетаданныеПоследовательности = Метаданные.Последовательности.ПоРасчетамСКонтрагентами) тогда
		Если НЕ лЭтоОтменаПроведения И (ЭтотОбъект.СуммаДокумента <> 0) И ЭтотОбъект.Дата >= ПараметрыСеанса.ДатаНачалаРаботыВзаиморасчеты Тогда
			лСтрокаРезультат = лРезультат.Добавить();
			лСтрокаРезультат.ДоговорКонтрагента = ЭтотОбъект.ДоговорКонтрагента;
			лСтрокаРезультат.Период = ЭтотОбъект.Дата;
			лСтрокаРезультат.Регистратор = ЭтотОбъект.Ссылка;
		КонецЕсли;
		
		Результат = ПроведениеДокументовКлиентСервер.ПолучитьМоментыВремени(лМетаданныеПоследовательности, лРезультат);
		
	Иначе
		
		ВызватьИсключение "[ПолучитьЗаписиПоследовательности]: неправильный параметр номер 1.";
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьТекстЗапроса(ГУИД_Документа)
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_СформироватьТекстЗапроса";
	лЗамена = АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено; 
		Выполнить(лЗамена); 
		Возврат АлгоритмыЗначениеВозврата; 
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////"
	
	ТекстЗапроса = 
	"select
	|	g2.[_Id] as СсылкаНаРеализацию
	|from
	|	[Work_P1C].[dbo].[adoURBD_Guids] as g1
	|	inner join DH1656 as d on g1.[_Object] = d.IDDOC
	|	inner join [Work_P1C].[dbo].[adoURBD_Guids] as g2 on right(d.SP1633, 9) = g2.[_Object]
	|	
	|where
	|	(g1.[_MetaType] = 12) and (g1.[_MetaId] = 1656) and (g1.[_Id] = '" + ГУИД_Документа + "')
	|	and (left(d.SP1633, 4) = ' 18R')
	|	and (g2.[_MetaType] = 12) and (g2.[_MetaId] = 1611)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПодключитьсяКБазеСемерки(ГУИД_Документа) 
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПодключитьсяКБазеСемерки";
	лЗамена = АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено; 
		Выполнить(лЗамена); 
		Возврат АлгоритмыЗначениеВозврата; 
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////"
	СсылкаНаРеализацию = Неопределено;
	
	стрПодключения = "Provider=SQLOLEDB;Data Source=1CSQL01-G9;Initial Catalog=Work_P1C;Integrated Security=SSPI";
	
	Попытка
		Connection = Новый COMОбъект("ADODB.Connection");
		Connection.ConnectionString = стрПодключения;
		Connection.ConnectionTimeOut = 15;
		
		Connection.Open(Connection.ConnectionString);
		
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат СсылкаНаРеализацию;
		
	КонецПопытки;
	
	RS = Новый COMОбъект("ADODB.Recordset");
	
	RS.Open(СформироватьТекстЗапроса(ГУИД_Документа), Connection);
	
	Пока RS.EOF() = 0 Цикл
		СсылкаНаРеализацию = RS.Fields("СсылкаНаРеализацию").Value;
		
		RS.MoveNext();
		
	КонецЦикла;
	
	RS.Close();
	Connection.Close(); 
	
	Возврат СсылкаНаРеализацию;
	
КонецФункции

Процедура УстановитьКонтрагентаВзаиморасчетов() Экспорт
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_УстановитьКонтрагентаВзаиморасчетов";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	//Если ЗначениеЗаполнено(Контрагент.ГоловнойКонтрагент) И Контрагент.ГоловнойКонтрагент <> Контрагент Тогда
		ДоговорКонтрагентаВзаиморасчетов = ДоговорВзаиморасчетов(ДоговорКонтрагента);
		КонтрагентВзаиморасчетов = ДоговорКонтрагентаВзаиморасчетов.Владелец;
	//Иначе
	//	КонтрагентВзаиморасчетов = Контрагент;
	//	ДоговорКонтрагентаВзаиморасчетов = ПолучитьОсновнойДоговор(ДоговорКонтрагента);
	//КонецЕсли;
	
КонецПроцедуры

Функция ДоговорВзаиморасчетов(Договор)
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ДоговорВзаиморасчетов";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	
	ОсновнойДоговор = ПолучитьОсновнойДоговор(Договор);
	ДоговорВзаиморасчетов = ОсновнойДоговор;
	
	//Убрано согласно http://jira.part-kom.ru/browse/XX-1749 пункт 17.2
	//Если ЗначениеЗаполнено(ДокументОснование) Тогда 
	//	
	//	РеквизитыРТУ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, 
	//	"ДоговорКонтрагента,ДоговорКонтрагентаВзаиморасчетов,ДоговорКонтрагентаВзаиморасчетов.СлужебныйДоговор,ДоговорКонтрагента.СлужебныйДоговор,ДоговорКонтрагента.ДоговорПриостановлен,ДоговорКонтрагента.ВидОплаты");	
	//	
	//	Если ЗначениеЗаполнено(РеквизитыРТУ.ДоговорКонтрагентаВзаиморасчетов) 
	//		И Не РеквизитыРТУ.ДоговорКонтрагентаВзаиморасчетовСлужебныйДоговор Тогда 
	//		ДоговорВзаиморасчетов = РеквизитыРТУ.ДоговорКонтрагентаВзаиморасчетов;
	//	ИначеЕсли ЗначениеЗаполнено(РеквизитыРТУ.ДоговорКонтрагента) 
	//		И  Не РеквизитыРТУ.ДоговорКонтрагентаСлужебныйДоговор Тогда 
	//		ДоговорВзаиморасчетов = РеквизитыРТУ.ДоговорКонтрагента;
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
	РеквизитыДоговораВзаиморасчетов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,"ДоговорПриостановлен,ВидОплаты");	
	РеквизитыОсновногоВозврата 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОсновнойДоговор,"ДоговорПриостановлен,ВидОплаты");
	
	//ХудинВВ 31012019
	//http://jira.part-kom.ru/browse/XX-1749
	//если договор приостановлен и имел вид оплаты - наличная, 
	//и у этого контрагента указан текущий договор с видом оплаты - наличная, 
	//то в договоре взаиморасчетов в возврате указывать текущий договор.
	Если РеквизитыДоговораВзаиморасчетов.ДоговорПриостановлен = Истина
		И РеквизитыДоговораВзаиморасчетов.ВидОплаты = Перечисления.ВидыДенежныхСредств.Наличные
		И РеквизитыОсновногоВозврата.ВидОплаты = Перечисления.ВидыДенежныхСредств.Наличные Тогда
		ДоговорВзаиморасчетов = ОсновнойДоговор;
	КонецЕсли;

	
	Возврат ДоговорВзаиморасчетов;
	
КонецФункции

Функция  ПолучитьОсновнойДоговор(Договор)
	Перем ГоловнойКонтрагент, ОсновнойДоговорКонтрагента, текКонтрагент;
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПолучитьОсновнойДоговор";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	текКонтрагент = Договор.Владелец;
	ГоловнойКонтрагент = текКонтрагент.ГоловнойКонтрагент;
	
	ДоговорВзаиморасчетов = Договор;
	// 19.07.19 Строганов Роман > Раскоментировано в рамках задачи XX-2987
	Если текКонтрагент <> ГоловнойКонтрагент И ЗначениеЗаполнено(ГоловнойКонтрагент) Тогда
	// 19.07.19 Строганов Роман < Раскоментировано в рамках задачи XX-2987
		ОсновнойДоговорКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ГоловнойКонтрагент, "ОсновнойДоговорКонтрагента");
		Если ЗначениеЗаполнено(ОсновнойДоговорКонтрагента) Тогда
			ДоговорВзаиморасчетов = ОсновнойДоговорКонтрагента;
		КонецЕсли;
	КонецЕсли;
	
	Возврат  ДоговорВзаиморасчетов;
	
КонецФункции

Процедура ПересчитатьСуммуТабличнойЧасти() Экспорт
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПересчитатьСуммуТабличнойЧасти";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Для каждого СтрокаТабличнойЧасти Из Товары Цикл
		ПересчитатьСуммуСтрокиТабличнойЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
		ОбработкаТабличныхЧастей.РассчитатьСуммуНДСТабЧасти(СтрокаТабличнойЧасти, ЭтотОбъект);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПересчитатьСуммуСтрокиТабличнойЧасти(СтрокаТабличнойЧасти, ОбъектДокумента) Экспорт
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ПересчитатьСуммуСтрокиТабличнойЧасти";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	ИмяПоляКоличества = "Количество";
	Если ЗначениеЗаполнено(ОбъектДокумента.АктРассмотренияВозврата)
		И ОбъектДокумента.СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяНовый Тогда
		ИмяПоляКоличества = "КоличествоПлан";
	КонецЕсли;
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти[ИмяПоляКоличества] * СтрокаТабличнойЧасти.Цена;
	
КонецПроцедуры

#КонецОбласти

Функция ВсеПринятоеКоличествоРазмещено() Экспорт
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ВсеПринятоеКоличествоРазмещено";
	лЗамена = АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено; 
		Выполнить(лЗамена); 
		Возврат АлгоритмыЗначениеВозврата; 
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////"
	
	ВсеПринятоеКоличествоРазмещено = Истина;
	Для каждого СтрокаТЧ Из Товары Цикл
		
		Если СтрокаТЧ.Количество <> СтрокаТЧ.КоличествоРазмещено Тогда
			ВсеПринятоеКоличествоРазмещено = Ложь;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВсеПринятоеКоличествоРазмещено;
	
КонецФункции

Процедура ЗаполнитьРазмещенноеКоличество(ТекстОшибки = "", СообщатьОбОшибке = Истина) Экспорт
	
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ЗаполнитьРазмещенноеКоличество";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РазмещениеТоваровОбороты.Номенклатура,
		|	РазмещениеТоваровОбороты.Качество,
		|	РазмещениеТоваровОбороты.КоличествоОборот КАК Количество
		|ИЗ
		|	РегистрНакопления.РазмещениеТоваров.Обороты(, , , ДокументОснование = &ДокументОснование) КАК РазмещениеТоваровОбороты";
	
	Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаОстатков = РезультатЗапроса.Выгрузить();
	
	лТекстОшибки = "";
	СтруктураОтбора = Новый Структура("Номенклатура, Качество");
	
	ИмяПоляКоличества = ?(СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяНовый, "КоличествоПлан", "Количество");
	Для каждого СтрокаТЧ Из Товары Цикл
		
		СтрокаТЧ.КоличествоРазмещено = 0;
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаТЧ);
		СтрокиОстатков = ТаблицаОстатков.НайтиСтроки(СтруктураОтбора);
		
		Размещено = 0;
		Если СтрокиОстатков.Количество() Тогда
			Размещено = СтрокиОстатков[0].Количество;			
		КонецЕсли;
		
		Если Размещено <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Списать = Мин(Размещено, СтрокаТЧ[ИмяПоляКоличества]);
		
		СтрокаТЧ.КоличествоРазмещено = Списать;
		СтрокиОстатков[0].Количество = СтрокиОстатков[0].Количество - Списать;
		
	КонецЦикла;
	
	//Излишки размещения кинем на первую попавшуюся партию
	Для каждого СтрокаОстатков Из ТаблицаОстатков Цикл
		
		Если СтрокаОстатков.Количество <= 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, СтрокаОстатков);
	    СтрокиТоваров =  Товары.НайтиСтроки(СтруктураОтбора);
		Если СтрокиТоваров.Количество() Тогда
	       СтрокиТоваров[0].КоличествоРазмещено = СтрокиТоваров[0].КоличествоРазмещено + СтрокаОстатков.Количество;
		Иначе
			//Размещена строка, которой нет в документе возврата от покупателя
			лТекстОшибки = "В документе возврата отсутствует размещенная строка:
							| Номенклатура: "+СтрокаОстатков.Номенклатура+", Качество: "+СтрокаОстатков.Качество+", Строка заявки: "+СтрокаОстатков.СтрокаЗаявки+", Количество: "+СтрокаОстатков.Количество;
			
		КонецЕсли;
	
	КонецЦикла;
	
	//Если Разместили, то считаем что приняли
	Для каждого СтрокаТЧ Из Товары Цикл
		Если СтрокаТЧ.КоличествоРазмещено > 0 И СтрокаТЧ.Количество = 0 Тогда
			СтрокаТЧ.Количество = СтрокаТЧ.КоличествоРазмещено;
		КонецЕсли;
	КонецЦикла;
	
	
	ТекстОшибки = ТекстОшибки + ?(ЗначениеЗаполнено(ТекстОшибки), Символы.ПС, "") + лТекстОшибки;
	
	Если СообщатьОбОшибке и ЗначениеЗаполнено(лТекстОшибки) Тогда
		 Сообщить(ТекстОшибки, СтатусСообщения.Важное);		
	КонецЕсли;
	
	
КонецПроцедуры

#Область Обмены

//ХудинВВ 12032019 XX-1646
Функция ВыгрузитьВОбменТоплог() Экспорт
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_МодульОбъекта_ВыгрузитьВОбменТоплог";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	СтруктураВозврата = Новый Структура;
	
	Ошибка = Ложь;
	СообщениеДиагностики = "";
	
	//Проверки
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	Если Не Проведен Тогда	
		СообщениеДиагностики = СообщениеДиагностики + "Документ не проведен." + Символы.ПС;	
		Ошибка = Истина;
	КонецЕсли;
	
	Если Модифицированность() Тогда 
		СообщениеДиагностики = СообщениеДиагностики + "Нужно записать документ" + Символы.ПС;	
		Ошибка = Истина;
	КонецЕсли;
		
	Если Склад.ФизическийСклад.ОбменСTopLog = Ложь	Тогда	
		СообщениеДиагностики = СообщениеДиагностики + "У склада в документе не установлен флаг ""Обмен с Топлог""." + Символы.ПС;	
		Ошибка = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(АктРассмотренияВозврата)	Тогда	
		СообщениеДиагностики = СообщениеДиагностики + "Должен быть заполнен акт рассмотрения возврата" + Символы.ПС;	
		Ошибка = Истина;
	КонецЕсли;
	
	Если Не СтатусДокумента = Справочники.СтатусыДокументов.ВозвратТоваровОтПокупателяНовый	Тогда	
		СообщениеДиагностики = СообщениеДиагностики + "Документы выгружаются только в статусе ""Новый""" + Символы.ПС;	
		Ошибка = Истина;
	КонецЕсли;
	
	Если флНеВыгружатьВТопЛог Тогда
		СообщениеДиагностики = СообщениеДиагностики + "У документа установлен признак ""Не выгружать в топлог""" + Символы.ПС;	
		Ошибка = Истина;
	КонецЕсли;
	
	Узел = ОбменДаннымиКлиентСервер.ПолучитьИсходящийУзелОбмена(Метаданные.ПланыОбмена.ОбменПартКом83_TopLog, 3);
	Если НЕ ЗначениеЗаполнено(Узел) Тогда 
		СообщениеДиагностики = СообщениеДиагностики + "Не найден узел обмена для выгрузки в Топлог." + Символы.ПС;
		Ошибка = Истина;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Если Ошибка = Ложь Тогда  
		ОбменДаннымиКлиентСервер.ЗарегистрироватьИзмененияВПланеОбмена(Узел, Ссылка);
		СообщениеДиагностики = СообщениеДиагностики + "Документ зарегистрирован в обмене с Топ Лог";		
	Иначе
		СообщениеДиагностики = "Не удалось зарегистрировать документ в обмене с Топлог, по причине:" + Символы.ПС + СообщениеДиагностики;
	КонецЕсли;
	
	СтруктураВозврата.Вставить("Ошибка", Ошибка);
	СтруктураВозврата.Вставить("СообщениеДиагностики", СообщениеДиагностики);
	
	Возврат СтруктураВозврата;
	
КонецФункции

#КонецОбласти

мМенеджерОбъекта = Документы[Метаданные().Имя];
