//// ОБРАБОТЧИКИ МОДУЛЯ ОБЪЕКТА

Процедура ВыполнитьПроведение(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "Продажи") тогда
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "Продажи", РегистрыНакопления_Продажи(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьОтменуПроведения(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	ПроведениеДокументовКлиентСервер.ОчиститьДвиженияДокумента(вхСсылкаНаДокумент);
	
КонецПроцедуры

Функция РегистрыНакопления_Продажи(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("Продажи", ТаблицаДвижений);
	
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВводНачальныхДанныхПоПродажамТовары.Ссылка.Склад,
	                      |	ВводНачальныхДанныхПоПродажамТовары.Номенклатура,
	                      |	ВводНачальныхДанныхПоПродажамТовары.Качество,
	                      |	ВводНачальныхДанныхПоПродажамТовары.СтрокаЗаявки,
	                      |	ВводНачальныхДанныхПоПродажамТовары.ТорговаяТочка,
	                      |	ВводНачальныхДанныхПоПродажамТовары.Количество,
	                      |	ВводНачальныхДанныхПоПродажамТовары.СуммаРегл КАК СуммаРегл,
	                      |	ВводНачальныхДанныхПоПродажамТовары.СуммаУпр КАК СуммаУпр,
	                      |	ВводНачальныхДанныхПоПродажамТовары.КоличествоВозврат,
	                      |	ВводНачальныхДанныхПоПродажамТовары.СуммаРеглВозврат КАК СуммаРеглВозврат,
	                      |	ВводНачальныхДанныхПоПродажамТовары.СуммаУпрВозврат КАК СуммаУпрВозврат,
	                      |	ВводНачальныхДанныхПоПродажамТовары.Ссылка КАК Регистратор,
	                      |	ВводНачальныхДанныхПоПродажамТовары.Ссылка.Дата КАК Период
	                      |ИЗ
	                      |	Документ.ВводНачальныхДанныхПоПродажам.Товары КАК ВводНачальныхДанныхПоПродажамТовары
	                      |ГДЕ
	                      |	ВводНачальныхДанныхПоПродажамТовары.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);
	
	Возврат ТаблицаДвижений;
	
КонецФункции

