
Процедура Добавить(Объект, НомерСообщения, ЕстьОшибки = Ложь, ОписаниеОшибки = "", Период = Неопределено, Исходящее = Истина) Экспорт
	
	МЗ = РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.СоздатьМенеджерЗаписи();
	МЗ.Объект  			= Объект;
	МЗ.НомерСообщения 	= НомерСообщения;
	МЗ.ЕстьОшибки 		= ЕстьОшибки;
	МЗ.ОписаниеОшибки 	= ОписаниеОшибки;
	МЗ.Исходящее 		= Исходящее;
	МЗ.Период    		= ?(Не ЗначениеЗаполнено(Период), ТекущаяДата(), Период);
	
	Если Не ЗначениеЗаполнено(МЗ.Объект) Тогда
		Возврат;
	КонецЕсли;
	
	МЗ.Записать();	
	
КонецПроцедуры

