
Процедура Добавить(Объект, НомерСообщения, ЕстьОшибки = Ложь, ОписаниеОшибки = "", Период = Неопределено, Исходящее = Истина) Экспорт
	
	МЗ = РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.СоздатьМенеджерЗаписи();
	МЗ.Объект  			= Объект;
	МЗ.НомерСообщения 	= НомерСообщения;
	МЗ.ЕстьОшибки 		= ЕстьОшибки;
	МЗ.ОписаниеОшибки 	= ОписаниеОшибки;
	МЗ.Исходящее 		= Исходящее;
	МЗ.Период    		= ?(Не ЗначениеЗаполнено(Период), ТекущаяДата(), Период);
	
	Если Не ЗначениеЗаполнено(МЗ.Объект) Тогда
		Возврат;
	КонецЕсли;
	
	МЗ.Записать();	
	
КонецПроцедуры

Функция ТекстСообщения(НомерСообщения, Период) Экспорт
	
	Сообщение = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияОбменаСТопЛог.Сообщение
		|ИЗ
		|	РегистрСведений.ИсторияОбменаСТопЛог КАК ИсторияОбменаСТопЛог
		|ГДЕ
		|	ИсторияОбменаСТопЛог.НомерСообщения = &НомерСообщения
		|	И НачалоПериода(ИсторияОбменаСТопЛог.ДатаЗагрузкиСообщения, День) = &ДатаЗагрузкиСообщения";
	
	Запрос.УстановитьПараметр("ДатаЗагрузкиСообщения", НачалоДня(Период));
	Запрос.УстановитьПараметр("НомерСообщения", НомерСообщения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Сообщение = Выборка.Сообщение;
	КонецЕсли;

	Возврат Сообщение;
	
КонецФункции