&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список = УправлениеПользователями.ПолучитьЗначениеПраваДляТекущегоПользователя(ПланыВидовХарактеристик.ПраваПользователей.ДоступКОбработкеМассРассылки, Ложь);
	
	Если Не РольДоступна("ПолныеПрава") И Не (Список.Количество() = 1 И Список.Получить(0).Значение = Истина) Тогда 
		Сообщить("Нет прав на открытие обработки");
		Отказ = Истина;
	КонецЕсли;
	ЗаполнитьОрганизации();
КонецПроцедуры

&НаСервере 
Процедура ЗаполнитьОрганизации()
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	Организации.Ссылка
	                |ИЗ
	                |	Справочник.Организации КАК Организации";
	СписокОрганизаций.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.НачалоПериода = Период.ДатаНачала;
	Объект.КонецПериода = КонецДня(Период.ДатаОкончания);	
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьВидимостьДоступность()
	Элементы.СтараяОрганизация.Видимость = Объект.СтараяОрганизацияТребуется;
КонецПроцедуры

&НаКлиенте
Процедура РазослатьАктыСверок(Команда)
	ПеренестиДанныеИзФормыВОбъект();
	Если ПроверитьЗаполнение() Тогда 
		Объект.Адрес = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		
		РазослатьАктыСверокНаСервере();
		Если ЭтоАдресВременногоХранилища(Объект.Адрес) Тогда 
			ТабДок = ПолучитьИзВременногоХранилища(Объект.Адрес);
			ТабДок.Показать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура РазослатьАктыСверокНаСервере()
	РеквизитФормыВЗначение("Объект").ВыполнитьРассылку();
КонецПроцедуры

&НаКлиенте 
Процедура ПеренестиДанныеИзФормыВОбъект()
	Объект.Организации.Очистить();
	Для Каждого Стр Из СписокОрганизаций Цикл 
		Если Стр.Пометка Тогда 
			Объект.Организации.Добавить().Организация = Стр.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Объект.ВыгружатьЕслиНетДолгов = НаличиеДолга = 0;
	//Объект.ТолькоПриостановленные = ВидДоговора = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура СтараяОрганизацияТребуетсяПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
КонецПроцедуры

