Процедура Добавить(ДокументСсылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДокументыКОбновлениюКоличестваРазмещения.Документ
		|ИЗ
		|	РегистрСведений.ДокументыКОбновлениюКоличестваРазмещения КАК ДокументыКОбновлениюКоличестваРазмещения
		|ГДЕ
		|	ДокументыКОбновлениюКоличестваРазмещения.Документ = &Документ";
	
	Запрос.УстановитьПараметр("Документ", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МЗ = РегистрыСведений.ДокументыКОбновлениюКоличестваРазмещения.СоздатьМенеджерЗаписи();
	МЗ.Документ = ДокументСсылка;
	Если ЗначениеЗаполнено(МЗ.Документ) Тогда
		МЗ.Записать();
	КонецЕсли;	
	
КонецПроцедуры