
#Область АктРассмотренияВозврата 

Функция СтатусыКРО() Экспорт
	
	лКлючАлгоритма = "Справочник_СтатусыДокументов_МодульМенеджера_СтатусыКРО";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	СтатусыКРО = Новый Массив;
	СтатусыКРО.Добавить(Справочники.СтатусыДокументов.АРВ_КРООтказ);
	СтатусыКРО.Добавить(Справочники.СтатусыДокументов.АРВ_КРОРасследование);

	Возврат СтатусыКРО;	
	
КонецФункции

Функция ЭтоСтатусКРО(Статус) Экспорт
	
	лКлючАлгоритма = "Справочник_СтатусыДокументов_МодульМенеджера_ЭтоСтатусКРО";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	СтатусыКРО = СтатусыКРО();
	
	Возврат СтатусыКРО.Найти(Статус) <> Неопределено;
	
КонецФункции
	
#КонецОбласти