Перем мЗарегистрироватьИзмененияДляСайта;

Процедура ПриЗаписи(Отказ)
	
	Если мЗарегистрироватьИзмененияДляСайта тогда
		ПланОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_Сайт;
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланОбмена, "Справочник.ПрайсыПоставщиков.МодульОбъекта.ПриЗаписи"); //Семенов И.П. 31.01.2019 XX-1768
		Если ТипЗнч(ЭтотОбъект.Владелец) = Тип("СправочникСсылка.ТорговыеТочки") Тогда
			ЗарегистрироватьПоставщика(ЭтотОбъект.Владелец.Владелец, ПланОбмена);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: ПрайсыПоставщиков", Ложь) Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, Метаданные.ПланыОбмена.ОбменПартКом83_Сайт, "Справочник.ПрайсыПоставщиков.МодульОбъекта.ПередУдалением"); //Семенов И.П. 31.01.2019 XX-1768
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Для А = 1 По СтрДлина(Код) Цикл
		Если Лев(Код, 1) = "0" Тогда
			Код = Прав(Код, СтрДлина(Код) - 1);
		Иначе
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: ПрайсыПоставщиков", Ложь) Тогда
		мЗарегистрироватьИзмененияДляСайта = ОбменДаннымиКлиентСервер.НеобходимаРегистрацияИзменений(Метаданные.ПланыОбмена.ОбменПартКом83_Сайт, ЭтотОбъект);	
	КонецЕсли;
	
	Если ЭтоНовый() И ЭтоГруппа Тогда
		УстановитьНовыйКод("Г");
	КонецЕсли;
	Если РольДоступна("ПрайсыЧтение") И НЕ РольДоступна("ПолныеПрава") Тогда 
		Отказ=Истина;
		Сообщить("У вас нет прав на редактирование прайсов поставщика!");
	КонецЕсли;	
	
КонецПроцедуры


Процедура ЗарегистрироватьПоставщика(Контрагент, ПланОбмена)
	
	//PaSe - лучше добавить метод менеджера спр. "Контрагенты"//
	ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъектВУзлах(Контрагент, ПланОбмена,,, "Справочник.ПрайсыПоставщиков.МодульОбъекта.ЗарегистрироватьПоставщика"); //Семенов И.П. 31.01.2019 XX-1768
	
КонецПроцедуры

мЗарегистрироватьИзмененияДляСайта = Ложь;

