
Процедура ПередЗаписью(Отказ, Замещение)
	
	//Регистрируем контрагентов к обмену на сайт//
	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: Контрагенты", Ложь) И НЕ ОбменДанными.Загрузка Тогда
		Узел = ОбменДаннымиКлиентСервер.ПолучитьИсходящийУзелОбмена(Метаданные.ПланыОбмена.ОбменПартКом83_Сайт, 2);
		Для Каждого Запись Из ЭтотОбъект Цикл
			Если ЗначениеЗаполнено(Запись.Объект) И ТипЗнч(Запись.Объект) = Тип("СправочникСсылка.Контрагенты") Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(Узел, Запись.Объект);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли
	
КонецПроцедуры
