Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	ПолучениеЭлектронныхСообщений();
	
КонецПроцедуры

Процедура ПолучениеЭлектронныхСообщений() Экспорт
	
	лКлючАлгоритма = "Обработка_АвтополучениеПочты_МодульОбъекта_ПолучениеЭлектронныхСообщений";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	
	//ТекстЗапроса = 
	//"ВЫБРАТЬ
	//|	УчетныеЗаписиЭлектроннойПочты.Ссылка
	//|ИЗ
	//|	Справочник.УчетныеЗаписиЭлектроннойПочты КАК УчетныеЗаписиЭлектроннойПочты
	//|ГДЕ
	//|	УчетныеЗаписиЭлектроннойПочты.АвтоПолучениеОтправкаСообщений";
	//Запрос = Новый Запрос;
	//Запрос.Текст = ТекстЗапроса;
	//Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	//Не будем брать все учетные записи, мало ли кто там поставит галку, возьмем только определенные
	УчетныеЗаписиДляПроверки = Новый Массив;
	УчетныеЗаписиДляПроверки.Добавить(ВозвратыОтПокупателяСервер.УчетнаяЗаписьЭлектроннойПочтыВозвраты());
	//Пока Выборка.Следующий() Цикл
	//	УчетныеЗаписиДляПроверки.Добавить(Выборка.Ссылка);
	//КонецЦикла;
	
	ТекстОшибок = "";
	УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(Неопределено, Справочники.Пользователи.ПустаяСсылка(),УчетныеЗаписиДляПроверки,,, Истина, Ложь, ТекстОшибок);
	
	Если НЕ ПустаяСтрока(ТекстОшибок) Тогда
		ЗаписьЖурналаРегистрации("Получение электронных сообщений", 
		УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.ЭлектронноеПисьмо, ,
		"Получение электронных сообщений выполнено с ошибками:" + Символы.ПС + ТекстОшибок);
	КонецЕсли; 
	
КонецПроцедуры
