Процедура СоздатьРеализации() Экспорт
	
	Если Модифицированность() Тогда
		
		Записать(РежимЗаписиДокумента.Запись);
		
	КонецЕсли;
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ДокументОснование", Ссылка);
	СтруктураПараметров.Вставить("Склад", Склад);
	СтруктураПараметров.Вставить("Контрагент");
	
	Для Каждого ТекСтрока Из Покупатели Цикл
		
		ДокументРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		
		СтруктураПараметров.Контрагент = ТекСтрока.Контрагент;
		ДокументРеализации.Заполнить(СтруктураПараметров);
		ДокументРеализации.Записать(РежимЗаписиДокумента.Проведение);
		
		ТекСтрока.Реализация = ДокументРеализации.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	лКлючАлгоритма = "Документ_СлужебноеЗадание_МодульОбъекта_ПередЗаписью";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
		
	Если ПометкаУдаления Тогда
		
		Для Каждого ТекСтрока Из Покупатели Цикл
			
			ОбъектРеализация = ТекСтрока.Реализация.ПолучитьОбъект();
			ОбъектРеализация.ПометкаУдаления = Истина;
			Если ОбъектРеализация.Проведен Тогда
				обРежим = РежимЗаписиДокумента.ОтменаПроведения;
			Иначе
				обРежим = РежимЗаписиДокумента.Запись;
			КонецЕсли;
			
			Попытка
				ОбъектРеализация.Записать(обРежим);
			Исключение
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЭтоНовый() И Не ЗначениеЗаполнено(СтатусДокумента) Тогда 
		СтатусДокумента = Справочники.СтатусыДокументов.СлужебноеЗаданиеИдетСборка;
	КонецЕсли;
	//+ Валиахметов http://jira.part-kom.ru/browse/XX-2238 17.04.2019
	_ДатаОтгрузки = Дата(Год(ДатаОтгрузки), Месяц(ДатаОтгрузки), День(ДатаОтгрузки), Час(ВремяОтгрузки), Минута(ВремяОтгрузки), Секунда(ВремяОтгрузки));
	ДатаОтгрузки_Региональное = ПроверкаРазницыВремени.ПолучитьРегиональноеВремя(_ДатаОтгрузки, Склад);
	//- Валиахметов http://jira.part-kom.ru/browse/XX-2238 17.04.2019
КонецПроцедуры

