
Функция ПолучитьРегламентноеЗадание() Экспорт
	
	Результат = Неопределено;
	Если ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) тогда
		Результат = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Если НЕ ЭтоНовый() И (ПометкаУдаления <> Ссылка.ПометкаУдаления) И ПометкаУдаления тогда
		// установили пометку на удаление, нужно снять Использование
		лРегламентноеЗадание = ПолучитьРегламентноеЗадание();
		Если (лРегламентноеЗадание <> Неопределено) тогда
			лРегламентноеЗадание.Использование = Ложь;
			лРегламентноеЗадание.Записать();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	лРегламентноеЗадание = ПолучитьРегламентноеЗадание();
	Если (лРегламентноеЗадание <> Неопределено) тогда
		лРегламентноеЗадание.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторРегламентногоЗадания = Неопределено;
КонецПроцедуры



	
