Функция ПричиныВозвратаВерхнегоУровня() Экспорт
	
	Возврат ПодчиненныеПричиныВозврата(Справочники.ПричиныВозврата.ПустаяСсылка());
	
КонецФункции

Функция ПодчиненныеПричиныВозврата(ПричинаВозврата) Экспорт
	
	СписокПричиин = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПричиныВозврата.Ссылка,
		|	ПричиныВозврата.Наименование
		|ИЗ
		|	Справочник.ПричиныВозврата КАК ПричиныВозврата
		|ГДЕ
		|	ПричиныВозврата.Родитель = &Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПричиныВозврата.Код";
	
	Запрос.УстановитьПараметр("Родитель", ПричинаВозврата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СписокПричиин.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
	Возврат СписокПричиин;
	
КонецФункции