Процедура ИзменитьМХ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ " + Формат(?(РазмерПакета > 0, РазмерПакета, 100),"ЧЦ=5; ЧДЦ=0; ЧГ=0") + "
	|	МегаЛогист_МаршрутноеЗадание.Ссылка
	|ИЗ
	|	Документ.МегаЛогист_МаршрутноеЗадание КАК МегаЛогист_МаршрутноеЗадание
	|ГДЕ
	|	МегаЛогист_МаршрутноеЗадание.Дата < НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -&Глубина), ДЕНЬ)
	|	И МегаЛогист_МаршрутноеЗадание.Статус = ЗНАЧЕНИЕ(Перечисление.МегаЛогист_СтатусыМаршрутныхЗаданий.КРаспределению)
	|	И МегаЛогист_МаршрутноеЗадание.Проведен = ИСТИНА
	|УПОРЯДОЧИТЬ ПО
	|	МегаЛогист_МаршрутноеЗадание.Дата";

	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	Запрос.УстановитьПараметр("Глубина", ?(Глубина > 0, Глубина, 5));
	Выборка = Запрос.Выполнить().Выбрать();
	
	сч = 0;
	Пока Выборка.Следующий() Цикл
		
		сч = сч + 1;
		лстр = СокрЛП(СокрЛП(сч) + ". " + Выборка.Ссылка);
		лerr = "";
		
		Если Тест = Ложь Тогда
			
			Отказ = Ложь;
			Попытка
				//МегаЛогист_УправлениеДоставкой.УстановитьСтатусМаршрутногоЗадания(Выборка.Ссылка, Перечисления.МегаЛогист_СтатусыМаршрутныхЗаданий.Отменен, Отказ);
				//Оповестить("ИзмененСтатусМЗ",Выборка.Ссылка);
				
				тДок = Выборка.Ссылка.ПолучитьОбъект();
				тДок.ДополнительныеСвойства.Вставить("СнятьОграничениеПоДатеЗапрета");
				тДок.ДополнительныеСвойства.Вставить("РежимБога");
				тДок.Статус = Перечисления.МегаЛогист_СтатусыМаршрутныхЗаданий.Отменен;
				тДок.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
			    лerr = ОписаниеОшибки();
				Отказ = Истина;
			КонецПопытки;
			
			Если ЗначениеЗаполнено(лerr) ИЛИ Отказ = Истина Тогда
				лстр = лстр + ". Ошибка изменения статуса: " + лerr; 
			КонецЕсли;
			
		КонецЕсли;
		
		Сообщить(лстр);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	ИзменитьМХ();

КонецПроцедуры
