
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СтатьиДвиженияДенежныхСредств.Ссылка,
	|	СтатьиДвиженияДенежныхСредств.ЭтоГруппа
	|ИЗ
	|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
	|ГДЕ
	|	СтатьиДвиженияДенежныхСредств.Ссылка <> &Ссылка
	|	И СтатьиДвиженияДенежныхСредств.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	ТабЗ = Запрос.Выполнить().Выгрузить();
	Если ТабЗ.Количество() > 0 Тогда
		ГруппаУжеЕсть = Ложь;
		Для Каждого Стр Из ТабЗ Цикл
			Если Стр.ЭтоГруппа Тогда
				ГруппаУжеЕсть = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ЭтоГруппа Тогда
			Если ГруппаУжеЕсть Тогда
				#Если Клиент Тогда
					Сообщить("такая группа статей уже создана.");
				#КонецЕсли
				Отказ = Истина;
			КонецЕсли;
		Иначе
			Если НЕ ГруппаУжеЕсть Тогда
				#Если Клиент Тогда
					Сообщить("такая статья уже создана.");
				#КонецЕсли
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЭтотОбъект.Ссылка = Справочники.СтатьиДвиженияДенежныхСредств.СтатьяНеНайдена Тогда
		Если Наименование <> "!!!Статья не найдена" Тогда
			Наименование = "!!!Статья не найдена";
		КонецЕсли;
		Если ЦФОДляБюджета <> Справочники.ЦФОДляБюджета.ПустаяСсылка() Тогда
			ЦФОДляБюджета = Справочники.ЦФОДляБюджета.ПустаяСсылка();
		КонецЕсли;
		Если РегионДляБюджета <> Справочники.РегионыДляБюджета.ПустаяСсылка() Тогда
			РегионДляБюджета = Справочники.РегионыДляБюджета.ПустаяСсылка();
		КонецЕсли;
		Если ОбменДанными.Загрузка Тогда 
			//Семенов И.П. 31.01.2019 XX-1768(
			//ПланыОбмена.ЗарегистрироватьИзменения(ОбменДаннымиКлиентСервер.ПолучитьИсходящийУзелОбмена(Метаданные.ПланыОбмена.ОбменПартКом77_83, 1), ЭтотОбъект.Ссылка);
			ОбменДаннымиКлиентСервер.ЗарегистрироватьИзмененияВПланеОбмена(ОбменДаннымиКлиентСервер.ПолучитьИсходящийУзелОбмена(Метаданные.ПланыОбмена.ОбменПартКом77_83, 1), ЭтотОбъект.Ссылка);
			//)Семенов И.П.
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры
