Перем мМенеджерОбъекта;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого Товар Из Товары Цикл
		Товар.СостояниеПартии = Перечисления.СостоянияПартииТовараVMI.Поступил;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	лПараметры = Новый Структура;
	лПараметры.Вставить("ДанныеОбъекта", ЭтотОбъект.ДополнительныеСвойства);
	мМенеджерОбъекта.ВыполнитьПроведение(Ссылка, Отказ, лПараметры);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДокументОснование = Неопределено;
	
КонецПроцедуры

мМенеджерОбъекта = Документы[Метаданные().Имя];

