&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекущаяВерсия = СокрЛП(Метаданные.Версия);
	Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	
	Если Параметры.Свойство("ТекстПриОбновлении") Тогда
		ПараметрыОбновлений = Параметры;
	Иначе
		ПараметрыОбновлений = внЖурналРегистрации.ПолучитьСтруктуруОписанияОбновлений(Истина);
	КонецЕсли;
	
	Если ПараметрыОбновлений.КоличествоОбновлений > 0 Тогда
		// Есть другие версии
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаЕстьВерсии;            
		ХТМЛ = ПараметрыОбновлений.ТекстПриОбновлении;                        
		ДоступностьОбновлений = ?(ПараметрыОбновлений.КоличествоОбновлений = 1, "Доступно новое обновление!", "Доступны новые обновления!");
		Элементы.ДоступностьОбновлений.ЦветТекста = Новый Цвет(0, 150, 70);
	Иначе
		// Текущая версия последняя
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПоследняяВерсия;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСайт(ИмяСайта)
	
	внЖурналРегистрацииКлиент.ЗапуститьПриложениеПользователю(ИмяСайта);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСайт(Команда)
	
	ОткрытьСайт("http://www.softonit.ru");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьХТМЛ(Адрес)
	
	ХТМЛ = Адрес;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВерсииПриАктивизацииСтроки(Элемент)
	Если Элементы.Версии.ТекущиеДанные = Неопределено Тогда
		Возврат;		
	КонецЕсли;
	
	ЗагрузитьХТМЛ(Элементы.Версии.ТекущиеДанные.Адрес);
КонецПроцедуры

&НаКлиенте
Процедура ПродлитьТехподдержкуИПолучениеОбновлений(Команда)
	
	ОткрытьСайт("http://softonit.ru/component/jshopping/category/view/3.html");
	
КонецПроцедуры

&НаКлиенте
Процедура СкачатьОбновления(Команда)
	
	ОткрытьСайт("http://softonit.ru/support/getupdates.html");
	
КонецПроцедуры
