&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВидСкидкиПриИзменении(Элемент)
	Если Объект.ВидСкидки = Перечисления.ВидыСкидок.БезОграниченияПоОбщейСумме Тогда 
		Объект.МаксимальнаяСуммаСкидки = 0;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Элементы.МаксимальнаяСуммаСкидки.Видимость = Объект.ВидСкидки = Перечисления.ВидыСкидок.СОграничениемПоОбщейСумме;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Форма = Справочники.Контрагенты.ПолучитьФормуВыбора(, Элемент);
	Форма.ВладелецФормы = Элемент;

	Форма.Отбор.ПоставщикVMI.Установить(Истина);
	Форма.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ПоставщикVMI.Доступность = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Форма.НачальноеЗначениеВыбора = Объект.Контрагент;
	КонецЕсли;
	
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокумента(Команда)
		
	ОткрытьФорму("Отчет.ОтчетПоДвижениямДокумента.Форма", Новый Структура("Документ,СпособВыводаОтчета", Объект.Ссылка, "ПоВертикали"));

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОВыборе(Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.Дата) Или Объект.Дата <> НачалоДня(Объект.Дата) Тогда 
		Ответ = Вопрос("Установить дату документа на начало дня?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда 
			Объект.Дата = НачалоДня(Объект.Дата);
		КонецЕсли;
	КонецЕсли;
	Если Объект.ДатаОкончания <> КонецДня(Объект.ДатаОкончания) Тогда 
		Ответ = Вопрос("Установить дату окончания на конец дня?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда 
			Объект.ДатаОкончания = КонецДня(Объект.ДатаОкончания);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Вставить содержимое обработчика
КонецПроцедуры

