&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВидСкидкиПриИзменении(Элемент)
	Если Объект.ВидСкидки = Перечисления.ВидыСкидок.БезОграниченияПоОбщейСумме Тогда 
		Объект.МаксимальнаяСуммаСкидки = 0;
	КонецЕсли;
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Элементы.МаксимальнаяСуммаСкидки.Видимость = Объект.ВидСкидки = Перечисления.ВидыСкидок.СОграничениемПоОбщейСумме;
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Форма = Справочники.Контрагенты.ПолучитьФормуВыбора(, Элемент);
	Форма.ВладелецФормы = Элемент;

	Форма.Отбор.ПоставщикVMI.Установить(Истина);
	Форма.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ПоставщикVMI.Доступность = Ложь;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Форма.НачальноеЗначениеВыбора = Объект.Контрагент;
	КонецЕсли;
	
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияДокумента(Команда)
		
	ОткрытьФорму("Отчет.ОтчетПоДвижениямДокумента.Форма", Новый Структура("Документ,СпособВыводаОтчета", Объект.Ссылка, "ПоВертикали"));

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОВыборе(Объект.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЕстьСкидка() Тогда 
		Сообщить("У предыдущей скидки не кончился срок действия. Новый документ создавать нельзя.");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЕстьСкидка()
	Если Не РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда 
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СкидкиПоставщиковVMIСрезПоследних.ВидСкидки,
	               |	СкидкиПоставщиковVMIСрезПоследних.ПроцентСкидки,
	               |	СкидкиПоставщиковVMIСрезПоследних.ДатаОкончания
	               |ИЗ
	               |	РегистрСведений.СкидкиПоставщиковVMI.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК СкидкиПоставщиковVMIСрезПоследних
	               |ГДЕ
	               |	СкидкиПоставщиковVMIСрезПоследних.ДатаОкончания >= &Дата";
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("Дата", ТекущаяДата());
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
КонецФункции