
&НаКлиенте
Процедура СтатусыПриАктивизацииСтроки(Элемент)
	
	ОбновитьОтображениеЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеЭлементов()
	
	ТекДанные = Элементы.Статусы.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ТаблицаОграниченияВзаимосвязей.ОтборСтрок = Новый ФиксированнаяСтруктура("Статус", ТекДанные.Статус);
	
	Если ТекДанные.РежимОграниченияВзаимосвязей = ПредопределенноеЗначение("Перечисление.РежимыОграниченияВзаимосвязейГруппДоступаКСтатусамПроцессаВозвратов.УказыватьЗапрещенные") Тогда
		ЗаголовокОграничения = "Запрещенные взаимосвязи";
	ИначеЕсли ТекДанные.РежимОграниченияВзаимосвязей = ПредопределенноеЗначение("Перечисление.РежимыОграниченияВзаимосвязейГруппДоступаКСтатусамПроцессаВозвратов.УказыватьРазрешенные") Тогда
		ЗаголовокОграничения = "Разрешенные взаимосвязи";
	Иначе
		ЗаголовокОграничения = "";
	КонецЕсли;
	Элементы.ТаблицаОграниченияВзаимосвязей.Заголовок = ЗаголовокОграничения;
	Элементы.ТаблицаОграниченияВзаимосвязей.Видимость = ЗначениеЗаполнено(ТекДанные.РежимОграниченияВзаимосвязей);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОграниченияВзаимосвязейПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Элементы.Статусы.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Статус = Элементы.Статусы.ТекущиеДанные.Статус;

	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Статус = Статус;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьКоличествоОграниченийПоСтатусам();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоОграниченийПоСтатусам(Статус = Неопределено)
	
	Для каждого СтрокаСтатусов Из Объект.Статусы Цикл
		
		Если НЕ Статус = Неопределено 
			И  СтрокаСтатусов.Статус <> Статус Тогда
			Продолжить;
		КонецЕсли;
		
		НайденныеСтроки = Объект.ТаблицаОграниченияВзаимосвязей.НайтиСтроки(Новый Структура("Статус", СтрокаСтатусов.Статус));
		
		СтрокаСтатусов.КоличествоОграничений = НайденныеСтроки.Количество();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОграниченияВзаимосвязейВзаимосвязьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Статус = Элементы.ТаблицаОграниченияВзаимосвязей.ТекущиеДанные.Статус;
	ДанныеВыбора = Справочники.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ДоступныеВзаимосвязиТекущегоСтатуса(Статус);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОграниченияВзаимосвязейВзаимосвязьОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Элементы.ТаблицаОграниченияВзаимосвязей.ТекущиеДанные.Взаимосвязь = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура СтатусыРежимОграниченияВзаимосвязейПриИзменении(Элемент)
	ОбновитьОтображениеЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОграниченияВзаимосвязейПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ЗаполнитьКоличествоОграниченийПоСтатусам();
КонецПроцедуры



