
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦеныНоменклатурыКонтрагентов
	Движения.ЦеныНоменклатурыКонтрагентов.Записывать = Истина;
	Движения.ЦеныНоменклатурыКонтрагентов.Очистить();
	Для Каждого ТекСтрокаТоварыПоставщика Из ТоварыПоставщика Цикл
		Движение = Движения.ЦеныНоменклатурыКонтрагентов.Добавить();
		Движение.Период = Дата;
		Движение.ПрайсПоставщика = ТекСтрокаТоварыПоставщика.ПрайсПоставщика;
		Движение.Номенклатура = ТекСтрокаТоварыПоставщика.Номенклатура;
		Движение.Валюта = ТекСтрокаТоварыПоставщика.Валюта;
		Движение.Цена = ТекСтрокаТоварыПоставщика.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
