

Функция ОстаткиБрендовНаСайте(КодПрайса) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
		|	vsm_sklad.source_maker КАК ИзготовительНаименование,
		|	СУММА(vsm_sklad.f_quantity_int) КАК Остаток
		|ИЗ
		|	ВнешнийИсточникДанных.СайтMySQL_parts_common_nm.Таблица.vsm_sklad КАК vsm_sklad
		|ГДЕ
		|	vsm_sklad.f_provider_id = &КодПрайса
		|
		|СГРУППИРОВАТЬ ПО
		|	vsm_sklad.source_maker";
	
	Запрос.УстановитьПараметр("КодПрайса", КодПрайса);
	
	РезультатЗапроса = Запрос.Выполнить();
	
    Возврат РезультатЗапроса.Выгрузить();

КонецФункции	