
Функция ДействующиеУсловия(ДоговорКонтрагента, ДатаУсловий = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсобыеУсловияОтсрочкиСрезПоследних.Регистратор,
		|	ОсобыеУсловияОтсрочкиСрезПоследних.ДоговорКонтрагента,
		|	ОсобыеУсловияОтсрочкиСрезПоследних.Изготовитель,
		|	ОсобыеУсловияОтсрочкиСрезПоследних.ТипПоставки,
		|	ОсобыеУсловияОтсрочкиСрезПоследних.ДопустимоеЧислоДнейЗадолженности,
		|	ОсобыеУсловияОтсрочкиСрезПоследних.ВидРасчетаДней,
		|	ОсобыеУсловияОтсрочкиСрезПоследних.ДатаОкончания
		|ИЗ
		|	РегистрСведений.ОсобыеУсловияОтсрочки.СрезПоследних(&ДатаУсловий, ДоговорКонтрагента = &ДоговорКонтрагента) КАК ОсобыеУсловияОтсрочкиСрезПоследних
		|ГДЕ
		|	ОсобыеУсловияОтсрочкиСрезПоследних.ДатаОкончания >= &ДатаУсловий";
	
	Запрос.УстановитьПараметр("ДатаУсловий", ?(ДатаУсловий = Неопределено, Дата(1,1,1), ДатаУсловий));
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорКонтрагента);
	
	Возврат Запрос.Выполнить();
	
КонецФункции