
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	лКлючАлгоритма = "Документ_КорректировкаЗаказаПоставщику_ФормаСпискаОграниченная_ПриОткрытии";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	
	//ХудинВВ 27032019 XX-2098
	ИспользоватьРасширенныеФормыСписков = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),
	"ИспользоватьРасширенныеФормыСписков");
	Если ИспользоватьРасширенныеФормыСписков = Истина Тогда
		ОткрытьФорму("Документ.КорректировкаЗаказаПоставщику.Форма.ФормаСписка");
		ЭтаФорма.Закрыть();
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	лКлючАлгоритма = "Документ_КорректировкаЗаказаПоставщику_ФормаСпискаОграниченная_ПриСозданииНаСервере";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	НеОграничиватьПериодВФормахСписков = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"),
	"НеОграничиватьПериодВФормахСписков");
	
	Если НеОграничиватьПериодВФормахСписков = Ложь Тогда
		ОбщегоНазначения.УстановитьПериодДинамическогоСпискаПоУмолчанию(Элементы.Список);
	КонецЕсли;
	
	МассивЗапрещенныхПолейГруппировки = Новый Массив;
	Для каждого ЭлГруппировки ИЗ Список.КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы Цикл
		МассивЗапрещенныхПолейГруппировки.Добавить(Строка(ЭлГруппировки.Поле));
	КонецЦикла;
	Список.УстановитьОграниченияИспользованияВГруппировке(МассивЗапрещенныхПолейГруппировки);
	
	МассивЗапрещенныхПолейПорядка = Новый Массив;
	Для каждого ЭлПорядка ИЗ Список.КомпоновщикНастроек.Настройки.ДоступныеПоляПорядка.Элементы Цикл
		МассивЗапрещенныхПолейПорядка.Добавить(Строка(ЭлПорядка.Поле));
	КонецЦикла;
	Список.УстановитьОграниченияИспользованияВПорядке(МассивЗапрещенныхПолейПорядка);

КонецПроцедуры
