
Процедура ПередЗаписью(Отказ)
	
	лКлючАлгоритма = "Справочник_НомераГТД_МодульОбъекта_ПередЗаписью";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////////////////////////////
	
	ИмяОбъекта = ЭтотОбъект.Метаданные().Имя;
	Запрос=новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|    Спр.Ссылка
	|ИЗ
	|    Справочник.НомераГТД КАК Спр
	|ГДЕ
	|    Спр.Код= &Пар";     
	Если Не Строка(ссылка)="" Тогда 
		Запрос.Текст = Запрос.Текст + " И Спр.Ссылка <> &парЗначениеСсылка ";
	КонецЕсли;	
	Запрос.УстановитьПараметр("парЗначениеСсылка",         ссылка);        
	Запрос.УстановитьПараметр("Пар",         Код);        
	
	Если Не ОбменДанными.Загрузка Тогда 
		РезультатЗапроса = Запрос.Выполнить();
	    	
		РР=РезультатЗапроса.Пустой(); 
		
		Если Не РР Тогда
			Сообщить("Подобный элемент справочника /" + Код + "/ существует!
			|Модуль: Контроль уникальности элементов справочника." );
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Разделители = Новый Массив();
		Разделители.Добавить("/");
		Данные=УправлениеЗапасами.РазложитьСтрокуПоРазделителям(Код,Разделители);
		// 29.04.19 Строганов Роман > XX-2414 Корректировка правил проверки гтд при загрузке ПТУ 
		//Если Не СтрДлина(Данные[0])=8 Тогда 
		Если СтрДлина(Данные[0]) < 5 Или СтрДлина(Данные[0]) > 8 Тогда
		// 29.04.19 Строганов Роман <
			Сообщить("Первый блок номера ГТД должен содержать от 5 до 8 символов! Пример - 10216130/160112/0001163/563");
			Отказ = Истина;
			Возврат;
		ИначеЕсли Не СтрДлина(Данные[1])=6 Тогда 
			Сообщить("Второй блок номера ГТД должен содержать 6 символов! Пример - 10216130/160112/0001163/563");
			Отказ = Истина;
			Возврат;
		ИначеЕсли Не СтрДлина(Данные[2])=7 Тогда 
			Сообщить("Третий блок номера ГТД должен содержать 7 символов! Пример - 10216130/160112/0001163/563");
			Отказ = Истина;
			Возврат;
		КонецЕсли;	
		Если СтрДлина(Код)<23 Или СтрДлина(Код)>27 Тогда 
			Сообщить("Недопустимый формат номера ГДБ! Длинна ГТД должна быть от 23 до 27 символов включительно!");
			отказ=Истина;
			Возврат;
		КонецЕсли;
		Если Число(Лев(Данные[1],2))>31 Тогда 
			Сообщить("Неверный формат номера ГТД! Второй блок содержит дату принятия ГТД, в месяце не может быть больше 31 дня!");
			отказ=Истина;
			Возврат;
		ИначеЕсли Число(Прав(Лев(Данные[1],4),2))>12 Тогда 
			Сообщить("Неверный формат номера ГТД! Второй блок содержит дату принятия ГТД, в году не может быть больше 12 месяцев!");
			отказ=Истина;
			Возврат;
		ИначеЕсли Число(Прав(Лев(Данные[1],4),2))=2 И Число(Лев(Данные[1],2))>29 Тогда 
			Сообщить("Неверный формат номера ГТД! Второй блок содержит дату принятия ГТД, в феврале не бывает больше 29 дней!");
			отказ=Истина;
			Возврат;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
