////////////////////////////////////////
// СОБЫТИЯ ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Источник, Отказ, СтандартнаяОбработка) Экспорт
	
	// ТУТ ПУСТО
	
КонецПроцедуры

Процедура ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения, СтандартнаяОбработка) Экспорт
	
	// ТУТ ПУСТО
	
КонецПроцедуры

Процедура ПередЗаписьюРегистраСведений(Источник, Отказ, Замещение, СтандартнаяОбработка) Экспорт
	
	// ТУТ ПУСТО
	
КонецПроцедуры

////////////////////////////////////////
// СОБЫТИЯ ПРИ ЗАПИСИ

Процедура ПриЗаписи(Источник, Отказ, СтандартнаяОбработка) Экспорт
	
	// ТУТ ПУСТО
	
КонецПроцедуры

Процедура ПриЗаписиРегистраСведений(Источник, Отказ, Замещение, СтандартнаяОбработка) Экспорт
	
	// ТУТ ПУСТО
	
КонецПроцедуры

////////////////////////////////////////
// СОБЫТИЯ ПЕРЕД УДАЛЕНИЕМ

Процедура ПередУдалением(Источник, Отказ, СтандартнаяОбработка) Экспорт
	
	// ТУТ ПУСТО
	
КонецПроцедуры

////////////////////////////////////////
// СОБЫТИЯ РАБОТЫ С КЭШЕМ

// Возникает перед записью в справочник кэш. Передается заполненный элемент кэша, 
// который при желании можно изменить
// ЭлементКэшаОбъект - Справочники.внКэшЖурналаРегистрации
Процедура ПередЗаписьюВКэшЖураналаРегистрации(ЭлементКэшаОбъект) Экспорт
	
	// ТУТ ПУСТО
	
КонецПроцедуры
