
//# Kalinin V.A. ( 2019-04-01 )  /*
Процедура ОткрытьИсториюОбменаПоОбъекту(ОбъектСсылка) Экспорт
	Если не ЗначениеЗаполнено(ОбъектСсылка) тогда 
		Возврат;
	КонецЕсли;
	
	//ОбработкаПросмотра  = Обработки.ПросмотрИсторииОбменов.Создать();
	ОбработкаПросмотра = ОбщегоНазначенияКлиентСервер.ПолучитьОтчетОбработку("ПросмотрИсторииОбменов", Ложь, Ложь).Объект;
	
	ФормаПросмотра = ОбработкаПросмотра.ПолучитьФорму("Форма");
	ФормаПросмотра.ИсторияОбменовПоОбъектам.Отбор.Объект.Значение  =  ОбъектСсылка;	
	ФормаПросмотра.ИсторияОбменовПоОбъектам.Отбор.Объект.Использование = истина;

	ФормаПросмотра.ОбъектСсылка = ОбъектСсылка;
	ОтключитьОтборПоСообщению(ФормаПросмотра);
	ФормаПросмотра.Открыть();			
	
КонецПроцедуры	

Процедура ОтключитьОтборПоСообщению(ФормаПросмотра)
	  	ФормаПросмотра.ОтборПоСтроке = ложь;
	  	ФормаПросмотра.ЭлементыФормы.КоманднаяПанельПоОбъектам.Кнопки.ОтборПоСтроке.Пометка = Ложь;

		ФормаПросмотра.ОтборПоОбъекту = Истина;
		ФормаПросмотра.ЭлементыФормы.КоманднаяПанельПоОбъектам.Кнопки.ОтборПоОбъекту.Пометка = Истина;
		
		ФормаПросмотра.ЭлементыФормы.ИсторияОбменовПоОбъектам.НастройкаОтбора.НомерСообщения.Доступность = Истина;
		ФормаПросмотра.ЭлементыФормы.ИсторияОбменовПоОбъектам.НастройкаОтбора.Исходящее.Доступность = Истина;
		ФормаПросмотра.ЭлементыФормы.ИсторияОбменовПоОбъектам.НастройкаОтбора.Узел.Доступность = Истина;
		ФормаПросмотра.ЭлементыФормы.ИсторияОбменовПоОбъектам.НастройкаОтбора.ДатаСообщения.Доступность = Истина;
		
		ФормаПросмотра.ИсторияОбменовПоОбъектам.Отбор.НомерСообщения.Использование = Ложь;
		ФормаПросмотра.ИсторияОбменовПоОбъектам.Отбор.Исходящее.Использование = Ложь;
		ФормаПросмотра.ИсторияОбменовПоОбъектам.Отбор.Узел.Использование = Ложь;
		ФормаПросмотра.ИсторияОбменовПоОбъектам.Отбор.ДатаСообщения.Использование = Ложь;
	
КонецПроцедуры	