Процедура Добавить(СсылкаНаДокумент, ДатаДокумента = Неопределено ) Экспорт
	
	Если ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаСоздания = НачалоДня(ДатаДокумента);
	Иначе
		ДатаСоздания = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Дата"));
	КонецЕсли;
	
	Если Не ПроведениеДокументовКлиентСервер.ИспользуютсяМФП(ДатаСоздания) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыДляСозданияМФП.ДатаСоздания
		|ИЗ
		|	РегистрСведений.ДатыДляСозданияМФП КАК ДатыДляСозданияМФП
		|ГДЕ
		|	ДатыДляСозданияМФП.ДатаСоздания = &ДатаСоздания";
	
	Запрос.УстановитьПараметр("ДатаСоздания", ДатаСоздания);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		 МЗ = РегистрыСведений.ДатыДляСозданияМФП.СоздатьМенеджерЗаписи();
		 МЗ.ДатаСоздания = ДатаСоздания;
		 МЗ.Документ	 = СсылкаНаДокумент;
		 МЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры