Процедура Добавить(СсылкаНаДокумент) Экспорт
	
	ДатаСоздания = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Дата"));
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыДляСозданияМФП.ДатаСоздания
		|ИЗ
		|	РегистрСведений.ДатыДляСозданияМФП КАК ДатыДляСозданияМФП
		|ГДЕ
		|	ДатыДляСозданияМФП.ДатаСоздания = &ДатаСоздания";
	
	Запрос.УстановитьПараметр("ДатаСоздания", ДатаСоздания);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		 МЗ = РегистрыСведений.ДатыДляСозданияМФП.СоздатьМенеджерЗаписи();
		 МЗ.ДатаСоздания = ДатаСоздания;
		 МЗ.Документ	 = СсылкаНаДокумент;
		 МЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры