Процедура ВыполнитьПроведение(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ОсобыеУсловияОтсрочки") Тогда
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "ОсобыеУсловияОтсрочки", РегистрыСведений_ОсобыеУсловияОтсрочки(вхСсылкаНаДокумент, вхОтказ));
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьОтменуПроведения(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	
	Если НЕ вхОтказ Тогда
		ПроведениеДокументовКлиентСервер.ОчиститьДвиженияДокумента(вхСсылкаНаДокумент);
	КонецЕсли;
		
КонецПроцедуры

Функция РегистрыСведений_ОсобыеУсловияОтсрочки(вхСсылкаНаДокумент, вхОтказ) 
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраСведений("ОсобыеУсловияОтсрочки", ТаблицаДвижений);
	ДатаОкончания = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "ДатаОкончания");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	НАЧАЛОПЕРИОДА(УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.Дата, ДЕНЬ) КАК Период,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка КАК Регистратор,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Изготовитель,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.ТипПоставки,
	                |	СУММА(УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.ДопустимоеЧислоДнейЗадолженности) КАК ДопустимоеЧислоДнейЗадолженности,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.ВидРасчетаДней,
	                |	ВЫБОР
	                |		КОГДА УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	                |			ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	                |		ИНАЧЕ УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.ДатаОкончания
	                |	КОНЕЦ КАК ДатаОкончания
	                |ИЗ
	                |	Документ.УстановкаОсобыхУсловийОтсрочки.ОсобыеУсловия КАК УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия
	                |ГДЕ
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка = &Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Изготовитель,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.ВидРасчетаДней,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.ТипПоставки,
	                |	УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.ДоговорКонтрагента,
	                |	НАЧАЛОПЕРИОДА(УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.Дата, ДЕНЬ),
	                |	ВЫБОР
	                |		КОГДА УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	                |			ТОГДА ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59)
	                |		ИНАЧЕ УстановкаОсобыхУсловийОтсрочкиОсобыеУсловия.Ссылка.ДатаОкончания
	                |	КОНЕЦ";
	
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);
	
	Возврат ТаблицаДвижений;
	
КонецФункции

