Процедура ВыполнитьРегламентноеЗадание() Экспорт
	 лКлючАлгоритма = "Обработка_ОбменДаннымиСОкномПоставщика_Регламент_МодульОбъекта_ВыполнитьРегламентноеЗадание";
	 лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	 Если Не лЗамена = Неопределено Тогда
	 	Выполнить(лЗамена);
	 	Возврат;
	 КонецЕсли;
	 ///////////////////////////////////////////////////////////////////////////
	 ПланыОбмена.ОбменПартКом83_ОкноПоставщика.ЗагрузитьСообщениеОбмена_Новое();
	 ПланыОбмена.ОбменПартКом83_ОкноПоставщика.ОбработатьОбъекты();

 КонецПроцедуры

//Старый алгоритм

//Процедура ВыполнитьРегламентноеЗадание() Экспорт
//	 лКлючАлгоритма = "Обработка_ОбменДаннымиСОкномПоставщика_Регламент_МодульОбъекта_ВыполнитьРегламентноеЗадание";
//	 лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
//	 Если Не лЗамена = Неопределено Тогда
//	 	Выполнить(лЗамена);
//	 	Возврат;
//	 КонецЕсли;
//	 ///////////////////////////////////////////////////////////////////////////
//	
//	 //ПланыОбмена.ОбменПартКом83_ОкноПоставщика.ЗагрузитьСообщениеОбмена_Новое();
//	 //ПланыОбмена.ОбменПартКом83_ОкноПоставщика.ОбработатьОбъекты();
//	 
//	 
//	 Настройка = Справочники.НастройкиРеквизитовДляОбменов.Обмен_1С_ОП;
//	 АдресВебСервиса = ?(ОбщегоНазначения.ЭтоРабочаяИнформационнаяБаза(), Справочники.НастройкиРеквизитовДляОбменов.Обмен_1С_ОП.СтрокаДляРабочейБазы, Справочники.НастройкиРеквизитовДляОбменов.Обмен_1С_ОП.СтрокаДляТестовойБазы);
//	 
//	 Если НЕ ЗначениеЗаполнено(ИдентификаторУзлаОбмена) тогда
//	 	//Семенов И.П. 01.02.2019 XX-1768(
//	 	ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(0,ПланыОбмена.ОбменПартКом83_ОкноПоставщика.ПустаяСсылка(),"",,Истина,"Не заполнен реквизит ""Узел обмена"".");
//	 	//)Семенов И.П.
//	 	ВызватьИсключение "Не заполнен реквизит ""Узел обмена"".";		
//	 КонецЕсли;
//	 
//	 МетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_ОкноПоставщика;
//	 МенеджерПланаОбмена = ПланыОбмена.ОбменПартКом83_ОкноПоставщика;;
//	 
//	 КодПолучателя = МенеджерПланаОбмена.ЭтотУзел().ИдентификаторУзла;
//	 
//	 Отправитель = ОбменДаннымиКлиентСервер.ПолучитьВходящийУзелОбмена(МетаданныеПланаОбмена, ИдентификаторУзлаОбмена);
//	 КодОтправителя = Отправитель.ИдентификаторУзла;
//	 НомерПринятого = Отправитель.НомерПринятого;
//	 
//	 //Семенов И.П. 01.02.2019 XX-1768(
//	 Попытка
//	 //)Семенов И.П.
//	 	Определения = Новый WSОпределения(АдресВебСервиса);
//	 	Прокси = Новый WSПрокси(Определения, Определения.Сервисы[0].URIПространстваИмен, Определения.Сервисы[0].Имя, Определения.Сервисы[0].ТочкиПодключения[0].Имя);
//	 	
//	 	ОтветСервера = Прокси.GetExchangeMessage("ОбменПартКом83_ОкноПоставщика", КодПолучателя, НомерПринятого);
//	 	СообщениеОбмена = ОбменДаннымиСервер.РаспаковатьСообщениеОбмена(ОтветСервера);
//	 	
//	 	ТипСообщениеОбмена = ФабрикаXDTO.Тип("http://ws-02.part-kom.ru/partkom83/hs/SiteExchange/XMLSchema", "СообщениеОбмена");
//	 	ЧтениеХМЛ = Новый ЧтениеXML;
//	 	ЧтениеХМЛ.УстановитьСтроку(СообщениеОбмена);
//	 	ДанныеХДТО = ФабрикаXDTO.ПрочитатьXML(ЧтениеХМЛ, ТипСообщениеОбмена);
//	 
//	 	СписокОбъектов = ДанныеХДТО.Объекты.ПолучитьСписок("Объект");
//	 //Семенов И.П. 01.02.2019 XX-1768(
//	 Исключение
//	     ТекстОшибки = ОписаниеОшибки();
//	 	ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(0,Отправитель,"",,Истина,ТекстОшибки);
//	 	ВызватьИсключение ТекстОшибки;
//	 КонецПопытки;
//	 //)Семенов И.П.
//	 Если СписокОбъектов.Количество() > 0 Тогда
//	 	//Семенов И.П. 01.02.2019 XX-1768(
//	 	ОбменДаннымиКлиентСервер.НачатьЗаписьВИсториюОбменовПоОбъектам();
//	 	//)Семенов И.П.
//	 	ОбменДаннымиВызовСервера.ЗарегистрироватьСообщениеВИсторииОбменаССайтом(КодОтправителя, КодПолучателя, ОтветСервера, НомерПринятого);
//	 	МенеджерПланаОбмена.ЗагрузитьСообщениеОбмена(СписокОбъектов, ДанныеХДТО.Отправитель, ДанныеХДТО.Получатель, ДанныеХДТО.НомерСообщения);
//	 КонецЕсли;
//	 
//	 //Семенов И.П. 01.02.2019 XX-1768(
//	 ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(ДанныеХДТО.НомерСообщения, Отправитель, СообщениеОбмена);
//	 //)Семенов И.П.
//	//
//КонецПроцедуры
