Перем мЗарегистрироватьИзмененияДляСайта;

Процедура ПередЗаписью(Отказ)
	
	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: Филиалы", Ложь) И НЕ ОбменДанными.Загрузка Тогда
		мЗарегистрироватьИзмененияДляСайта = ОбменДаннымиКлиентСервер.НеобходимаРегистрацияИзменений(ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные(), ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры
Процедура ПриЗаписи(Отказ)
	
	Если мЗарегистрироватьИзмененияДляСайта Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные());
	КонецЕсли;
	
КонецПроцедуры
Процедура ПередУдалением(Отказ)

	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: Филиалы", Ложь) Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные());
	КонецЕсли;
	
КонецПроцедуры

мЗарегистрироватьИзмененияДляСайта = Ложь;
