Процедура ИницилизироватьДействияНадОбъектом(вхПараметры) Экспорт 
	Если вхПараметры = Неопределено Тогда 
		вхПараметры = Новый Структура;
	КонецЕсли;
	
	ДействияНадОбъектом = Новый Структура("БылоПроведение, Успешно", Ложь, Ложь);
	вхПараметры.Вставить("ДействияНадОбъектом", ДействияНадОбъектом);
КонецПроцедуры

Процедура УстановитьПризнакНаличияПроведения(вхПараметры) Экспорт 
	вхПараметры.ДействияНадОбъектом.Вставить("БылоПроведение", Истина);
КонецПроцедуры

Процедура УстановитьПризнакУспешногоПроведения(вхПараметры) Экспорт 
	вхПараметры.ДействияНадОбъектом.Вставить("Успешно", Истина);
КонецПроцедуры

Процедура ОбработатьДействияНадОбъектом(вхПараметры, ДокументСсылка, ОписаниеОшибки, ПроцедураВызова) Экспорт 
	
	Перем БылоПроведение, Успешно;
	ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "ДействияНадОбъектом.БылоПроведение", БылоПроведение);
	ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "ДействияНадОбъектом.Успешно", Успешно);
	
	Если БылоПроведение = Истина И Успешно = Ложь Тогда 
		МестоВозникновения = "Документ." + ДокументСсылка.Метаданные().Имя + "." + ПроцедураВызова;
		КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(
						ДокументСсылка, 
						Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаПроведенияПриЗагрузкеИзТопЛог,
						ОписаниеОшибки,
						,
						Истина,
						ОписаниеОшибки, 
						МестоВозникновения
						);
	КонецЕсли;
КонецПроцедуры
				
				
	