Функция ПолучитьРеквизитыКонтроля(МетаданныеОтбора) Экспорт
	
	СтруктураПроверяемыхРеквизитов = Новый Структура;
	
	Если МетаданныеОтбора = Метаданные.ПланыОбмена.ОбменПартКом83_Сайт Тогда
		СтруктураПроверяемыхРеквизитов.Вставить("Шапка", "Наименование,Код,Владелец,Дата,Номер,Организация,СрокДействия,ДопустимаяСуммаЗадолженности,КоэффициентСуммыКредита");
	КонецЕсли;
	
	Если МетаданныеОтбора = Метаданные.ПланыОбмена.ОбменПартКом83_77 Тогда
		СтруктураПроверяемыхРеквизитов.Вставить("Шапка", "Наименование,Код,Владелец,Дата,Номер,Организация,СрокДействия");
	КонецЕсли;
	
	Возврат СтруктураПроверяемыхРеквизитов;
	
КонецФункции

Функция ПолучитьЗначенияРеквизитовКонтроля(СсылкаНаОбъект, МетаданныеОтбора) Экспорт
	
	Возврат	РаботаСПоследовательностямиКлиентСервер.ПолучитьЗначенияРеквизитовКонтроля(СсылкаНаОбъект, МетаданныеОтбора);
	
КонецФункции

Функция ВыгрузитьЭлементы(ТаблицаСсылокНаОбъекты, МетаданныеПланаОбмена) Экспорт
	
	МассивОбъектов = Новый Массив;
	URI = ПланыОбмена.ОбменПартКом83_Сайт.URIПространстваИмен();
	ТипОбъектаXDTO = ФабрикаXDTO.Тип(URI, "Справочники.ДоговорыКонтрагентов");
	ТипУдалениеОбъекта = ФабрикаXDTO.Тип(URI, "УдалениеОбъекта");	

	ОбъектыОбмена = ДанныеОбъектовПланаОбмена(ТаблицаСсылокНаОбъекты);

	Если МетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_Сайт тогда
		
		Выборка = ОбъектыОбмена[5].Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
			ЗаполнитьЗначенияСвойств(ОбъектXDTO, Выборка,,"Ссылка,КонтрагентЛогин");
			ОбъектXDTO.Ссылка = Выборка.Ссылка.УникальныйИдентификатор();
			ОбъектXDTO.КонтрагентUUID = Выборка.Контрагент.УникальныйИдентификатор();
			ОбъектXDTO.ОрганизацияUUID = Выборка.Организация.УникальныйИдентификатор();
			ОбъектXDTO.КонтрагентЛогин = СокрЛП(Выборка.КонтрагентЛогин);
			МассивОбъектов.Добавить(ОбъектXDTO);
		КонецЦикла;		
		
		Выборка = ОбъектыОбмена[6].Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбъектXDTO = ФабрикаXDTO.Создать(ТипУдалениеОбъекта);
			ОбъектXDTO.ТипОбъекта = "Справочники.ДоговорыКонтрагентов";
			ОбъектXDTO.Ссылка = Выборка.Ссылка.УникальныйИдентификатор();
			
			МассивОбъектов.Добавить(ОбъектXDTO);
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивОбъектов;
	
КонецФункции


Функция ДанныеОбъектовПланаОбмена(ТаблицаСсылокНаОбъекты)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВнешняяТаблица.Ссылка
	                      |ПОМЕСТИТЬ ЗарегистрированныеОбъекты
	                      |ИЗ
	                      |	&ТаблицаСсылокНаОбъекты КАК ВнешняяТаблица
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВЫРАЗИТЬ(ЗарегистрированныеОбъекты.Ссылка КАК Справочник.ДоговорыКонтрагентов) КАК Ссылка,
	                      |	ВЫБОР
	                      |		КОГДА ВЫРАЗИТЬ(ЗарегистрированныеОбъекты.Ссылка КАК Справочник.ДоговорыКонтрагентов).ВерсияДанных ЕСТЬ NULL
	                      |				И (ВЫРАЗИТЬ(ЗарегистрированныеОбъекты.Ссылка КАК Справочник.ДоговорыКонтрагентов)) <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК ЭтоУдаление
	                      |ПОМЕСТИТЬ Объекты
	                      |ИЗ
	                      |	ЗарегистрированныеОбъекты КАК ЗарегистрированныеОбъекты
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	УчетныеЗаписиСайта.Владелец.Владелец КАК Контрагент,
	                      |	МАКСИМУМ(УчетныеЗаписиСайта.Код) КАК Логин
	                      |ПОМЕСТИТЬ ЛогиныКонтрагентов
	                      |ИЗ
	                      |	Справочник.УчетныеЗаписиСайта КАК УчетныеЗаписиСайта
	                      |ГДЕ
	                      |	УчетныеЗаписиСайта.Владелец.Владелец В
	                      |			(ВЫБРАТЬ
	                      |				Объекты.Ссылка.Владелец
	                      |			ИЗ
	                      |				Объекты КАК Объекты
	                      |			ГДЕ
	                      |				НЕ Объекты.ЭтоУдаление)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	УчетныеЗаписиСайта.Владелец.Владелец
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Объекты.Ссылка
	                      |ПОМЕСТИТЬ ДоговорыПодчиненныхКонтрагентов
	                      |ИЗ
	                      |	Объекты КАК Объекты
	                      |ГДЕ
	                      |	НЕ Объекты.ЭтоУдаление
	                      |	И Объекты.Ссылка.Владелец <> Объекты.Ссылка.Владелец.ГоловнойКонтрагент
	                      |	И Объекты.Ссылка.Владелец.ГоловнойКонтрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ДоговорыПодчиненныхКонтрагентов.Ссылка КАК ПодчиненныйДоговор,
//{{MRG[ <-> ]
	                      |	ДоговорыКонтрагентов.Ссылка КАК ДоговорХолдинга,
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	                      |	ДоговорыКонтрагентов.Ссылка КАК ДоговорХолдинга
//}}MRG[ <-> ]
	                      |	ДоговорыКонтрагентов.ДатаДоговораОферты,
	                      |	ДоговорыКонтрагентов.НомерЗаявкиОферты,
	                      |	ДоговорыКонтрагентов.ДатаДоговораОферты <> ДАТАВРЕМЯ(1, 1, 1)
	                      |		ИЛИ ДоговорыКонтрагентов.НомерЗаявкиОферты <> """"
	                      |		ИЛИ ДоговорыКонтрагентов.ДоговорПодписан КАК АксептОферты
	                      |ПОМЕСТИТЬ ДоговораХолдингов
	                      |ИЗ
	                      |	ДоговорыПодчиненныхКонтрагентов КАК ДоговорыПодчиненныхКонтрагентов
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                      |		ПО ДоговорыПодчиненныхКонтрагентов.Ссылка.Организация = ДоговорыКонтрагентов.Организация
	                      |			И ДоговорыПодчиненныхКонтрагентов.Ссылка.ВидОплаты = ДоговорыКонтрагентов.ВидОплаты
	                      |			И ДоговорыПодчиненныхКонтрагентов.Ссылка.ДоговорНаОферту = ДоговорыКонтрагентов.ДоговорНаОферту
	                      |			И (НЕ ДоговорыКонтрагентов.Ссылка.ПометкаУдаления)
	                      |			И (НЕ ДоговорыКонтрагентов.Ссылка.ДоговорПриостановлен)
	                      |			И (НЕ ДоговорыКонтрагентов.Ссылка.СлужебныйДоговор)
	                      |			И ДоговорыПодчиненныхКонтрагентов.Ссылка.Владелец.ГоловнойКонтрагент = ДоговорыКонтрагентов.Владелец
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Объекты.Ссылка,
	                      |	Объекты.Ссылка.Код КАК Код,
	                      |	Объекты.Ссылка.Организация КАК Организация,
	                      |	ЕСТЬNULL(Объекты.Ссылка.Организация.Код, """") КАК ОрганизацияКод,
	                      |	ЕСТЬNULL(ЛогиныКонтрагентов.Логин, """") КАК КонтрагентЛогин,
	                      |	Объекты.Ссылка.Владелец КАК Контрагент,
	                      |	Объекты.Ссылка.Дата КАК ДатаДоговора,
	                      |	Объекты.Ссылка.Номер КАК НомерДоговора,
	                      |	Объекты.Ссылка.ДоговорПриостановлен КАК Заблокирован,
//{{MRG[ <-> ]
	                      |	ЕСТЬNULL(ДоговораХолдингов.АксептОферты, Объекты.Ссылка.ДоговорПодписан
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	                      |	Объекты.Ссылка.ДоговорПодписан КАК Подписан,
//}}MRG[ <-> ]
	                      |			ИЛИ Объекты.Ссылка.ДатаДоговораОферты <> ДАТАВРЕМЯ(1, 1, 1)
	                      |			ИЛИ Объекты.Ссылка.НомерЗаявкиОферты <> """") КАК Подписан,
	                      |	Объекты.Ссылка.СлужебныйДоговор КАК СлужебныйДоговор,
	                      |	ВЫБОР
	                      |		КОГДА Объекты.Ссылка.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхСредств.Наличные)
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК НаличныйРасчет,
	                      |	Объекты.Ссылка.ДоговорНаОферту КАК Оферта,
	                      |	ВЫБОР
	                      |		КОГДА Объекты.Ссылка.ВидРасчетаДней = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаДней.ПоКалендарнымДням)
	                      |			ТОГДА ИСТИНА
	                      |		ИНАЧЕ ЛОЖЬ
	                      |	КОНЕЦ КАК РасчетПоКалендарнымДням,
	                      |	ЕСТЬNULL(ДоговораХолдингов.ДоговорХолдинга.ДопустимаяСуммаЗадолженности, Объекты.Ссылка.ДопустимаяСуммаЗадолженности) КАК СуммаКредита,
	                      |	ЕСТЬNULL(ДоговораХолдингов.ДоговорХолдинга.ДопустимоеЧислоДнейЗадолженности, Объекты.Ссылка.ДопустимоеЧислоДнейЗадолженности) КАК ДнейКредита,
	                      |	ЕСТЬNULL(ДоговораХолдингов.ДоговорХолдинга.КоэффициентСуммыКредита, Объекты.Ссылка.КоэффициентСуммыКредита) КАК КредитныйКоэффициент,
	                      |	ЕСТЬNULL(_ДляПереносаДанных.Строка77, ""00000000-0000-0000-0000-000000000000"") КАК UUID77
	                      |ИЗ
	                      |	Объекты КАК Объекты
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений._ДляПереносаДанных КАК _ДляПереносаДанных
	                      |		ПО Объекты.Ссылка = _ДляПереносаДанных.Объект
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ЛогиныКонтрагентов КАК ЛогиныКонтрагентов
	                      |		ПО Объекты.Ссылка.Владелец = ЛогиныКонтрагентов.Контрагент
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ДоговораХолдингов КАК ДоговораХолдингов
	                      |		ПО Объекты.Ссылка = ДоговораХолдингов.ПодчиненныйДоговор
	                      |ГДЕ
	                      |	НЕ Объекты.ЭтоУдаление
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Объекты.Ссылка
	                      |ИЗ
	                      |	Объекты КАК Объекты
	                      |ГДЕ
	                      |	Объекты.ЭтоУдаление");
	Запрос.УстановитьПараметр("ТаблицаСсылокНаОбъекты", ТаблицаСсылокНаОбъекты);
	
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции