Функция ПрочитатьПараметрыПользователяИБ(КодПользователя) Экспорт
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Имя");
	СтруктураВозврата.Вставить("ПолноеИмя");
	СтруктураВозврата.Вставить("АутентификацияСтандартная");
	СтруктураВозврата.Вставить("ПоказыватьВСпискеВыбора");
	СтруктураВозврата.Вставить("ПарольУстановлен");
	СтруктураВозврата.Вставить("АутентификацияОС");
	СтруктураВозврата.Вставить("ПользовательОС");
	СтруктураВозврата.Вставить("Роли");
	СтруктураВозврата.Вставить("ОсновнойИнтерфейс");

	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(КодПользователя);
	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, ПользовательИБ);
	
	Возврат СтруктураВозврата;	
	
КонецФункции