Функция ПрочитатьПараметрыПользователяИБ(КодПользователя) Экспорт
	лКлючАлгоритма = "ОбщийМодуль_ПривелегированныйСервер_ПрочитатьПараметрыПользователяИБ";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(КодПользователя);
	Если ПользовательИБ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Имя");
	СтруктураВозврата.Вставить("ПолноеИмя");
	СтруктураВозврата.Вставить("АутентификацияСтандартная");
	СтруктураВозврата.Вставить("ПоказыватьВСпискеВыбора");
	СтруктураВозврата.Вставить("ПарольУстановлен");
	СтруктураВозврата.Вставить("АутентификацияОС");
	СтруктураВозврата.Вставить("ПользовательОС");
	СтруктураВозврата.Вставить("ОсновнойИнтерфейс");
	
	ЗаполнитьЗначенияСвойств(СтруктураВозврата, ПользовательИБ);
	СтруктураВозврата.Вставить("ОсновнойИнтерфейс", СокрЛП(ПользовательИБ.ОсновнойИнтерфейс));
	
	СтруктураВозврата.Вставить("Роли", Новый Массив);
	Для Каждого лРоль Из ПользовательИБ.Роли Цикл
		СтруктураВозврата.Роли.Добавить(Новый Структура("Имя", лРоль.Имя));
	КонецЦикла;
	
	
	Возврат СтруктураВозврата;	
	
КонецФункции