//#Область ФормированиеИсторииЗаявок
//Процедура ЗарегистрироватьИзменениеЗаявкиКлиента(ДокументСсылка) Экспорт
//	
//	УстановитьПривилегированныйРежим();
//	МетДанные = ДокументСсылка.Метаданные();
//ПодключитьОбработчикОповещения("РаботаЗапросСостояние_"+МетДанные.Имя);
//	
//	
//КонецПроцедуры	



//	
//#КонецОбласти


//#Область ЗапросыКДанным
//Функция ЗапросСостояние_ЗаявкаПокупателя(Событие, Параметр, Источник) Экспорт
//ТекстЗапроса =  "ВЫБРАТЬ
//	              |	ЗаявкиПокупателей.СтрокаЗаявки,
//	              |	NULL КАК СтрокаПрихода,
//	              |	1 КАК Порядок,
//	              |	ВЫБОР
//	              |		КОГДА ВЫРАЗИТЬ(ЗаявкиПокупателей.Регистратор КАК Документ.ЗаявкаПокупателя).СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ЗаявкаПокупателяПодтвержден)
//	              |			ТОГДА ЗНАЧЕНИЕ(Справочник.СостоянияСтрокДокументов.Новый)
//	              |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СостоянияСтрокДокументов.НовыйНеподтвержден)
//	              |	КОНЕЦ КАК Состояние,
//	              |	ЗаявкиПокупателей.Период КАК ДатаСобытия,
//	              |	ЗаявкиПокупателей.Количество,
//	              |	ЗаявкиПокупателей.Количество КАК КоличествоПлан
//	              |ИЗ
//	              |	РегистрНакопления.ЗаявкиПокупателей КАК ЗаявкиПокупателей
//	              |ГДЕ
//	              |	ЗаявкиПокупателей.Регистратор = &ДокументСсылка
//	              |
//	              |ОБЪЕДИНИТЬ ВСЕ
//	              |
//	              |ВЫБРАТЬ
//	              |	РезервыТоваров.СтрокаЗаявки,
//	              |	РезервыТоваров.СтрокаПрихода,
//	              |	2,
//	              |	ЗНАЧЕНИЕ(Справочник.СостоянияСтрокДокументов.ВРезерве),
//	              |	РезервыТоваров.Период,
//	              |	РезервыТоваров.Количество,
//	              |	NULL
//	              |ИЗ
//	              |	РегистрНакопления.РезервыТоваров КАК РезервыТоваров
//	              |ГДЕ
//	              |	РезервыТоваров.Регистратор = &ДокументСсылка"
//	
//КонецФункции	




//#КонецОбласти 



