
Функция ВзаимосвязьУникальна(СвзяьОбъект) Экспорт
	
	ВзаимосвязьУникальна = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Ссылка
	|ИЗ
	|	Справочник.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя КАК ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя
	|ГДЕ
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус = &ТекущийСтатус
	|	И ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.СледующийСтатус = &СледующийСтатус
	|	И НЕ ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СвзяьОбъект.Ссылка);
	Запрос.УстановитьПараметр("СледующийСтатус", СвзяьОбъект.СледующийСтатус);
	Запрос.УстановитьПараметр("ТекущийСтатус", СвзяьОбъект.ТекущийСтатус);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ВзаимосвязьУникальна = Ложь;
	КонецЕсли;

	Возврат ВзаимосвязьУникальна;
	
КонецФункции