
Функция ВзаимосвязьУникальна(СвзяьОбъект) Экспорт
	
	ВзаимосвязьУникальна = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Ссылка
	|ИЗ
	|	Справочник.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя КАК ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя
	|ГДЕ
	|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус = &ТекущийСтатус
	|	И ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.СледующийСтатус = &СледующийСтатус
	|	И НЕ ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СвзяьОбъект.Ссылка);
	Запрос.УстановитьПараметр("СледующийСтатус", СвзяьОбъект.СледующийСтатус);
	Запрос.УстановитьПараметр("ТекущийСтатус", СвзяьОбъект.ТекущийСтатус);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда
		ВзаимосвязьУникальна = Ложь;
	КонецЕсли;

	Возврат ВзаимосвязьУникальна;
	
КонецФункции

Функция ДоступныеВзаимосвязиТекущегоСтатуса(ТекущийСтатус, ТекстОтбора = "") Экспорт
	
	ДоступныеВзаимосвязи = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Ссылка,
		|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Наименование
		|ИЗ
		|	Справочник.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя КАК ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя
		|ГДЕ
		|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус = &ТекущийСтатус
		|	И НЕ ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ПометкаУдаления
		|	И ИСТИНА";
	
	Запрос.УстановитьПараметр("ТекущийСтатус", ТекущийСтатус);
	Если ЗначениеЗаполнено(ТекстОтбора) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", ТекстОтбора);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДоступныеВзаимосвязи.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;
	
	Возврат ДоступныеВзаимосвязи;	
	
КонецФункции

Функция ТаблицаКомандДляТекущегоСтатуса(ТекущийСтатус, Знач Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	ДоступныеВзаимосвязи = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Ссылка КАК Команда,
		|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.СледующийСтатус.Наименование КАК НаименованиеКоманды,
		|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ИмяКоманды КАК ИмяКоманды,
		|	ЗНАЧЕНИЕ(Перечисление.РасположенияКомандыПроцесса.ВверхуФормы) КАК Расположение,
		|	ЛОЖЬ КАК НаКлиенте,
		|	ИСТИНА КАК Доступность,
		|	ИСТИНА КАК Видимость,
		|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.Автоматически КАК Автоматически,
		|	0 КАК Приоритет
		|ИЗ
		|	Справочник.ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя КАК ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступаКСтатусамПроцессаВозвратаОтПокупателя.Статусы КАК ГруппыДоступаКСтатусам
		|		ПО (ГруппыДоступаКСтатусам.Статус = ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус)
		|ГДЕ
		|	ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ТекущийСтатус = &ТекущийСтатус
		|	И НЕ ВзаимосвязиСтатусовПроцессаВозвратаОтПокупателя.ПометкаУдаления
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтатусыДокументовКомандыПроцесса.КомандаПроцесса,
		|	СтатусыДокументовКомандыПроцесса.КомандаПроцесса.Наименование,
		|	СтатусыДокументовКомандыПроцесса.КомандаПроцесса.Имя,
		|	СтатусыДокументовКомандыПроцесса.Расположение,
		|	СтатусыДокументовКомандыПроцесса.КомандаПроцесса.НаКлиенте,
		|	ИСТИНА,
		|	ИСТИНА,
		|	СтатусыДокументовКомандыПроцесса.КомандаПроцесса.Автоматически,
		|	СтатусыДокументовКомандыПроцесса.НомерСтроки
		|ИЗ
		|	Справочник.СтатусыДокументов.КомандыПроцесса КАК СтатусыДокументовКомандыПроцесса
		|ГДЕ
		|	СтатусыДокументовКомандыПроцесса.Ссылка = &ТекущийСтатус
		|	И НЕ СтатусыДокументовКомандыПроцесса.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("ТекущийСтатус", ТекущийСтатус);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаКоманд = РезультатЗапроса.Выгрузить();
	
	ТаблицаКоманд.Колонки.Добавить("Подсказка", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(0)));
	
	Возврат ТаблицаКоманд;
	
КонецФункции