
Функция СписокВыбораКодовВозврата() Экспорт
	
	лКлючАлгоритма = "Справочник_КодыВозврата_МодульМенеджера_СписокВыбораКодовВозврата";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	СписокВыбораКодовВозврата = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыВозврата.Ссылка,
		|	КодыВозврата.Наименование
		|ИЗ
		|	Справочник.КодыВозврата КАК КодыВозврата
		|ГДЕ
		|	НЕ КодыВозврата.ПометкаУдаления 
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодыВозврата.Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		СписокВыбораКодовВозврата.Добавить(Выборка.Ссылка, Выборка.Наименование);
		
	КонецЦикла;
	
	Возврат СписокВыбораКодовВозврата;
	
КонецФункции

