Функция СтруктураКонстант() Экспорт
	
	СтруктураКонстант = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИменованныеКонстантыПроцессов.Наименование,
	|	ИменованныеКонстантыПроцессов.Значение
	|ИЗ
	|	Справочник.ИменованныеКонстантыПроцессов КАК ИменованныеКонстантыПроцессов
	|ГДЕ
	|	НЕ ИменованныеКонстантыПроцессов.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураКонстант.Вставить(Выборка.Наименование, Выборка.Значение);
	КонецЦикла;
	
	Возврат СтруктураКонстант;	
	
КонецФункции