Функция СтруктураКонстант() Экспорт
	
	лКлючАлгоритма = "Справочник_ИменованныеКонстантыПроцессов_МодульМенеджера_СтруктураКонстант";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	СтруктураКонстант = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИменованныеКонстантыПроцессов.Наименование,
	|	ИменованныеКонстантыПроцессов.Значение
	|ИЗ
	|	Справочник.ИменованныеКонстантыПроцессов КАК ИменованныеКонстантыПроцессов
	|ГДЕ
	|	НЕ ИменованныеКонстантыПроцессов.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураКонстант.Вставить(Выборка.Наименование, Выборка.Значение);
	КонецЦикла;
	
	Возврат СтруктураКонстант;	
	
КонецФункции

Функция ЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	лКлючАлгоритма = "Справочник_ИменованныеКонстантыПроцессов_МодульМенеджера_ЗначениеКонстанты";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	ЗначениеКонстанты = Неопределено;
	
	НайденноеЗначение =  Справочники.ИменованныеКонстантыПроцессов.НайтиПоНаименованию(ИмяКонстанты, Истина);
	
	Если НайденноеЗначение <> Неопределено Тогда
		ЗначениеКонстанты = НайденноеЗначение.Значение;
	КонецЕсли;
	
	Возврат ЗначениеКонстанты;
	
КонецФункции