Процедура ОчиститьЖурнал() Экспорт
	
	НаборЗаписи  = РегистрыСведений.ИсторияВыполненияРегламентныхЗаданий.СоздатьНаборЗаписей();
	
	Если ГлубинаДней = 0 тогда
		НаборЗаписи.Записать();
	Иначе
		ГлубинаИстории = НачалоДня(ТекущаяДата() - 60*60*24*ГлубинаДней);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИсторияВыполненияРегламентныхЗаданий.МоментВремени,
		|	ИсторияВыполненияРегламентныхЗаданий.Задание,
		|	ИсторияВыполненияРегламентныхЗаданий.Этап
		|ИЗ
		|	РегистрСведений.ИсторияВыполненияРегламентныхЗаданий КАК ИсторияВыполненияРегламентныхЗаданий
		|ГДЕ
		|	ИсторияВыполненияРегламентныхЗаданий.МоментВремени < &МоментВремени";

		Запрос.УстановитьПараметр("МоментВремени", ГлубинаИстории);
		Результат = Запрос.Выполнить().Выгрузить();

		Если Результат.Количество() = 0 тогда
			Возврат;
		КонецЕсли;
		
		Для каждого стрИ из Результат цикл
							
			НаборЗаписи.Отбор.МоментВремени.Установить(стрИ.МоментВремени);
			НаборЗаписи.Отбор.Задание.Установить(стрИ.Задание);
			НаборЗаписи.Отбор.Этап.Установить(стрИ.Этап);
			
			НаборЗаписи.Очистить();
			НаборЗаписи.Записать();
							
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#Если Сервер тогда
Процедура ВыполнитьРегламентноеЗадание() Экспорт
	ОчиститьЖурнал();
КонецПроцедуры
#КонецЕсли