
#Если Сервер тогда
	Процедура ВыполнитьРегламентноеЗадание() Экспорт
		
		лУдалено = 0;
		лУпаковщик = DataExchangeПовтИсп.ПолучитьУпаковщик();
		лДатаКонца = КонецДня(ТекущаяДата() - Глубина * 86400);
		лВыборка = РегистрыСведений.ИсторияОбменаССайтом.Выбрать(, лДатаКонца);
		Пока лВыборка.Следующий() цикл
			
			лСообщениеОбмена = лУпаковщик.UnpackWideString(лВыборка.СообщениеОбмена);
			лТекстовыйДокумент = Новый ТекстовыйДокумент;
			лТекстовыйДокумент.УстановитьТекст(лСообщениеОбмена);
			лСообщениеОбмена = лТекстовыйДокумент.ПолучитьТекст();
			
			лЧтениеХМЛ = Новый ЧтениеXML;
			лЧтениеХМЛ.УстановитьСтроку(лСообщениеОбмена);
			
			лУдалить = Ложь;
			Пока лЧтениеХМЛ.Прочитать() цикл
				Если (лЧтениеХМЛ.Имя = "Объекты") И (лЧтениеХМЛ.ТипУзла = ТипУзлаXML.НачалоЭлемента) тогда
					Если лЧтениеХМЛ.Прочитать() тогда
						Если (лЧтениеХМЛ.Имя = "Объекты") И (лЧтениеХМЛ.ТипУзла = ТипУзлаXML.КонецЭлемента) тогда
							лУдалить = Истина;
						КонецЕсли;
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если лУдалить тогда
				лУдалено = лУдалено + 1;
				лЗапись = лВыборка.ПолучитьМенеджерЗаписи();
				лЗапись.Удалить();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецПроцедуры
	
#КонецЕсли