
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Адрес") Тогда	
		ТаблицаДанных = ПолучитьИзВременногоХранилища(Параметры.Адрес);
		Для Каждого Строка Из ТаблицаДанных Цикл
			ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка);
		КонецЦикла;
		Элементы.ТаблицаСумма.ТекстПодвала = Таблица.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТаблицаДанных = ПолучитьИзВременногоХранилища(Параметры.АдресТаблицыДанных);
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		ЗаполнитьЗначенияСвойств(Таблица.Добавить(), Строка);
	КонецЦикла;
	
КонецПроцедуры

