Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если СтатусДокумента = Справочники.СтатусыДокументов.ПоступлениеТоваровНовый
		ИЛИ СтатусДокумента = Справочники.СтатусыДокументов.ПоступлениеТоваровОтгружен Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Документы.КорректировкаПоступленияТоваровУслуг.ВыполнитьПроведение(Ссылка, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
	//    Предупреждение("Изменить документ вручную пока невозможно.");
	//	Отказ = Истина;
	//	Возврат;
	//	
	//КонецЕсли;
	
КонецПроцедуры
