Процедура Добавить(Документ, ВидПечатногоДокумента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДатыВозвратаДокументов.Документ
		|ИЗ
		|	РегистрСведений.ДатыВозвратаДокументов КАК ДатыВозвратаДокументов
		|ГДЕ
		|	ДатыВозвратаДокументов.Документ = &Документ
		|	И ДатыВозвратаДокументов.ВидПечатногоДокумента = &ВидПечатногоДокумента";
	
	Запрос.УстановитьПараметр("ВидПечатногоДокумента", ВидПечатногоДокумента);
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МЗ = РегистрыСведений.ДатыВозвратаДокументов.СоздатьМенеджерЗаписи();
	МЗ.Документ 				= Документ;
	МЗ.ВидПечатногоДокумента 	= ВидПечатногоДокумента;
	МЗ.ДатаВозврата 			= ТекущаяДата();
	МЗ.Пользователь 			= ПараметрыСеанса.ТекущийПользователь;
	МЗ.Записать();
	
КонецПроцедуры

Функция ДанныеДокумента(Документ, ВидПечатногоДокумента) Экспорт
	
	СтрокаПолей = ПоляРегистраСтрокой();
	ДанныеДокумента = Новый Структура(СтрокаПолей);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	"+СтрокаПолей+"
	|ИЗ
	|	РегистрСведений.ДатыВозвратаДокументов КАК ДатыПечатиДокументов
	|ГДЕ
	|	ДатыПечатиДокументов.Документ = &Документ
	|	И ДатыПечатиДокументов.ВидПечатногоДокумента = &ВидПечатногоДокумента";
	
	Запрос.УстановитьПараметр("ВидПечатногоДокумента", 	ВидПечатногоДокумента);
	Запрос.УстановитьПараметр("Документ", 				Документ);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ДанныеДокумента, Выборка);
	КонецЕсли;
	
	Возврат ДанныеДокумента;
	
КонецФункции

Функция ПоляРегистраСтрокой()
	
	Возврат "Документ, ВидПечатногоДокумента, ДатаВозврата, Пользователь";
	
КонецФункции