Перем ЗарегистрироватьКОбмену;

Процедура ПередЗаписью(Отказ, Замещение)
	ЗарегистрироватьКОбмену = Ложь;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ФилиалыТорговыхТочек.ТорговаяТочка,
	|	ФилиалыТорговыхТочек.Филиал
	|ИЗ
	|	РегистрСведений.ФилиалыТорговыхТочек КАК ФилиалыТорговыхТочек
	|ГДЕ
	|	ФилиалыТорговыхТочек.ТорговаяТочка = &ТорговаяТочка
	|	И ФилиалыТорговыхТочек.Филиал = &Филиал"
	);
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запрос.УстановитьПараметр("ТорговаяТочка", Запись.ТорговаяТочка);
		Запрос.УстановитьПараметр("Филиал", Запись.Филиал);
	
		Если Запрос.Выполнить().Выгрузить().Количество() = 0 Тогда
			ЗарегистрироватьКОбмену = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ, Замещение)
	Если ЗарегистрироватьКОбмену Тогда
		Для Каждого Запись Из ЭтотОбъект Цикл
			ОбменДаннымиКлиентСервер.ЗарегистрироватьКОбменуБИТ(Запись.ТорговаяТочка);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

