Процедура ДобавитьПодменюДвиженияДокумента(ЭтаФорма, ДействияФормы, МетаданныеДвиженияДокумента, ДвиженияДокументаНажатие) Экспорт
	
	ПанельДействий = ЭтаФорма.ЭлементыФормы[ДействияФормы];
	НовоеПодменю = ПанельДействий.Кнопки.Добавить("ДвиженияДокументаПерейти", ТипКнопкиКоманднойПанели.Подменю, "Перейти");
	Для Каждого ТекРегистр Из МетаданныеДвиженияДокумента Цикл
		
		НоваяКнопка = НовоеПодменю.Кнопки.Добавить("ДвижениеДокумента" + ТекРегистр.Имя, ТипКнопкиКоманднойПанели.Действие, ТекРегистр.Синоним, Новый Действие(ДвиженияДокументаНажатие));
		
	КонецЦикла;
	
КонецПроцедуры

