
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Ц1.Ссылка.Дата КАК Период,
	|	Ц1.Ссылка КАК Регистратор,
	|	&ТипЦенРубли КАК ТипЦен,
	|	Ц1.Номенклатура,
	|	&ВалютаРубль КАК Валюта,
	|	Ц1.ЦенаРуб КАК Цена,
	|	Ц1.Номенклатура.ЕдиницаХраненияОстатков КАК ЕдиницаИзмерения
	|ИЗ
	|	Документ.ВводНачальныхОстатковПоРегиструЦеныНоменклатуры.ЦеныНоменклатуры КАК Ц1
	|ГДЕ
	|	Ц1.Ссылка = &Ссылка
	|	И Ц1.ЦенаРуб > 0
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ц2.Ссылка.Дата,
	|	Ц2.Ссылка,
	|	&ТипЦенДоллар,
	|	Ц2.Номенклатура,
	|	&ВалютаДоллар,
	|	Ц2.ЦенаДоллар,
	|	Ц2.Номенклатура.ЕдиницаХраненияОстатков
	|ИЗ
	|	Документ.ВводНачальныхОстатковПоРегиструЦеныНоменклатуры.ЦеныНоменклатуры КАК Ц2
	|ГДЕ
	|	Ц2.Ссылка = &Ссылка
	|	И Ц2.ЦенаДоллар > 0
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	Ц3.Ссылка.Дата,
	|	Ц3.Ссылка,
	|	&ТипЦенЕвро,
	|	Ц3.Номенклатура,
	|	&ВалютаЕвро,
	|	Ц3.ЦенаЕвро,
	|	Ц3.Номенклатура.ЕдиницаХраненияОстатков
	|ИЗ
	|	Документ.ВводНачальныхОстатковПоРегиструЦеныНоменклатуры.ЦеныНоменклатуры КАК Ц3
	|ГДЕ
	|	Ц3.Ссылка = &Ссылка
	|	И Ц3.ЦенаЕвро > 0"
	);
	Запрос.УстановитьПараметр("ТипЦенРубли", Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000001"));
	Запрос.УстановитьПараметр("ТипЦенДоллар", Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000002"));
	Запрос.УстановитьПараметр("ТипЦенЕвро", Справочники.ТипыЦенНоменклатуры.НайтиПоКоду("000000003"));
	Запрос.УстановитьПараметр("ВалютаРубль", Константы.ВалютаРубль.Получить());
	Запрос.УстановитьПараметр("ВалютаДоллар", Константы.ВалютаДоллар.Получить());
	Запрос.УстановитьПараметр("ВалютаЕвро", Константы.ВалютаРубль.Получить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	нз = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	нз.Отбор.Регистратор.ВидСравнения = ВидСравнения.Равно;
	нз.Отбор.Регистратор.Значение = Ссылка;
	нз.Отбор.Регистратор.Использование = Истина;
	
	нз.Загрузить(Запрос.Выполнить().Выгрузить());
	нз.Записать(Истина);
	
КонецПроцедуры
