
&НаСервере
Процедура ВнешнееСобытиеНаСервере()
	//Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	лКлючАлгоритма = "Документ_ВозвратТоваровОтПокупателя_ФормаСпискаУправляемая_ВнешнееСобытие";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	ВнешнееСобытиеНаСервере();
	Если Лев(Данные, 5) = "pkdvp" Тогда
		Док=ШтрихкодированиеДокументов.НайтиДокументПоШтрихкодуНомеруПериод(Данные,Ложь,Истина);
		Попытка
			Элементы.Список.ТекущаяСтрока=док.Ссылка;
		Исключение
		КонецПопытки;	
		ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		
		Если ТипЗнч(Док)=ТипЗнч(Документы.ВозвратТоваровОтПокупателя.ПустаяСсылка()) Тогда 
			СтруктураПризнакаПроверен = РаботаСоСтатусамиДокументов.ПолучитьПризнакПроверен(Док.Ссылка);
			Если СтруктураПризнакаПроверен <> Неопределено Тогда
				ДокументПроверен = СтруктураПризнакаПроверен.ПризнакПроверен;
			Иначе 
				ДокументПроверен=Ложь;
			КонецЕсли;
			Если Не ДокументПроверен  Тогда 
				РаботаСоСтатусамиДокументов.ИзменитьПризнакДокументПроверен(Док.Ссылка, Истина, ПараметрыСеанса.ТекущийПользователь);
				Сообщить("Найден документ "+Док.Номер+", от "+Док.Дата+". Сумма - "+Док.СуммаДокумента+". Помечен как проверен!");
			Иначе 
				Сообщить("Найден документ "+Док.Номер+", от "+Док.Дата+". Сумма - "+Док.СуммаДокумента +". Документ был обработан ранее, ни каких действий не предпринималось!");
			КонецЕсли;	
		Иначе 	
			//Сообщить("Не найден документ "+Док);
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
