// ЛНА
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("ТипПоставки");
	Поля.Добавить("Наименование");
	Поля.Добавить("IDSite");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТипПоставки = "";
	Если ЗначениеЗаполнено(Данные.ТипПоставки) Тогда
		
		лСоответствие = Новый Соответствие;
		лСоответствие.Вставить(Перечисления.ТипПоставки.Сток,	"[C] ");
		лСоответствие.Вставить(Перечисления.ТипПоставки.Кросс,	"[К] ");
		лСоответствие.Вставить(Перечисления.ТипПоставки.VMI,	"[V] ");
		лСоответствие.Вставить(Перечисления.ТипПоставки.ПополнениеСклада, "[П] ");
		
		СтрокаТипПоставки = лСоответствие.Получить(Данные.ТипПоставки);		
	КонецЕсли;
	
	СтрокаНаименование = Данные.Наименование;
	Если ЗначениеЗаполнено(Данные.IDSite) 
		И СтрДлина(СокрЛП(Данные.IDSite)) < 20 Тогда
		
		СтрокаНаименование = Данные.IDSite;
	КонецЕсли;	
	
	Представление = СтрокаТипПоставки + СтрокаНаименование;
КонецПроцедуры
