

Процедура ПередЗаписью(Отказ)
	
	//Если ОбменДанными.Загрузка Тогда
	//	Если ЦенаЗакупки = 0 Тогда
	//		ЦенаЗакупки = Цена;
	//	КонецЕсли;
	//	
	//	Если НЕ ЗначениеЗаполнено(ПрайсПоставщика) Тогда
	//		Склад = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заявка, "Склад");
	//		Если Склад = Справочники.Склады.НайтиПоКоду("000000132") Тогда
	//			ПрайсПоставщика = Справочники.ПрайсыПоставщиков.НайтиПоКоду(8555);
	//		Иначе
	//			ПрайсПоставщика = Справочники.ПрайсыПоставщиков.НайтиПоКоду(16);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если ЦенаЗакупки = 0 Тогда
		Если Цена > 0 Тогда
			ЦенаЗакупки = Цена;
			
		Иначе
			Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗаявкаПокупателяТовары.ЦенаЗакупки
			|ИЗ
			|	Документ.ЗаявкаПокупателя.Товары КАК ЗаявкаПокупателяТовары
			|ГДЕ
			|	ЗаявкаПокупателяТовары.Ссылка = &Ссылка
			|	И ЗаявкаПокупателяТовары.IDSite = &IDSite"
			);
			Запрос.УстановитьПараметр("Ссылка", Заявка);
			Запрос.УстановитьПараметр("IDSite", IDSite);
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Выборка.Следующий();
				ЦенаЗакупки = Выборка.ЦенаЗакупки;
				
			КонецЕсли;
			
		КонецЕсли;
									
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(ПрайсПоставщика) Тогда
		Склад = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Заявка, "Склад");
		Если Склад = Справочники.Склады.НайтиПоКоду("000000132") Тогда
			ПрайсПоставщика = Справочники.ПрайсыПоставщиков.ПолучитьСсылку(Новый УникальныйИдентификатор("0c0c75b3-7d41-4801-b163-8a1eada10048"));
		Иначе
			ПрайсПоставщика = Справочники.ПрайсыПоставщиков.ПолучитьСсылку(Новый УникальныйИдентификатор("f2469899-e682-11e5-80df-005056817b9c"));
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(Наименование) И НЕ ПустаяСтрока(IDSite) Тогда
		Наименование = IDSite;
	КонецЕсли;
	
	Если НЕ ЭтоНовый() И Количество = 0 Тогда
		Если Ссылка.Количество > 0 Тогда
			Количество = Ссылка.Количество;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьТипПоставки();
	
КонецПроцедуры

Процедура УстановитьТипПоставки()
	
	Если ТипПоставки.Пустая() Тогда
		Если ЗначениеЗаполнено(Заявка) И ЗначениеЗаполнено(Заявка.Контрагент) И ЗначениеЗаполнено(Заявка.Контрагент.Родитель) = Заявка.Контрагент.Родитель = "00005396" Тогда
			ТипПоставки = Перечисления.ТипПоставки.ПополнениеСклада;
		ИначеЕсли ПрайсПоставщика.Пустая() Тогда
			ТипПоставки = Перечисления.ТипПоставки.Сток;
		ИначеЕсли ПрайсПоставщика.Склад.Пустая() Тогда
			ТипПоставки = Перечисления.ТипПоставки.Кросс;
		ИначеЕсли ПрайсПоставщика.Склад.СкладVMI Тогда
			ТипПоставки = Перечисления.ТипПоставки.VMI;
		Иначе
			ТипПоставки = Перечисления.ТипПоставки.Кросс;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
КонецПроцедуры
