
Перем мЗарегистрироватьИзмененияДляСайта;

Процедура ПриЗаписи(Отказ)
	
	Если мЗарегистрироватьИзмененияДляСайта тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, Метаданные.ПланыОбмена.ОбменПартКом83_Сайт, "Справочник.ПараметрыФормированияЗаказовПоставщикам.МодульОбъекта.ПриЗаписи"); //Семенов И.П. 31.01.2019 XX-1768
	КонецЕсли;
	
	ДобавитьОбновитьЗаписьВРегистрДат();
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: ПараметрыФормированияЗаказовПоставщикам", Ложь) Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, Метаданные.ПланыОбмена.ОбменПартКом83_Сайт, "Справочник.ПараметрыФормированияЗаказовПоставщикам.МодульОбъекта.ПередУдалением"); //Семенов И.П. 31.01.2019 XX-1768
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: ПараметрыФормированияЗаказовПоставщикам", Ложь) Тогда
		мЗарегистрироватьИзмененияДляСайта = ОбменДаннымиКлиентСервер.НеобходимаРегистрацияИзменений(Метаданные.ПланыОбмена.ОбменПартКом83_Сайт, ЭтотОбъект);	
	КонецЕсли;
	
	Если ЭтоНовый() И ЭтоГруппа Тогда
		УстановитьНовыйКод("Г");
	КонецЕсли;
	
КонецПроцедуры


Процедура ДобавитьОбновитьЗаписьВРегистрДат() экспорт
	
	НаборЗаписей = РегистрыСведений.ДатыФормированияЗаказовПоставщикам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПараметрФормированияЗаказовПоставщикам.Установить(Ссылка);
	
	НаборЗаписей.Очистить();
	
	Наб = НаборЗаписей.Добавить();
	Наб.ПараметрФормированияЗаказовПоставщикам = Ссылка;
	Наб.ДатаФормирования = Дата(1,1,1);
	
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры

мЗарегистрироватьИзмененияДляСайта = Ложь;

