Процедура ЗарегистрироватьСообщение(ИдентификаторОтправителя, ИдентификаторПолучателя, СообщениеОбмена, НомерПринятого) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	Запись = РегистрыСведений.ИсторияОбменаССайтом_ЗаявкиПокупателей.СоздатьМенеджерЗаписи();
	Запись.Период = ТекущаяДата();
	Запись.ИдентификаторОтправителя = ИдентификаторОтправителя;
	Запись.ИдентификаторПолучателя = ИдентификаторПолучателя;
	Запись.СообщениеОбмена = СообщениеОбмена;
	Запись.НомерПринятого = НомерПринятого;
	Запись.Записать(Истина);
	
КонецПроцедуры