
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Дата77 = Дата(2018,1,1);
КонецПроцедуры

&НаСервере
Функция ЗагрузитьДокументНаСервере()
	 ДокументПродажи = ОбменДаннымиВызовСервера.ПолучитьДокументИз77(
	 Новый Структура("Номер77,Дата77,ПерезаполнятьШапку,ПерезаполнятьТЧТовары",
	 Номер77,Дата77,Истина,Истина));
	 
КонецФункции

&НаКлиенте
Процедура ЗагрузитьДокумент(Команда)
	ЗагрузитьДокументНаСервере();
	СтруктураПараметров = Новый Структура("ДокументСсылка, ИдентификаторФормы",ДокументПродажи, ИдентификаторФормыВладельца);
	Оповестить("ОбновитьДокументПродажиАРВ", СтруктураПараметров);
	Если ЗначениеЗаполнено(ДокументПродажи) Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИдентификаторФормыВладельца = Параметры.ИдентификаторФормыВладельца;
КонецПроцедуры
