
//#Если Сервер тогда

Перем мАдресВебСервиса;

Процедура ВыполнитьРегламентноеЗадание() Экспорт
	
	ЗагрузитьДанные();
	
	ЗагрузитьСтатусы();
	
КонецПроцедуры

Процедура ЗагрузитьДанные()
		
	Если НЕ ЗначениеЗаполнено(ИдентификаторУзлаОбмена) тогда
		ВызватьИсключение "Не заполнен реквизит ""Узел обмена"".";		
	КонецЕсли;
	
	// 21.03.19 Строганов Роман > 
	URIПространстваИмен = ПланыОбмена.ОбменПартКом83_TopLog.URIПространстваИмен();
	// 21.03.19 Строганов Роман <
	
	//Семенов И.П. 06.02.2019 XX-1768(
	Попытка
		//)Семенов И.П.
		лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog;
		лМенеджерПланаОбмена = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лМетаданныеПланаОбмена);
		
		лПолучатель = лМенеджерПланаОбмена.ЭтотУзел();
		лКодПолучателя = Число(лПолучатель.ИдентификаторУзла);
		
		лОтправитель = ОбменДаннымиКлиентСервер.ПолучитьВходящийУзелОбмена(лМетаданныеПланаОбмена, ИдентификаторУзлаОбмена);
		лКодОтправителя = лОтправитель.ИдентификаторУзла;
		лНомерПринятого = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(лОтправитель, "НомерПринятого");
		
		
		лОпределения = Новый WSОпределения(мАдресВебСервиса);
		лПрокси = Новый WSПрокси(лОпределения, лОпределения.Сервисы[0].URIПространстваИмен,
		лОпределения.Сервисы[0].Имя, лОпределения.Сервисы[0].ТочкиПодключения[0].Имя);
		
		лОтветСервера = лПрокси.GetExchangeMessage(лМетаданныеПланаОбмена.Имя, лКодПолучателя, лНомерПринятого);
		
		лСообщениеОбмена = лОтветСервера;
		ТекстСообщения = лОтветСервера;
		
		// без этого на сервере не работает почему то
		лТекстовыйДокумент = Новый ТекстовыйДокумент;
		лТекстовыйДокумент.УстановитьТекст(лСообщениеОбмена);
		лСообщениеОбмена = лТекстовыйДокумент.ПолучитьТекст();
		//Семенов И.П. 06.02.2019 XX-1768(
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(0,лОтправитель,"",,Истина,ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	//)Семенов И.П.
	
	НоваяСхемаОбмена = РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен (Общее)", "Новая схема обмена с ТопЛог");
	
	Если НоваяСхемаОбмена = Истина Тогда
		
		лТипСообщениеОбмена = ФабрикаXDTO.Тип(URIПространстваИмен, "СообщениеОбмена");
		лТипУдалениеОбъекта = ФабрикаXDTO.Тип(URIПространстваИмен, "УдалениеОбъекта");
		лЧтениеХМЛ = Новый ЧтениеXML;
		лЧтениеХМЛ.УстановитьСтроку(лСообщениеОбмена);
		
		лДанныеХДТО = ФабрикаXDTO.ПрочитатьXML(лЧтениеХМЛ, лТипСообщениеОбмена);
		ОбъектыXDTO = лДанныеХДТО.Объекты.ПолучитьСписок("Объект");
		
		ДатаСообщения = Неопределено; 
		НомерСообщения = лДанныеХДТО.НомерСообщения;
		
		// Тут сначала последовательно загружаются справочники "Водители", "Изготовители", "Номенклатура"
		лМенеджерПланаОбмена.ЗагрузитьСообщениеОбменаСправочники(лСообщениеОбмена, ДатаСообщения);
		
		ОбменССайтомСервер.РазобратьПолученныеОбъекты(ОбъектыXDTO, НомерСообщения, "ОбменПартКом83_TopLog", ЧислоПотоков, ДатаСообщения);
	Иначе
		лМенеджерПланаОбмена.ЗагрузитьСообщениеОбмена(лСообщениеОбмена);
	КонецЕсли;
	лУпаковщик = Неопределено;
	
КонецПроцедуры

Процедура ЗагрузитьСтатусы()
		
	Если НЕ ЗначениеЗаполнено(ИдентификаторУзлаОбмена) тогда
		ВызватьИсключение "Не заполнен реквизит ""Узел обмена"".";		
	КонецЕсли;
	
	// 21.03.19 Строганов Роман > 
	URIПространстваИмен = ПланыОбмена.ОбменПартКом83_TopLog_РТУ.URIПространстваИмен();
	// 21.03.19 Строганов Роман <
	
	//Семенов И.П. 07.02.2019 XX-1768(
	Попытка
		//)Семенов И.П.
		лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog_РТУ;
		лМенеджерПланаОбмена = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лМетаданныеПланаОбмена);
		
		лПолучатель = лМенеджерПланаОбмена.ЭтотУзел();
		лКодПолучателя = Число(лПолучатель.ИдентификаторУзла);
		
		лОтправитель = ОбменДаннымиКлиентСервер.ПолучитьВходящийУзелОбмена(лМетаданныеПланаОбмена, ИдентификаторУзлаОбмена);
		лКодОтправителя = лОтправитель.ИдентификаторУзла;
		лНомерПринятого = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(лОтправитель, "НомерПринятого");
		
		
		лОпределения = Новый WSОпределения(мАдресВебСервиса);
		лПрокси = Новый WSПрокси(лОпределения, лОпределения.Сервисы[0].URIПространстваИмен,
		лОпределения.Сервисы[0].Имя, лОпределения.Сервисы[0].ТочкиПодключения[0].Имя);
		
		лОтветСервера = лПрокси.GetExchangeMessage(лМетаданныеПланаОбмена.Имя, лКодПолучателя, лНомерПринятого);
		
		лСообщениеОбмена = лОтветСервера;
		ТекстСообщения = лОтветСервера;
		
		// без этого на сервере не работает почему то
		лТекстовыйДокумент = Новый ТекстовыйДокумент;
		лТекстовыйДокумент.УстановитьТекст(лСообщениеОбмена);
		лСообщениеОбмена = лТекстовыйДокумент.ПолучитьТекст();
		//Семенов И.П. 07.02.2019 XX-1768(
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(0,лОтправитель,"",,Истина,ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	//)Семенов И.П.
	
	// 06.05.19 Строганов Роман > 
	НоваяСхемаОбмена = РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен (Общее)", "Новая схема обмена с ТопЛог (РТУ)");
	
	Если НоваяСхемаОбмена = Истина Тогда
		
		лТипСообщениеОбмена = ФабрикаXDTO.Тип(URIПространстваИмен, "СообщениеОбмена");
		лТипУдалениеОбъекта = ФабрикаXDTO.Тип(URIПространстваИмен, "УдалениеОбъекта");
		лЧтениеХМЛ = Новый ЧтениеXML;
		лЧтениеХМЛ.УстановитьСтроку(лСообщениеОбмена);
		
		лДанныеХДТО = ФабрикаXDTO.ПрочитатьXML(лЧтениеХМЛ, лТипСообщениеОбмена);
		ОбъектыXDTO = лДанныеХДТО.Объекты.ПолучитьСписок("Объект");
		
		ДатаСообщения = Неопределено; 
		НомерСообщения = лДанныеХДТО.НомерСообщения;
		
		лОтправитель = ОбменДаннымиКлиентСервер.ПолучитьВходящийУзелОбмена("ОбменПартКом83_TopLog_РТУ", ИдентификаторУзлаОбмена);
		ОбменДаннымиКлиентСервер.ЗафиксироватьСообщениеВИсторииОбмена(лДанныеХДТО.НомерСообщения, лОтправитель, лСообщениеОбмена,,,,ДатаСообщения, ОбъектыXDTO.Количество());
		
		// 20.05.19 Строганов Роман >  Зафиксировать начало чтения сообщения
		лТекстШаблона = ПолучитьОбщийМакет("ЗаголовокСообщенияОбмена").ПолучитьТекст();
		лТекстПустышки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		лТекстШаблона, "ОбменПартКом83_TopLog_РТУ", лПолучатель.Код,
		лОтправитель.Код, Формат(лДанныеХДТО.НомерСообщения, "ЧГ="), "0");
		
		лПустышка = Новый ЧтениеXML;
		лПустышка.УстановитьСтроку(лТекстПустышки);
		
		лЧтениеСообщения = ПланыОбмена.СоздатьЧтениеСообщения();
		лЧтениеСообщения.НачатьЧтение(лПустышка, ДопустимыйНомерСообщения.Больший);
		// 20.05.19 Строганов Роман <
		
		ОбменССайтомСервер.РазобратьПолученныеОбъекты(ОбъектыXDTO, НомерСообщения, "ОбменПартКом83_TopLog_РТУ", ЧислоПотоков, ДатаСообщения);
		
		лЧтениеСообщения.ЗакончитьЧтение();
	Иначе
		лМенеджерПланаОбмена.ЗагрузитьСообщениеОбмена(лСообщениеОбмена);
	КонецЕсли;
	// 06.05.19 Строганов Роман <
	
КонецПроцедуры

Если ОбщегоНазначения.ЭтоРабочаяИнформационнаяБаза() Тогда 
	мАдресВебСервиса = Справочники.НастройкиРеквизитовДляОбменов.Обмен_1С_ТопЛог.СтрокаДляРабочейБазы;
Иначе
	мАдресВебСервиса = Справочники.НастройкиРеквизитовДляОбменов.Обмен_1С_ТопЛог.СтрокаДляТестовойБазы;
КонецЕсли;

//#КонецЕсли
