
Функция ДоступныеДляИнтерактивногоВыбора() Экспорт
	
	СЗ = Новый СписокЗначений;
	СЗ.Добавить(Справочники.ТипыДоставки.ДоставкаВодителем);
	СЗ.Добавить(Справочники.ТипыДоставки.ДоставкаТК);
	СЗ.Добавить(Справочники.ТипыДоставки.Самовывоз);
	СЗ.Добавить(Справочники.ТипыДоставки.ЭкспрессДоставка);
	СЗ.Добавить(Справочники.ТипыДоставки.МежскладскаяДоставка);
	СЗ.Добавить(Справочники.ТипыДоставки.СамовывозСТочкиВыдачи);
	
	Возврат СЗ;
	
КонецФункции



Функция ВыгрузитьЭлементы(ТаблицаСсылокНаОбъекты, МетаданныеПланаОбмена = Неопределено, ВыгружаемыеОбъекты = Неопределено) Экспорт
	
	лКлючАлгоритма = "Справочник_ТипыДоставки_МодульМенеджера_ВыгрузитьЭлементы";
	 лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	 Если Не лЗамена = Неопределено Тогда
	 	АлгоритмыЗначениеВозврата = Неопределено;		
	 	Выполнить(лЗамена);		
	 	Возврат АлгоритмыЗначениеВозврата;		
	 КонецЕсли;	
	 
	 МассивОбъектов = новый массив;
	 ТипОбъектаXDTO = ФабрикаXDTO.Тип(ОбменССайтомСервер.ПространствоИмен(), "CatalogObject.ТипыДоставки");
	 
	 ////////////////////////////////////////////////
	 //#XX-2108 Kalinin V.A. ( 2019-03-26 )
	 //Пришлось переписатьт , т.к сайт не понимает префиксов 
	 Для Каждого ТипДоставки  из ТаблицаСсылокНаОбъекты цикл		 
		 ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
		 СерилизуемыйОбъект   = СериализаторXDTO.ЗаписатьXDTO(ТипДоставки.Ссылка.ПолучитьОбъект());
		 ЗаполнитьЗначенияСвойств(ОбъектXDTO,СерилизуемыйОбъект,,"Ref");
		 ОбъектXDTO.Ref =  ТипДоставки.Ссылка.уникальныйидентификатор();
		 МассивОбъектов.Добавить(ОбъектXDTO);
	 КонецЦикла;
	 
	 Возврат МассивОбъектов;
	
КонецФункции
