
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ТаблицаПодбора) и ЗначениеЗаполнено(Параметры.Артикул) тогда 	
		 пТаблицаПодбора = Параметры.ТаблицаПодбора;
		НайдСтроки =  Параметры.ТаблицаПодбора.НайтиСтроки(Новый Структура("Артикул",Параметры.Артикул));
		ЗначениеВРеквизитФормы(пТаблицаПодбора.Скопировать(НайдСтроки),"ТаблицаПодбора");
	КонецЕсли;	
		
		
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
Закрыть(Элементы.ТаблицаПодбора.ТекущиеДанные.Номенклатура);	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодбораВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Закрыть(ТаблицаПодбора[Значение].Номенклатура);	
КонецПроцедуры
