
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	лКлючАлгоритма = "Документ_ПоступлениеТоваровУслуг_ФормаПодбораСтрокЗагрузки_ПриСозданииНаСервере";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////	
	
	Если ЗначениеЗаполнено(Параметры.ТаблицаПодбора) и ЗначениеЗаполнено(Параметры.Артикул) тогда 	
		 пТаблицаПодбора = Параметры.ТаблицаПодбора;
		НайдСтроки =  Параметры.ТаблицаПодбора.НайтиСтроки(Новый Структура("Артикул",Параметры.Артикул));
		ЗначениеВРеквизитФормы(пТаблицаПодбора.Скопировать(НайдСтроки),"ТаблицаПодбора");
	КонецЕсли;	
		
		
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	лКлючАлгоритма = "Документ_ПоступлениеТоваровУслуг_ФормаПодбораСтрокЗагрузки_Выбрать";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////	
	Закрыть(Элементы.ТаблицаПодбора.ТекущиеДанные.Номенклатура);	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПодбораВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	лКлючАлгоритма = "Документ_ПоступлениеТоваровУслуг_ФормаПодбораСтрокЗагрузки_ТаблицаПодбораВыборЗначения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////	
	Закрыть(ТаблицаПодбора[Значение].Номенклатура);	
КонецПроцедуры
