#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	Справочники.ИдентификаторыОбъектовМетаданных.ПередЗаписьюОбъекта(ЭтотОбъект);
//Если КлючОбъектаМетаданных = Неопределено
//         Тогда
//    
//    ЭтотОбъект.КлючОбъектаМетаданных = Новый ХранилищеЗначения(Тип("ОтчетОбъект.РасчетыСКлиентами"));
//   КонецЕсли;	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Справочники.ИдентификаторыОбъектовМетаданных.ПередУдалениемОбъекта(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
