

#Область Команды

Функция ВыполнитьКомандуДляЗадачи( пКоманда, пФорма ) Экспорт
	
	успешно = Истина;
	
	ДокументОбъект = ДанныеФормыВЗначение(пФорма.Объект, Тип("ДокументОбъект.АктРассмотренияВозврата"));
	
	//Проверим что выполняются условия для изменения статуса
	Результат = Неопределено;
	Для каждого СтрокаУсловия Из пКоманда.ТаблицаУсловий Цикл
		
		Выполнить(СтрокаУсловия.Условие);
		
		Если Результат = Неопределено Тогда
			ТекстОшибки = "Команда "+пКоманда.Наименование+". Не определен результат в условии """+СтрокаУсловия.Наименование+""" ("+СтрокаУсловия.Код+")!";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки,,,СтатусСообщения.ОченьВажное);
			Успешно =  Ложь;
		КонецЕсли;
		
		Если Результат <>  СтрокаУсловия.Результат Тогда
			ТекстОшибки = "Команда "+пКоманда.Наименование+". Не выполнено условие """+СтрокаУсловия.Наименование+""" ("+СтрокаУсловия.Код+")!";
			ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки,,,СтатусСообщения.ОченьВажное);
			Успешно =  Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	//Алгоритм перед установкой нового статуса
	Для каждого СтрокаАлгоритма Из пКоманда.СледующийСтатус.ТаблицаАлгоритмов Цикл
		
		Если СтрокаАлгоритма.МоментВыполненияАлгоритма = Перечисления.МоментыВыполненияАлгоритма.ПередУстановкойСтатуса Тогда
			
			Попытка
				Выполнить(СтрокаАлгоритма.Алгоритм.Алгоритм);
			Исключение
				ТекстОшибки = "Команда "+пКоманда.Наименование+". Ошибка выполнения алгоритма перед установкой статуса """+СтрокаАлгоритма.Алгоритм+""" ("+СтрокаАлгоритма.Алгоритм.Код+")! Описание ошибки: "+ОписаниеОшибки();
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки,,,СтатусСообщения.ОченьВажное);
				Успешно =  Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ДокументОбъект.СтатусДокумента = пКоманда.СледующийСтатус;
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	//Алгоритм После установки нового статуса
	Для каждого СтрокаАлгоритма Из пКоманда.СледующийСтатус.ТаблицаАлгоритмов Цикл
		
		Если СтрокаАлгоритма.МоментВыполненияАлгоритма = Перечисления.МоментыВыполненияАлгоритма.ПослеУстановкиСтатуса Тогда
			
			Попытка
				Выполнить(СтрокаАлгоритма.Алгоритм.Алгоритм);
			Исключение
				ТекстОшибки = "Команда "+пКоманда.Наименование+". Ошибка выполнения алгоритма после установки статуса """+СтрокаАлгоритма.Алгоритм+""" ("+СтрокаАлгоритма.Алгоритм.Код+")! Описание ошибки: "+ОписаниеОшибки();
				ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки,,,СтатусСообщения.ОченьВажное);
				Успешно =  Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВДанныеФормы(ДокументОбъект, пФорма.Объект);
	
	//массивОбработчиков = Справочники.упКоманды.ПолучитьМассивОбработчиков( пКоманда );
	//
	//Если массивОбработчиков.Количество() = 0 Тогда
	//	
	//	Возврат успешно;
	//	
	//КонецЕсли;
	//
	//успешно = упАлгоритмыКлиентСервер.ВыполнитьМассивАлгоритмов( массивОбработчиков , структураЗадачи );
	//
	//Если Не успешно Тогда
	//	Возврат успешно;
	//КонецЕсли;
	//
	//Попытка
	//	
	//	упУправлениеЗадачамиКлиентСервер.ЗаписатьСтруктуруВЗадачу( структураЗадачи , пЗадача );
	//	
	//Исключение
	//	
	//	упЯдроПроцессаВызовСервера.Ошибка( НСтр( "ru='Ошибка записи изменений в задачу.'" ) , , пЗадача, ИнформацияОбОшибке() );
	//	
	//	Возврат Ложь;
	//	
	//КонецПопытки;
	//
	//Если пЗавершатьЗадачу Тогда
	//	
	//	успешно = упЯдроПроцесса.ЗавершитьЗадачу( пЗадача );
	//	
	//КонецЕсли;
	
	Возврат успешно;
	
КонецФункции

Функция ВыполнитьКомандуДляЗадачиВТранзакции( пКоманда, пФорма ) Экспорт
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	
	успешно = ВыполнитьКомандуДляЗадачи(пКоманда, пФорма);
	
	Если успешно Тогда
		ЗафиксироватьТранзакцию();
	Иначе
		ОтменитьТранзакцию();
	КонецЕсли;
	
КонецФункции

#КонецОбласти