

Процедура ДобавитьКРассылкеПроизвольноеПисьмо(ТемаПисьма,ТекстПисьма,ОбъектРассылки = Неопределено ,Получатели = "", Ответственный = Неопределено) Экспорт

	Если Ответственный = неопределено Тогда
	    Ответственный = ПараметрыСеанса.ТекущийПользователь
	КонецЕсли;
	Если ОбъектРассылки = Неопределено  Тогда
	     ОбъектРассылки = СокрЛП(Новый УникальныйИдентификатор);
	 КонецЕсли;
	 
	НовоеПисьмо = РегистрыСведений.ИсторияОтправкиПисемПоставщикам.СоздатьМенеджерЗаписи();
	
	НовоеПисьмо.ДатаРегистрации = ТекущаяДата();
	НовоеПисьмо.Ответственный = Ответственный;
	НовоеПисьмо.Отправлен = Ложь;
	НовоеПисьмо.Ошибка = Ложь;
	НовоеПисьмо.Объект = ОбъектРассылки;
	НовоеПисьмо.АдресПоставщика = Получатели;
	НовоеПисьмо.ОтправленныеДанные = новый ХранилищеЗначения(новый Структура("ТемаПисьма,ТекстПисьма",ТемаПисьма,ТекстПисьма));
	НовоеПисьмо.Записать(Истина);	
	
КонецПроцедуры	
