////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Для внутреннего использования
//
Процедура ПроверитьНедопустимыеСимволыВИмениПользователяWSПрокси(Знач ИмяПользователя) Экспорт
	
	Если СтрокаСодержитСимвол(ИмяПользователя, НедопустимыеСимволыВИмениПользователяWSПрокси()) Тогда
		
		СтрокаСообщения = НСтр("ru = 'В имени пользователя %1 содержатся недопустимые символы.
			|Имя пользователя не должно содержать символы %2.'"
		);
		СтрокаСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(СтрокаСообщения,
			ИмяПользователя, НедопустимыеСимволыВИмениПользователяWSПрокси()
		);
		ВызватьИсключение СтрокаСообщения;
	КонецЕсли;
	
КонецПроцедуры

// Для внутреннего использования
//
Функция НедопустимыеСимволыВИмениПользователяWSПрокси() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.2.17.0") > 0 Тогда
		Возврат ":";
	Иначе
		Возврат "@/\[]#&*?:;=";
	КонецЕсли;
	
КонецФункции

// Для внутреннего использования
//
Функция СтрокаСодержитСимвол(Знач Строка, Знач СтрокаСимволов)
	
	Для Индекс = 1 По СтрДлина(СтрокаСимволов) Цикл
		
		Символ = Сред(СтрокаСимволов, Индекс, 1);
		
		Если Найти(Строка, Символ) <> 0 Тогда
			
			Возврат Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция ЕстьРазличияСсылкиИОбъекта(вхОбъект, вхМетаданныеПланаОбмена, выхПредставлениеРазличий = -1) Экспорт
	
	лМетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(вхОбъект));
	Если (лМетаданныеОбъекта = Неопределено) тогда
		ВызватьИсключение "[ЕстьРазличияСсылкиИОбъекта]: неправильный параметр номер 1.";
	КонецЕсли;
	
	Если вхОбъект.ЭтоНовый() тогда
		Если (выхПредставлениеРазличий <> -1) тогда
			выхПредставлениеРазличий = "новый объект"; 
		КонецЕсли;
		Возврат Истина;
	КонецЕсли;
	
	лЭтоДокумент = Ложь;
	Если Метаданные.Документы.Содержит(лМетаданныеОбъекта) тогда
		Если (лМетаданныеОбъекта.Проведение = Метаданные.СвойстваОбъектов.Проведение.Разрешить) тогда
			лЭтоДокумент = Истина;
		КонецЕсли;
	КонецЕсли;
	
	лМенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лМетаданныеОбъекта);
	лЗначенияРеквизитовКонтроля = лМенеджерОбъекта.ПолучитьЗначенияРеквизитовКонтроля(вхОбъект.Ссылка, вхМетаданныеПланаОбмена);
	
	Если (лЗначенияРеквизитовКонтроля = Неопределено) тогда
		ВызватьИсключение "[ЕстьРазличияСсылкиИОбъекта]: неправильный параметр номер 2.";
	КонецЕсли;
	
	лШапка = Неопределено;
	Если лЗначенияРеквизитовКонтроля.Свойство("Шапка", лШапка) тогда
		Для Каждого лЭлементСтруктуры Из лШапка цикл
			
			лСтароеЗначение = лЭлементСтруктуры.Значение;
			лНовоеЗначение = вхОбъект[лЭлементСтруктуры.Ключ];
			
			// свойство документа "Проведен" нужно обрабатывать по особому
			Если лЭтоДокумент И (ВРег(лЭлементСтруктуры.Ключ) = "ПРОВЕДЕН") тогда
				лРежимЗаписи = Неопределено;
				Если ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(
					вхОбъект.ДополнительныеСвойства, "РежимЗаписи", лРежимЗаписи) тогда
					Если (ТипЗнч(лРежимЗаписи) = Тип("РежимЗаписиДокумента")) тогда
						Если (лРежимЗаписи = РежимЗаписиДокумента.Проведение) тогда
							лНовоеЗначение = Истина;
						ИначеЕсли (лРежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) тогда
							лНовоеЗначение = Ложь;
						КонецЕсли;
					КонецЕсли;				
				КонецЕсли;
			КонецЕсли;
			
			Если (лСтароеЗначение <> лНовоеЗначение) тогда
				Если (выхПредставлениеРазличий <> -1) тогда
					лПредставлениеСтароеЗначение = ?(ЗначениеЗаполнено(лСтароеЗначение), "" + лСтароеЗначение, "<пусто!>");
					лПредставлениеНовоеЗначение = ?(ЗначениеЗаполнено(лНовоеЗначение), "" + лНовоеЗначение, "<пусто!>");
					лПредставлениеРасхождения = """" + лЭлементСтруктуры.Ключ + """: " + лПредставлениеСтароеЗначение + " <> " + лПредставлениеНовоеЗначение;
					Если ЗначениеЗаполнено(выхПредставлениеРазличий) тогда
						выхПредставлениеРазличий = выхПредставлениеРазличий + Символы.ПС + лПредставлениеРасхождения; 
					Иначе
						выхПредставлениеРазличий = лПредставлениеРасхождения; 
					КонецЕсли;
				Иначе
					Возврат Истина;	
				КонецЕсли;
				//Возврат Истина;
			КонецЕсли;
			
		КонецЦикла;			
		
		Если (выхПредставлениеРазличий <> -1) тогда
			Если СтрНайти(выхПредставлениеРазличий,"<>") > 0 тогда
				Возврат Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	лТабличныеЧасти = Неопределено;
	Если лЗначенияРеквизитовКонтроля.Свойство("ТабличныеЧасти", лТабличныеЧасти) тогда
		Для Каждого лЭлементСтруктуры Из лТабличныеЧасти цикл
			
			лИсходная = лЭлементСтруктуры.Значение;
			
			лКолонки = "";
			Для Каждого лКолонка Из лИсходная.Колонки цикл
				лКолонки = лКолонки + лКолонка.Имя + ",";
			КонецЦикла;
			
			Если НЕ ПустаяСтрока(лКолонки) тогда
				лКолонки = Лев(лКолонки, СтрДлина(лКолонки) - 1);
			КонецЕсли;
			
			лТребуемая = вхОбъект[лЭлементСтруктуры.Ключ].Выгрузить(, лКолонки);
			лДобавить = Неопределено;
			лУдалить = Неопределено;
			
			Если НЕ РаботаСПоследовательностямиКлиентСервер.ТаблицыИдентичны(лИсходная, лТребуемая, лДобавить, лУдалить) тогда
				Если (выхПредставлениеРазличий <> -1) тогда
					выхПредставлениеРазличий = "табличная часть """ + лЭлементСтруктуры.Ключ + """"; 
				КонецЕсли;
				Возврат Истина;
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;		
	
	Возврат Ложь;
	
КонецФункции

Функция НеобходимаРегистрацияИзменений(вхПланОбмена, вхОбъектРегистрации, выхПредставлениеРазличий = -1) Экспорт
	
	лМетаданныеПланаОбмена = Неопределено;
	лТип = ТипЗнч(вхПланОбмена);
	Если (лТип = Тип("Строка")) тогда
		лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.Найти(вхПланОбмена);
	ИначеЕсли (лТип = Тип("ОбъектМетаданных")) И Метаданные.ПланыОбмена.Содержит(вхПланОбмена) тогда
		лМетаданныеПланаОбмена = вхПланОбмена;
	КонецЕсли;
	
	Если (лМетаданныеПланаОбмена = Неопределено) тогда
		ВызватьИсключение "[НеобходимаРегистрацияИзменений]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лТипОбъекта = ТипЗнч(вхОбъектРегистрации);
	Если (лТипОбъекта = Тип("УдалениеОбъекта")) тогда
		Возврат Истина;
	КонецЕсли;
	
	лМетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(вхОбъектРегистрации));
	Если (лМетаданныеОбъекта = Неопределено) тогда
		ВызватьИсключение "[НеобходимаРегистрацияИзменений]: неправильный параметр номер 2.";
	КонецЕсли;
	
	Если НЕ лМетаданныеПланаОбмена.Состав.Содержит(лМетаданныеОбъекта) тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если вхОбъектРегистрации.ДополнительныеСвойства.Свойство("ОтключитьМеханизмРегистрацииОбъектов") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЕстьРазличияСсылкиИОбъекта(вхОбъектРегистрации, лМетаданныеПланаОбмена, выхПредставлениеРазличий);	
	
КонецФункции

Функция НеобходимаРегистрацияИзмененийНовое(вхПланОбмена, вхОбъектРегистрации) Экспорт 
	лМетаданныеПланаОбмена = Неопределено;
	лТип = ТипЗнч(вхПланОбмена);
	Если (лТип = Тип("Строка")) тогда
		лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.Найти(вхПланОбмена);
	ИначеЕсли (лТип = Тип("ОбъектМетаданных")) И Метаданные.ПланыОбмена.Содержит(вхПланОбмена) тогда
		лМетаданныеПланаОбмена = вхПланОбмена;
	КонецЕсли;
	
	Если (лМетаданныеПланаОбмена = Неопределено) тогда
		ВызватьИсключение "[НеобходимаРегистрацияИзменений]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лТипОбъекта = ТипЗнч(вхОбъектРегистрации);
	Если (лТипОбъекта = Тип("УдалениеОбъекта")) тогда
		Возврат Истина;
	КонецЕсли;
	
	лМетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(вхОбъектРегистрации));
	Если (лМетаданныеОбъекта = Неопределено) тогда
		ВызватьИсключение "[НеобходимаРегистрацияИзменений]: неправильный параметр номер 2.";
	КонецЕсли;
	
	Если НЕ лМетаданныеПланаОбмена.Состав.Содержит(лМетаданныеОбъекта) тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтарыеЗначения = Новый Структура;
	
	Если Не ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхОбъектРегистрации.ДополнительныеСвойства,"СтарыеЗначения", СтарыеЗначения) Тогда 
		Возврат Истина;
	КонецЕсли;
	
	лМенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лМетаданныеОбъекта);
	лШапка = Неопределено;
	Если СтарыеЗначения.Свойство("Шапка", лШапка) тогда
		Для Каждого лЭлементСтруктуры Из лШапка цикл
			лСтароеЗначение = лЭлементСтруктуры.Значение;
			лНовоеЗначение = вхОбъектРегистрации[лЭлементСтруктуры.Ключ];
			Если лСтароеЗначение <> лНовоеЗначение Тогда 
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьУзлыРегистрации(вхПланОбмена, вхУзлы, вхКромеУзлов)
	
	лМетаданныеПланаОбмена = Неопределено;
	лТип = ТипЗнч(вхПланОбмена);
	Если (лТип = Тип("Строка")) тогда
		лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.Найти(вхПланОбмена);
	ИначеЕсли (лТип = Тип("ОбъектМетаданных")) И Метаданные.ПланыОбмена.Содержит(вхПланОбмена) тогда
		лМетаданныеПланаОбмена = вхПланОбмена;
	КонецЕсли;
	
	Если (лМетаданныеПланаОбмена = Неопределено) тогда
		ВызватьИсключение "[ПолучитьСписокУзлов]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лМенеджерПланаОбмена = ПланыОбмена[лМетаданныеПланаОбмена.Имя];
	
	лУзлы = Неопределено;
	лТипУзлы = ТипЗнч(вхУзлы);
	Если (лТипУзлы = Тип("Массив")) тогда
		лУзлы = вхУзлы;
	ИначеЕсли (лТипУзлы = Тип("СписокЗначений")) тогда
		лУзлы = вхУзлы.ВыгрузитьЗначения();
	ИначеЕсли (лТипУзлы = Тип("ПланОбменаСсылка." + лМетаданныеПланаОбмена.Имя)) тогда
		лУзлы = Новый Массив;
		лУзлы.Добавить(вхУзлы);
	КонецЕсли;
	лВсеУзлы = (лУзлы = Неопределено);
	
	лКромеУзлов = Неопределено;
	лТипКромеУзлов = ТипЗнч(вхКромеУзлов);
	Если (лТипКромеУзлов = Тип("Массив")) тогда
		лКромеУзлов = вхКромеУзлов;
	ИначеЕсли (лТипКромеУзлов = Тип("СписокЗначений")) тогда
		лКромеУзлов = вхКромеУзлов.ВыгрузитьЗначения();
	ИначеЕсли (лТипКромеУзлов = Тип("ПланОбменаСсылка." + лМетаданныеПланаОбмена.Имя)) тогда
		лКромеУзлов = Новый Массив;
		лКромеУзлов.Добавить(вхКромеУзлов);
	КонецЕсли;
	лНетКромеУзлов = (лКромеУзлов = Неопределено);
	
	лЗапрос = Новый Запрос;
	лЗапрос.УстановитьПараметр("ЭтотУзел", лМенеджерПланаОбмена.ЭтотУзел());
	лЗапрос.УстановитьПараметр("Узлы", лУзлы);
	лЗапрос.УстановитьПараметр("ВсеУзлы", лВсеУзлы);
	лЗапрос.УстановитьПараметр("КромеУзлов", лКромеУзлов);
	лЗапрос.УстановитьПараметр("НетКромеУзлов", лНетКромеУзлов);
	лТекстЗапроса = 
	"ВЫБРАТЬ
	|	Т.Ссылка
	|ИЗ
	|	ПланОбмена." + лМетаданныеПланаОбмена.Имя + " КАК Т
	|ГДЕ
	|	НЕ Т.ПометкаУдаления";
	
	лРеквизитИсходящий = лМетаданныеПланаОбмена.Реквизиты.Найти("Исходящий");
	лОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	Если (лРеквизитИсходящий <> Неопределено) И (лРеквизитИсходящий.Тип = лОписаниеТиповБулево) тогда
		лТекстЗапроса = лТекстЗапроса + "
		|	И Т.Исходящий";
	КонецЕсли;
	
	лТекстЗапроса = лТекстЗапроса + "
	|	И Т.Ссылка <> &ЭтотУзел
	|	И (Т.Ссылка В (&Узлы)
	|			ИЛИ &ВсеУзлы)
	|	И (НЕ Т.Ссылка В (&КромеУзлов)
	|			ИЛИ &НетКромеУзлов)";
	лЗапрос.Текст = лТекстЗапроса;
	
	Возврат лЗапрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
КонецФункции

Процедура ЗарегистрироватьОбъектВУзлах(вхОбъект, вхПланОбмена, вхУзлы = Неопределено, вхКромеУзлов = Неопределено, КонтекстВызова = "") Экспорт //Семенов И.П. 31.01.2019 XX-1768 КонтекстВызова
	
	лМетаданныеПланаОбмена = Неопределено;
	лТип = ТипЗнч(вхПланОбмена);
	Если (лТип = Тип("Строка")) тогда
		лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.Найти(вхПланОбмена);
	ИначеЕсли (лТип = Тип("ОбъектМетаданных")) И Метаданные.ПланыОбмена.Содержит(вхПланОбмена) тогда
		лМетаданныеПланаОбмена = вхПланОбмена;
	КонецЕсли;
	
	Если (лМетаданныеПланаОбмена = Неопределено) тогда
		ВызватьИсключение "[ЗарегистрироватьОбъект]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лУзлыРегистрации = ПолучитьУзлыРегистрации(лМетаданныеПланаОбмена, вхУзлы, вхКромеУзлов);
	Если (лУзлыРегистрации.Количество() > 0) тогда
		//Семенов И.П. 31.01.2019 XX-1768(
		//ПланыОбмена.ЗарегистрироватьИзменения(лУзлыРегистрации, вхОбъект.Ссылка);
		ЗарегистрироватьИзмененияВПланеОбмена(лУзлыРегистрации, вхОбъект.Ссылка, КонтекстВызова);
		//)Семенов И.П.
		Если (лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом77_83) тогда
			
			лПредставлениеРазличий = "";
			лЕстьПредставлениеРазличий = ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(
			вхОбъект.ДополнительныеСвойства, "ПредставлениеРазличий", лПредставлениеРазличий);
			Если НЕ лЕстьПредставлениеРазличий тогда
				лПредставлениеРазличий = "<нет данных!>";
			КонецЕсли;
			
			лДобавляемаяСтрока = "Регистрация: " + вхОбъект + " (" + лПредставлениеРазличий + "), " + ПараметрыСеанса.ТекущийПользователь;
			НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
			Попытка
				ОбменДаннымиВызовСервера.ДобавитьЗаписьВЛог_ОбменПартКом77_83(лДобавляемаяСтрока);
				ЗафиксироватьТранзакцию();
			Исключение
				ОтменитьТранзакцию();
			КонецПопытки;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗарегистрироватьОбъект(вхОбъект, вхПланОбмена, КонтекстВызова="") Экспорт //Семенов И.П. 31.01.2019 XX-1768 КонтекстВызова
	ЗарегистрироватьОбъектВУзлах(вхОбъект, вхПланОбмена, , вхОбъект.ОбменДанными.Отправитель, КонтекстВызова); //Семенов И.П. 31.01.2019 XX-1768 КонтекстВызова	
КонецПроцедуры

Функция ВыбратьИзмененияДляУзлаОбмена(вхУзелОбмена, вхНомерСообщения) Экспорт
	
	лМетаданныеПланаОбмена = Метаданные.НайтиПоТипу(ТипЗнч(вхУзелОбмена));
	Если (лМетаданныеПланаОбмена = Неопределено) ИЛИ НЕ Метаданные.ПланыОбмена.Содержит(лМетаданныеПланаОбмена) тогда
		ВызватьИсключение "[ВыбратьИзмененияДляУзлаОбмена]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лМенеджерПланаОбмена = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лМетаданныеПланаОбмена);
	Если (вхУзелОбмена = лМенеджерПланаОбмена.ЭтотУзел()) тогда
		ВызватьИсключение "[ВыбратьИзмененияДляУзлаОбмена]: неправильный параметр номер 1.";
	КонецЕсли;
		
	Результат = Новый Соответствие;
	лВыборка = ПланыОбмена.ВыбратьИзменения(вхУзелОбмена, вхНомерСообщения);
	Для Каждого лЭлементСостава Из лМетаданныеПланаОбмена.Состав цикл
		лОбъектМетаданных = лЭлементСостава.Метаданные;
		лИмяТаблицы = лОбъектМетаданных.ПолноеИмя();
		Если ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(лОбъектМетаданных) тогда
			
			лЗапрос = Новый Запрос;
			лЗапрос.УстановитьПараметр("Узел", вхУзелОбмена);
			лЗапрос.УстановитьПараметр("НомерСообщения", вхНомерСообщения);
			лЗапрос.Текст = 
			"ВЫБРАТЬ
			|	Т.Ссылка,
			|	ВЫБОР
			|		КОГДА Т.Ссылка В (ВЫБРАТЬ Ссылка ИЗ " + лИмяТаблицы + ") ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК ЭтоУдаление
			|ПОМЕСТИТЬ
			|	Объекты
			|ИЗ
			|	" + лИмяТаблицы + ".Изменения КАК Т
			|ГДЕ
			|	Т.Узел = &Узел
			|	И Т.НомерСообщения <= &НомерСообщения;      
			|ВЫБРАТЬ Ссылка ИЗ Объекты ГДЕ НЕ ЭтоУдаление;
			|ВЫБРАТЬ Ссылка ИЗ Объекты ГДЕ ЭтоУдаление;
			|УНИЧТОЖИТЬ Объекты";
			
			НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый); // read committed
			лРезультатыЗапросов = лЗапрос.ВыполнитьПакет();
			ЗафиксироватьТранзакцию();
						
			лРезультат = Новый Структура;
			Если НЕ лРезультатыЗапросов[1].Пустой() тогда
				лРезультат.Вставить("Объекты", лРезультатыЗапросов[1].Выгрузить().ВыгрузитьКолонку(0));
			КонецЕсли;
			Если НЕ лРезультатыЗапросов[2].Пустой() тогда
				лРезультат.Вставить("Удаленные", лРезультатыЗапросов[2].Выгрузить().ВыгрузитьКолонку(0));
			КонецЕсли;
			
			Если (лРезультат.Количество() > 0) тогда
				Результат.Вставить(лОбъектМетаданных, лРезультат);
			КонецЕсли;
			
		ИначеЕсли (Метаданные.РегистрыСведений.Содержит(лОбъектМетаданных)
			И лОбъектМетаданных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору)
			ИЛИ Метаданные.РегистрыНакопления.Содержит(лОбъектМетаданных) тогда
			
			лЗапрос = Новый Запрос;
			лЗапрос.УстановитьПараметр("Узел", вхУзелОбмена);
			лЗапрос.УстановитьПараметр("НомерСообщения", вхНомерСообщения);
			лЗапрос.Текст = 
			"ВЫБРАТЬ
			|	Т.Регистратор КАК Ссылка,
			|	ВЫБОР
			|		КОГДА Т.Регистратор В (ВЫБРАТЬ Регистратор ИЗ " + лИмяТаблицы + ") ТОГДА ЛОЖЬ
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК ЭтоУдаление
			|ПОМЕСТИТЬ
			|	Объекты
			|ИЗ
			|	" + лИмяТаблицы + ".Изменения КАК Т
			|ГДЕ
			|	Т.Узел = &Узел
			|	И Т.НомерСообщения <= &НомерСообщения;      
			|ВЫБРАТЬ Ссылка ИЗ Объекты ГДЕ НЕ ЭтоУдаление;
			|ВЫБРАТЬ Ссылка ИЗ Объекты ГДЕ ЭтоУдаление;
			|УНИЧТОЖИТЬ Объекты";
			
			НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый); // read committed
			лРезультатыЗапросов = лЗапрос.ВыполнитьПакет();
			ЗафиксироватьТранзакцию();
						
			лРезультат = Новый Структура;
			Если НЕ лРезультатыЗапросов[1].Пустой() тогда
				лРезультат.Вставить("Объекты", лРезультатыЗапросов[1].Выгрузить().ВыгрузитьКолонку(0));
			КонецЕсли;
			Если НЕ лРезультатыЗапросов[2].Пустой() тогда
				лРезультат.Вставить("Удаленные", лРезультатыЗапросов[2].Выгрузить().ВыгрузитьКолонку(0));
			КонецЕсли;
			
			Если (лРезультат.Количество() > 0) тогда
				Результат.Вставить(лОбъектМетаданных, лРезультат);
			КонецЕсли;
			
		ИначеЕсли (Метаданные.РегистрыСведений.Содержит(лОбъектМетаданных)
			И лОбъектМетаданных.РежимЗаписи <> Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору) тогда
			
			лЗапрос = Новый Запрос;
			лЗапрос.УстановитьПараметр("Узел", вхУзелОбмена);
			лЗапрос.УстановитьПараметр("НомерСообщения", вхНомерСообщения);
			лТекстЗапроса = 
			"ВЫБРАТЬ";
			
			лЕстьСвязь = Ложь;
			лПолеСвязи = "";
			Если (лОбъектМетаданных.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический) тогда
				лТекстЗапроса = лТекстЗапроса + "
				|	Т.Период,";
				Если НЕ лЕстьСвязь тогда
					лЕстьСвязь = Истина;
					лПолеСвязи = "Период";
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого лИзмерение Из лОбъектМетаданных.Измерения цикл
				лТекстЗапроса = лТекстЗапроса + "
				|	Т." + лИзмерение.Имя + ",";
				Если НЕ лЕстьСвязь тогда
					лЕстьСвязь = Истина;
					лПолеСвязи = лИзмерение.Имя;
				КонецЕсли;
			КонецЦикла;
			
			Если НЕ лЕстьСвязь тогда
				ВызватьИсключение "[ВыбратьИзмененияДляУзлаОбмена]: обработка условия не реализована (непериодический регистр сведений без измерений).";
			КонецЕсли;
			
			лТекстЗапроса = лТекстЗапроса + "
			|	ВЫБОР
			|		КОГДА Р." + лПолеСвязи + " ЕСТЬ NULL ТОГДА ЛОЖЬ 
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ КАК ЭтоУдаление
			|ПОМЕСТИТЬ
			|	Объекты
			|ИЗ
			|	" + лИмяТаблицы + ".Изменения КАК Т
			|ЛЕВОЕ СОЕДИНЕНИЕ
			|	" + лИмяТаблицы + " КАК Р
			|ПО
			|	ИСТИНА";
			
			Если (лОбъектМетаданных.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический) тогда
				лТекстЗапроса = лТекстЗапроса + "
				|	И Т.Период = Р.Период";
			КонецЕсли;
			
			Для Каждого лИзмерение Из лОбъектМетаданных.Измерения цикл
				лТекстЗапроса = лТекстЗапроса + "
				|	И Т." + лИзмерение.Имя + " = Р." + лИзмерение.Имя;
			КонецЦикла;
			
			лТекстЗапроса = лТекстЗапроса + "
			|ГДЕ
			|	Т.Узел = &Узел
			|	И Т.НомерСообщения <= &НомерСообщения;";      
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ВыбратьПакетИзмененийДляУзлаОбмена(вхУзелОбмена, вхНомерСообщения, вхМаксимальноеКоличество) Экспорт
	
	лМетаданныеПланаОбмена = Метаданные.НайтиПоТипу(ТипЗнч(вхУзелОбмена));
	Если (лМетаданныеПланаОбмена = Неопределено) ИЛИ НЕ Метаданные.ПланыОбмена.Содержит(лМетаданныеПланаОбмена) тогда
		ВызватьИсключение "[ВыбратьПакетИзмененийДляУзлаОбмена]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лМенеджерПланаОбмена = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лМетаданныеПланаОбмена);
	Если (вхУзелОбмена = лМенеджерПланаОбмена.ЭтотУзел()) тогда
		ВызватьИсключение "[ВыбратьПакетИзмененийДляУзлаОбмена]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лБанковскиеДокументы = Новый Массив;
	лБанковскиеДокументы.Добавить(Метаданные.Документы.ПлатежноеПоручениеВходящее);
	лБанковскиеДокументы.Добавить(Метаданные.Документы.ПлатежноеПоручениеИсходящее);
	
	// очередь метаданных - сначала справочники, потом документы, потом остальное
	лОбъектыМетаданных = РегистрыСведений.ПриоритетВыгрузкиОбъектов.ПолучитьТаблицуПриоритетов(вхУзелОбмена);
	Для Каждого лЭлементСостава Из лМетаданныеПланаОбмена.Состав цикл
		лОбъектМетаданных = лЭлементСостава.Метаданные;
		Если лОбъектыМетаданных.Найти(лОбъектМетаданных) = Неопределено Тогда
			лСтрокаОбъектыМетаданных = лОбъектыМетаданных.Добавить();
			лСтрокаОбъектыМетаданных.ОбъектМетаданных = лОбъектМетаданных;
			Если Метаданные.Справочники.Содержит(лОбъектМетаданных) тогда
				лСтрокаОбъектыМетаданных.Приоритет = 200;
			ИначеЕсли Метаданные.Документы.Содержит(лОбъектМетаданных) тогда
				// +Асташов 2017-04-17 (приоритет выгрузки банковских документов)
				// лСтрокаОбъектыМетаданных.Приоритет = 500;
				Если (лБанковскиеДокументы.Найти(лОбъектМетаданных) <> Неопределено) тогда
					лСтрокаОбъектыМетаданных.Приоритет = 400;
				Иначе
					лСтрокаОбъектыМетаданных.Приоритет = 500;
				КонецЕсли;				
				// -Асташов 2017-04-17 (приоритет выгрузки банковских документов)
			Иначе
				лСтрокаОбъектыМетаданных.Приоритет = 700;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	лОбъектыМетаданных.Сортировать("Приоритет ВОЗР");
	
	лВосстановить = Новый Соответствие;
	Результат = Новый Соответствие;
	лОставшеесяКоличество = вхМаксимальноеКоличество;	
	
	//НачатьТранзакцию(РежимУправленияБлокировкойДанных.Автоматический); // repeatable read
	
	// ЛНА, борьба с излишними блокировками
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Попытка
		
		лВыборка = ПланыОбмена.ВыбратьИзменения(вхУзелОбмена, вхНомерСообщения);
		Для Каждого лСтрокаОбъектыМетаданных Из лОбъектыМетаданных цикл
			лОбъектМетаданных = лСтрокаОбъектыМетаданных.ОбъектМетаданных;
			лИмяТаблицы = лОбъектМетаданных.ПолноеИмя();
			Если ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(лОбъектМетаданных) тогда
				
				лОписаниеТипов = ОбщегоНазначения.ОписаниеТиповСсылкаПоОбъектуМетаданных(лОбъектМетаданных);
				
				лОбъектыДляРегистрации = Новый ТаблицаЗначений;
				лОбъектыДляРегистрации.Колонки.Добавить("Ссылка", лОписаниеТипов);
				
				лОбъектыДляВосстановления = Новый ТаблицаЗначений;
				лОбъектыДляВосстановления.Колонки.Добавить("Ссылка", лОписаниеТипов);
				
				лЗапрос = Новый Запрос;
				лЗапрос.УстановитьПараметр("Узел", вхУзелОбмена);
				лЗапрос.УстановитьПараметр("НомерСообщения", вхНомерСообщения);
				лЗапрос.Текст = 
				"ВЫБРАТЬ
				|	Т.Ссылка
				|ИЗ
				|	" + лИмяТаблицы + ".Изменения КАК Т
				|ГДЕ
				|	Т.Узел = &Узел
				|	И Т.НомерСообщения <= &НомерСообщения";
				лОбъекты = Новый Массив;
				лВыборка = лЗапрос.Выполнить().Выбрать();
				Пока лВыборка.Следующий() цикл
					Если (лОставшеесяКоличество > 0) тогда
						лОбъектыДляРегистрации.Добавить().Ссылка = лВыборка.Ссылка;
						лОставшеесяКоличество = лОставшеесяКоличество - 1;
					Иначе
						лОбъектыДляВосстановления.Добавить().Ссылка = лВыборка.Ссылка;
					КонецЕсли;
				КонецЦикла;
				
				// добавляем в результат и в восстановление
				Если (лОбъектыДляРегистрации.Количество() > 0) тогда
					Результат.Вставить(лОбъектМетаданных, лОбъектыДляРегистрации);
				КонецЕсли;
				
				Если (лОбъектыДляВосстановления.Количество() > 0) тогда
					лВосстановить.Вставить(лОбъектМетаданных, лОбъектыДляВосстановления);
				КонецЕсли;
								
			КонецЕсли;
			
			// тут изменяем, чтобы возвращалась таблица значений с колонками из измерения
			// ...
			Если ОбщегоНазначения.ЭтоРегистрСведений(лОбъектМетаданных) Тогда
				
				лМенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лОбъектМетаданных);
				НаборЗаписейРегистра = лМенеджерОбъекта.СоздатьНаборЗаписей();
				
				лИзмеренияРегистра = "";
				
				Если (лОбъектМетаданных.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический) Тогда
					лИзмеренияРегистра = "Период";
				КонецЕсли;
				Если (лОбъектМетаданных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору) Тогда
					лИзмеренияРегистра = лИзмеренияРегистра + ?(ЗначениеЗаполнено(лИзмеренияРегистра),",","") + "Регистратор";
				КонецЕсли;
				
				Для Каждого лИзмерение Из лОбъектМетаданных.Измерения Цикл
					лИзмеренияРегистра = лИзмеренияРегистра + ?(ЗначениеЗаполнено(лИзмеренияРегистра),",","") + лИзмерение.Имя;
				КонецЦикла;
				
				лМассивИзмерений = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(лИзмеренияРегистра);
				
				лОбъектыДляВыгрузки = лСоздатьСтруктуруРегистраСведений(лОбъектМетаданных);
				
				лОбъектыДляВосстановления = лСоздатьСтруктуруРегистраСведений(лОбъектМетаданных);
				
				лЗапрос = Новый Запрос;
				лЗапрос.УстановитьПараметр("Узел", вхУзелОбмена);
				лЗапрос.УстановитьПараметр("НомерСообщения", вхНомерСообщения);
				лЗапрос.Текст = 
				"ВЫБРАТЬ
				|	" + лИзмеренияРегистра + "
				|ИЗ
				|	" + лИмяТаблицы + ".Изменения КАК Т
				|ГДЕ
				|	Т.Узел = &Узел
				|	И Т.НомерСообщения <= &НомерСообщения";
				лОбъекты = Новый Массив;
				лВыборка = лЗапрос.Выполнить().Выбрать();
				Пока лВыборка.Следующий() цикл
					Если (лОставшеесяКоличество > 0) тогда
						
						НоваяСтрока = лОбъектыДляВыгрузки.Добавить();
						
						ЗаполнитьЗначенияСвойств(НоваяСтрока, лВыборка);
						
						лОставшеесяКоличество = лОставшеесяКоличество - 1;
					Иначе
						НоваяСтрока = лОбъектыДляВосстановления.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, лВыборка);
					КонецЕсли;
				КонецЦикла;
				
				// добавляем в результат
				Если (лОбъектыДляВыгрузки.Количество() > 0) тогда
					Результат.Вставить(лОбъектМетаданных, лОбъектыДляВыгрузки);
				КонецЕсли;
				
				Если (лОбъектыДляВосстановления.Количество() > 0) тогда
					лВосстановить.Вставить(лОбъектМетаданных, лОбъектыДляВосстановления);
				КонецЕсли;
					
			КонецЕсли;
		КонецЦикла;
		
		// восстановление не попавших в сообщение объектов
		Для Каждого лЭлементСоответствия Из лВосстановить цикл
			лОбъектыДляВосстановления = лЭлементСоответствия.Значение;
			Для Каждого лСтрокаОбъектыДляВосстановления Из лОбъектыДляВосстановления цикл
				Если ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(лЭлементСоответствия.Ключ) тогда
					//Семенов И.П. 31.01.2019 XX-1768(
					//ПланыОбмена.ЗарегистрироватьИзменения(вхУзелОбмена, лСтрокаОбъектыДляВосстановления.Ссылка);
					ЗарегистрироватьИзмененияВПланеОбмена(вхУзелОбмена, лСтрокаОбъектыДляВосстановления.Ссылка);
					//)Семенов И.П.
				ИначеЕсли ОбщегоНазначения.ЭтоРегистрСведений(лЭлементСоответствия.Ключ) Тогда
					
					лМенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лЭлементСоответствия.Ключ);
					НаборЗаписейРегистра = лМенеджерОбъекта.СоздатьНаборЗаписей();
					
					лИзмеренияРегистра = "";
					
					Если (лОбъектМетаданных.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический) Тогда
						лИзмеренияРегистра = "Период";
					КонецЕсли;
					Если (лОбъектМетаданных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору) Тогда
						лИзмеренияРегистра = лИзмеренияРегистра + ?(ЗначениеЗаполнено(лИзмеренияРегистра),",","") + "Регистратор";
					КонецЕсли;
					
					Для Каждого лИзмерение Из лОбъектМетаданных.Измерения Цикл
						лИзмеренияРегистра = лИзмеренияРегистра + ?(ЗначениеЗаполнено(лИзмеренияРегистра),",","") + лИзмерение.Имя;
					КонецЦикла;
					
					лМассивИзмерений = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(лИзмеренияРегистра);
					
					Для Каждого лИзмерение Из лМассивИзмерений Цикл
						
						НаборЗаписейРегистра.Отбор[лИзмерение].Значение = лСтрокаОбъектыДляВосстановления[лИзмерение];
						НаборЗаписейРегистра.Отбор[лИзмерение].Использование = Истина;
						
					КонецЦикла;
					//Семенов И.П. 31.01.2019 XX-1768(
					//ПланыОбмена.ЗарегистрироватьИзменения(вхУзелОбмена, НаборЗаписейРегистра);
					ЗарегистрироватьИзмененияВПланеОбмена(вхУзелОбмена, НаборЗаписейРегистра);
					//)Семенов И.П.
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Добавлено Валиахметов А.А. Убрана перерегистрация
Функция ВыбратьПакетИзмененийДляУзлаОбменаНовое(вхУзелОбмена, вхНомерСообщения, вхМаксимальноеКоличество = 1000) Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ВыбратьПакетИзмененийДляУзлаОбменаНовое";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	лМетаданныеПланаОбмена = Метаданные.НайтиПоТипу(ТипЗнч(вхУзелОбмена));
	Если (лМетаданныеПланаОбмена = Неопределено) ИЛИ НЕ Метаданные.ПланыОбмена.Содержит(лМетаданныеПланаОбмена) тогда
		ВызватьИсключение "[ВыбратьПакетИзмененийДляУзлаОбмена]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лМенеджерПланаОбмена = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лМетаданныеПланаОбмена);
	Если (вхУзелОбмена = лМенеджерПланаОбмена.ЭтотУзел()) тогда
		ВызватьИсключение "[ВыбратьПакетИзмененийДляУзлаОбмена]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лБанковскиеДокументы = Новый Массив;
	лБанковскиеДокументы.Добавить(Метаданные.Документы.ПлатежноеПоручениеВходящее);
	лБанковскиеДокументы.Добавить(Метаданные.Документы.ПлатежноеПоручениеИсходящее);
	
	// очередь метаданных - сначала справочники, потом документы, потом остальное
	лОбъектыМетаданных = РегистрыСведений.ПриоритетВыгрузкиОбъектов.ПолучитьТаблицуПриоритетов(вхУзелОбмена);
	Для Каждого лЭлементСостава Из лМетаданныеПланаОбмена.Состав цикл
		лОбъектМетаданных = лЭлементСостава.Метаданные;
		Если лОбъектыМетаданных.Найти(лОбъектМетаданных) = Неопределено Тогда
			лСтрокаОбъектыМетаданных = лОбъектыМетаданных.Добавить();
			лСтрокаОбъектыМетаданных.ОбъектМетаданных = лОбъектМетаданных;
			Если Метаданные.Справочники.Содержит(лОбъектМетаданных) тогда
				лСтрокаОбъектыМетаданных.Приоритет = 200;
			ИначеЕсли Метаданные.Документы.Содержит(лОбъектМетаданных) тогда
				// +Асташов 2017-04-17 (приоритет выгрузки банковских документов)
				// лСтрокаОбъектыМетаданных.Приоритет = 500;
				Если (лБанковскиеДокументы.Найти(лОбъектМетаданных) <> Неопределено) тогда
					лСтрокаОбъектыМетаданных.Приоритет = 400;
				Иначе
					лСтрокаОбъектыМетаданных.Приоритет = 500;
				КонецЕсли;				
				// -Асташов 2017-04-17 (приоритет выгрузки банковских документов)
			Иначе
				лСтрокаОбъектыМетаданных.Приоритет = 700;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	лОбъектыМетаданных.Сортировать("Приоритет ВОЗР");
	
	Результат = Новый Соответствие;
	
	МассивОбъектов 		= Новый Массив;
	МассивОбъектовРС 	= Новый Массив;
	КоличествоВыбираемых = вхМаксимальноеКоличество;
	Индекс = 0;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Попытка
		Пока КоличествоВыбираемых > 0 И Индекс < лОбъектыМетаданных.Количество() Цикл  
			лСтрокаОбъектыМетаданных = лОбъектыМетаданных.Получить(Индекс);
			лОбъектМетаданных = лСтрокаОбъектыМетаданных.ОбъектМетаданных;
			Если ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(лОбъектМетаданных) Тогда 
				
				лОписаниеТипов = ОбщегоНазначения.ОписаниеТиповСсылкаПоОбъектуМетаданных(лОбъектМетаданных);
				
				лОбъектыДляРегистрации = Новый ТаблицаЗначений;
				лОбъектыДляРегистрации.Колонки.Добавить("Ссылка", лОписаниеТипов);
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоВыбираемых, "ЧН=; ЧГ=") + "
				               |	Т.Ссылка
				               |ИЗ
				               |" + лОбъектМетаданных.ПолноеИмя() + ".Изменения КАК Т
				               |ГДЕ
				               |	Т.Узел = &Узел";
				Запрос.УстановитьПараметр("Узел", вхУзелОбмена);
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл 
					МассивОбъектов.Добавить(Выборка.Ссылка);
					лОбъектыДляРегистрации.Добавить().Ссылка = Выборка.Ссылка;
				КонецЦикла;
				
				КоличествоВыбираемых = КоличествоВыбираемых - Выборка.Количество();
				
				Если (лОбъектыДляРегистрации.Количество() > 0) тогда
					Результат.Вставить(лОбъектМетаданных, лОбъектыДляРегистрации);
				КонецЕсли;
				
			//ИначеЕсли ОбщегоНазначения.ЭтоРегистрНакопления(лОбъектМетаданных) Тогда
			//	лМенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лОбъектМетаданных);
			//	лОбъектыДляВыгрузки = Новый ТаблицаЗначений;
			//	лОбъектыДляВыгрузки.Колонки.Добавить("Регистратор", лОбъектМетаданных.СтандартныеРеквизиты.Регистратор.Тип);
			//	
			//	лЗапрос = Новый Запрос;
			//	лЗапрос.УстановитьПараметр("Узел", вхУзелОбмена);
			//	лЗапрос.Текст =  "ВЫБРАТЬ ПЕРВЫЕ " + Формат(КоличествоВыбираемых, "ЧН=; ЧГ=") + " 
			//               |	РНИзменения.Регистратор КАК Регистратор 
			//               |ИЗ
			//               |	" + лОбъектМетаданных.ПолноеИмя() + ".Изменения КАК РНИзменения
			//               |ГДЕ
			//               |	РНИзменения.Узел = &Узел";
			//	
			//	Таблица = лЗапрос.Выполнить().Выгрузить();
			//	Для Каждого СтрокаТЧ Из Таблица Цикл 
			//		НаборЗаписейРегистра = лМенеджерОбъекта.СоздатьНаборЗаписей();
			//	 	НаборЗаписейРегистра.Отбор.Регистратор.Установить(СтрокаТЧ.Регистратор);
			//		МассивОбъектов.Добавить(НаборЗаписейРегистра);
			//		ЗаполнитьЗначенияСвойств(лОбъектыДляВыгрузки.Добавить(), СтрокаТЧ);
			//	КонецЦикла;
			//	
			//	КоличествоВыбираемых = КоличествоВыбираемых - Таблица.Количество();
			//	// добавляем в результат
			//	Если (лОбъектыДляВыгрузки.Количество() > 0) тогда
			//		Результат.Вставить(лОбъектМетаданных, лОбъектыДляВыгрузки);
			//	КонецЕсли;
			ИначеЕсли ОбщегоНазначения.ЭтоРегистрСведений(лОбъектМетаданных) Тогда 
				
				лОбъектыДляВыгрузки = лСоздатьСтруктуруРегистраСведений(лОбъектМетаданных);
				
				лМенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лОбъектМетаданных);
				
				лИзмеренияРегистра = "";
				
				Если (лОбъектМетаданных.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический) Тогда
					лИзмеренияРегистра = "Период";
				КонецЕсли;
				Если (лОбъектМетаданных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору) Тогда
					лИзмеренияРегистра = лИзмеренияРегистра + ?(ЗначениеЗаполнено(лИзмеренияРегистра),",","") + "Регистратор";
				КонецЕсли;
				
				Для Каждого лИзмерение Из лОбъектМетаданных.Измерения Цикл
					лИзмеренияРегистра = лИзмеренияРегистра + ?(ЗначениеЗаполнено(лИзмеренияРегистра),",","") + лИзмерение.Имя;
				КонецЦикла;
				
				лЗапрос = Новый Запрос;
				лЗапрос.УстановитьПараметр("Узел", вхУзелОбмена);
				лЗапрос.Текст = 
				
				"ВЫБРАТЬ ПЕРВЫЕ "  + Формат(КоличествоВыбираемых, "ЧН=; ЧГ=") + "
				|	" + лИзмеренияРегистра + "
				|ИЗ
				|	" + лОбъектМетаданных.ПолноеИмя() + ".Изменения КАК Т
				|ГДЕ
				|	Т.Узел = &Узел";
				Таблица = лЗапрос.Выполнить().Выгрузить();
				Для Каждого СтрокаТЧ Из Таблица Цикл 
					НаборЗаписейРегистра = лМенеджерОбъекта.СоздатьНаборЗаписей();
					Для Индекс = 0 По НаборЗаписейРегистра.Отбор.Количество() - 1 Цикл 
						ЭлементОтбора = НаборЗаписейРегистра.Отбор.Получить(Индекс);
						ЭлементОтбора.Установить(СтрокаТЧ[ЭлементОтбора.Имя]);
					КонецЦикла;
					МассивОбъектовРС.Добавить(НаборЗаписейРегистра);
					ЗаполнитьЗначенияСвойств(лОбъектыДляВыгрузки.Добавить(), СтрокаТЧ);
				КонецЦикла;
				
				КоличествоВыбираемых = КоличествоВыбираемых - Таблица.Количество();
				
				// добавляем в результат
				Если (лОбъектыДляВыгрузки.Количество() > 0) тогда
					Результат.Вставить(лОбъектМетаданных, лОбъектыДляВыгрузки);
				КонецЕсли;
				
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;
		
		
		//ХудинВВ XX-2442 07062019 
		//МассивОбъектов может быть пустой, а объекты на узле при этом могут быть зарегистрированы (после выполнения запроса)
		//Если МассивОбъектов пустой, то номер сменится у всех зарегистрированных объектов, и они никогда не выгрузятся, не надо так. 
		Если МассивОбъектов.Количество() > 0 Тогда
			лВыборка = ПланыОбмена.ВыбратьИзменения(вхУзелОбмена, вхНомерСообщения, МассивОбъектов);
		КонецЕсли;
		Если МассивОбъектовРС.Количество() > 0 Тогда
			лВыборка = ПланыОбмена.ВыбратьИзменения(вхУзелОбмена, вхНомерСообщения, МассивОбъектовРС);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
		
	Возврат Результат;
	
КонецФункции
// Конец Добавлено Валиахметов А.А.

Функция ПолучитьВходящийУзелОбмена(вхПланОбмена, вхИдентификаторУзла) Экспорт
	
	лМетаданныеПланаОбмена = Неопределено;
	лТип = ТипЗнч(вхПланОбмена);
	Если (лТип = Тип("Строка")) тогда
		лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.Найти(вхПланОбмена);
	ИначеЕсли (лТип = Тип("ОбъектМетаданных")) И Метаданные.ПланыОбмена.Содержит(вхПланОбмена) тогда
		лМетаданныеПланаОбмена = вхПланОбмена;
	КонецЕсли;
	
	Если (лМетаданныеПланаОбмена = Неопределено) тогда
		ВызватьИсключение "[ПолучитьВходящийУзелОбмена]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лМенеджерПланаОбмена = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лМетаданныеПланаОбмена);
	Результат = лМенеджерПланаОбмена.ПустаяСсылка();
	
	лЗапрос = Новый Запрос;
	лЗапрос.УстановитьПараметр("ИдентификаторУзла", вхИдентификаторУзла);
	лЗапрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка
	|ИЗ
	|	ПланОбмена." + лМетаданныеПланаОбмена.Имя + " КАК Т
	|ГДЕ
	|	Т.ИдентификаторУзла = &ИдентификаторУзла
	|	И Т.Входящий";
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Если лВыборка.Следующий() тогда
		Результат = лВыборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИсходящийУзелОбмена(вхПланОбмена, вхИдентификаторУзла) Экспорт
	
	лМетаданныеПланаОбмена = Неопределено;
	лТип = ТипЗнч(вхПланОбмена);
	Если (лТип = Тип("Строка")) тогда
		лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.Найти(вхПланОбмена);
	ИначеЕсли (лТип = Тип("ОбъектМетаданных")) И Метаданные.ПланыОбмена.Содержит(вхПланОбмена) тогда
		лМетаданныеПланаОбмена = вхПланОбмена;
	КонецЕсли;
	
	Если (лМетаданныеПланаОбмена = Неопределено) тогда
		ВызватьИсключение "[ПолучитьИсходящийУзелОбмена]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лМенеджерПланаОбмена = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лМетаданныеПланаОбмена);
	Результат = лМенеджерПланаОбмена.ПустаяСсылка();
	
	лЗапрос = Новый Запрос;
	лЗапрос.УстановитьПараметр("ИдентификаторУзла", вхИдентификаторУзла);
	лЗапрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Т.Ссылка
	|ИЗ
	|	ПланОбмена." + лМетаданныеПланаОбмена.Имя + " КАК Т
	|ГДЕ
	|	Т.ИдентификаторУзла = &ИдентификаторУзла
	|	И Т.Исходящий";
	лВыборка = лЗапрос.Выполнить().Выбрать();
	Если лВыборка.Следующий() тогда
		Результат = лВыборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТаблицуЗначенийИзМассива(вхМассив, вхИмяКолонки, вхОписаниеТиповКолонки) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить(вхИмяКолонки, вхОписаниеТиповКолонки);
	Для к = 1 по вхМассив.Количество() цикл
		Результат.Добавить();	
	КонецЦикла;	
	Результат.ЗагрузитьКолонку(вхМассив, вхИмяКолонки);
	Возврат Результат;
	
КонецФункции

Функция лСоздатьСтруктуруРегистраСведений(вхРегистр)
	
	лТип = ТипЗнч(вхРегистр);
	лМетаданныеРегистра = Неопределено;
	Если (лТип = Тип("Строка")) тогда
		лМетаданныеРегистра = Метаданные.РегистрыСведений.Найти(вхРегистр);
	ИначеЕсли (лТип = Тип("ОбъектМетаданных")) И Метаданные.РегистрыСведений.Содержит(вхРегистр) тогда
		лМетаданныеРегистра = вхРегистр;
	КонецЕсли;
	
	Если (лМетаданныеРегистра = Неопределено) тогда
		ВызватьИсключение "[лСоздатьСтруктуруРегистраСведений]: неправильный параметр номер 1.";
	КонецЕсли;
	
	выхТабДвиж = Новый ТаблицаЗначений;
	Если (лМетаданныеРегистра.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический) тогда
		выхТабДвиж.Колонки.Добавить("Период", лМетаданныеРегистра.СтандартныеРеквизиты.Период.Тип);
	КонецЕсли;
	Если (лМетаданныеРегистра.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору) тогда
		выхТабДвиж.Колонки.Добавить("Регистратор", лМетаданныеРегистра.СтандартныеРеквизиты.Регистратор.Тип);
	КонецЕсли;
		
	Для Каждого лОбъектМетаданных Из лМетаданныеРегистра.Измерения цикл
		выхТабДвиж.Колонки.Добавить(лОбъектМетаданных.Имя, лОбъектМетаданных.Тип);
	КонецЦикла;
	
	Возврат выхТабДвиж
	
КонецФункции

// Процедура регистрирует к обмену объекты ссылочного типа, которые необходимо выгрузить вместе с объектом(-ами)
//
// Параметры:
//  вхОбъекты  - <Объект ссылочного типа; Массив объектов ссылочного типа> - Объект или массив объектов, для которого необходимо найти и зарегистрировать связанные объекты ссылочного типа
//                 
//  вхИдентификаторУзла  - <ПланОбменаСсылка> - узел обмена, для которого необходимо зарегистрировать изменения
//                 
//  вхВключаемыеРеквизиты  - <Соответствие> - соответствие вида <ИмяОбъектаМетаданных>-<Структура>
//                 Если параметр задан, регистрация объектов будет произведена только для указанных реквизитов
//  вхИсключаемыеРеквизиты  - <Соответствие> - соответствие вида <ИмяОбъектаМетаданных>-<Структура>
//                 Если параметр задан, из регистрации объектов будут исключены указанные реквизиты
//
Функция ПолучитьСвязанныеОбъекты(вхОбъекты, вхИдентификаторУзла, вхВключаемыеРеквизиты=Неопределено, вхИсключаемыеРеквизиты=Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(вхОбъекты) Тогда
		ВызватьИсключение "[ЗарегистрироватьСвязанныеОбъектыКОбмену]: неправильный параметр номер 1.";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(вхИдентификаторУзла) Тогда
		ВызватьИсключение "[ЗарегистрироватьСвязанныеОбъектыКОбмену]: неправильный параметр номер 2.";
	КонецЕсли;
	
	лОбъекты = Новый Массив;
	
	Если ТипЗнч(вхОбъекты) = Тип("Массив") Тогда
		
		Для Каждого ТекущийОбъект Из вхОбъекты Цикл
			
			ПолучитьОбъектыДляРегистрации(ТекущийОбъект, лОбъекты, вхВключаемыеРеквизиты, вхИсключаемыеРеквизиты);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(вхОбъекты) = Тип("ТаблицаЗначений") Тогда
		
		Если вхОбъекты.Колонки.Найти("Ссылка") = Неопределено Тогда
			ВызватьИсключение "[ЗарегистрироватьСвязанныеОбъектыКОбмену]: неправильный параметр номер 1 (отсутствует колонка ""Ссылка"").";
		КонецЕсли;
		
		Для Каждого цТекущаяСтрока Из вхОбъекты Цикл
			
			ПолучитьОбъектыДляРегистрации(цТекущаяСтрока.Ссылка, лОбъекты, вхВключаемыеРеквизиты, вхИсключаемыеРеквизиты);
			
		КонецЦикла;
		
	Иначе
		
		ПолучитьОбъектыДляРегистрации(вхОбъекты, лОбъекты, вхВключаемыеРеквизиты, вхИсключаемыеРеквизиты);
		
	КонецЕсли;
	
	Возврат лОбъекты

КонецФункции // ЗарегистрироватьСвязанныеОбъектыКОбмену()

Процедура ПолучитьОбъектыДляРегистрации(вхОбъект, лОбъектыДляРегистрации, вхВключаемыеРеквизиты = Неопределено, вхИсключаемыеРеквизиты = Неопределено)
	
	Если лОбъектыДляРегистрации.Найти(вхОбъект) = Неопределено Тогда
		лОбъектыДляРегистрации.Добавить(вхОбъект);
	КонецЕсли;
	
	МассивИсключаемыхСтандартныхРеквизитов = Новый Массив;
	МассивИсключаемыхСтандартныхРеквизитов.Добавить("ИмяПредопределенныхДанных");
	МассивИсключаемыхСтандартныхРеквизитов.Добавить("Предопределенный");
	МассивИсключаемыхСтандартныхРеквизитов.Добавить("Ссылка");
	
	лМетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(вхОбъект));
	лВключаемыеРеквизиты = Неопределено;
	лИсключаемыеРеквизиты = Неопределено;
	Если Не вхВключаемыеРеквизиты = Неопределено Тогда
		лСоответствие = вхВключаемыеРеквизиты.Получить(лМетаданныеОбъекта);
		Если Не лСоответствие = Неопределено Тогда
			лВключаемыеРеквизиты = лСоответствие;
		КонецЕсли;
	КонецЕсли;
	
	Если Не вхИсключаемыеРеквизиты = Неопределено Тогда
		лСоответствие = вхИсключаемыеРеквизиты.Получить(лМетаданныеОбъекта);
		Если Не лСоответствие = Неопределено Тогда
			лИсключаемыеРеквизиты = лСоответствие;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураРеквизитовОбъекта = Новый Структура("Шапка", Новый Массив);
	
	Для Каждого ТекРеквизит Из Метаданные.ОбщиеРеквизиты Цикл
		
		Для Каждого ТекТип Из ТекРеквизит.Тип.Типы() Цикл
			
			Если ОбщегоНазначения.ЭтоСсылка(ТекТип) Тогда
				СтруктураРеквизитовОбъекта.Шапка.Добавить(ТекРеквизит.Имя);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого ТекРеквизит Из лМетаданныеОбъекта.СтандартныеРеквизиты Цикл
		
		Если МассивИсключаемыхСтандартныхРеквизитов.Найти(ТекРеквизит.Имя) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ТекТип Из ТекРеквизит.Тип.Типы() Цикл
			
			Если ОбщегоНазначения.ЭтоСсылка(ТекТип) Тогда
				СтруктураРеквизитовОбъекта.Шапка.Добавить(ТекРеквизит.Имя);
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Не ОбщегоНазначения.ЭтоПеречисление(лМетаданныеОбъекта) Тогда
		Для Каждого ТекРеквизит Из лМетаданныеОбъекта.Реквизиты Цикл
			
			Для Каждого ТекТип Из ТекРеквизит.Тип.Типы() Цикл
				
				Если ОбщегоНазначения.ЭтоСсылка(ТекТип) Тогда
					СтруктураРеквизитовОбъекта.Шапка.Добавить(ТекРеквизит.Имя);
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Для Каждого ТекущаяТабличнаяЧасть Из лМетаданныеОбъекта.ТабличныеЧасти Цикл
			
			ИмяТабличнойЧасти = ТекущаяТабличнаяЧасть.Имя;
			СтруктураРеквизитовОбъекта.Вставить(ИмяТабличнойЧасти, Новый Массив);
			
			Для Каждого ТекРеквизит Из ТекущаяТабличнаяЧасть.Реквизиты Цикл
				
				Для Каждого ТекТип Из ТекРеквизит.Тип.Типы() Цикл
					
					Если ОбщегоНазначения.ЭтоСсылка(ТекТип) Тогда
						СтруктураРеквизитовОбъекта[ИмяТабличнойЧасти].Добавить(ТекРеквизит.Имя);
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
	
	Если лВключаемыеРеквизиты <> Неопределено Тогда
		
		Для Каждого ТекущаяЧасть Из лВключаемыеРеквизиты Цикл
			
			Если СтруктураРеквизитовОбъекта.Свойство(ТекущаяЧасть.Ключ) Тогда
				
				Счетчик = ТекущаяЧасть.Значение.Количество();
				Пока Счетчик > 0 Цикл
					
					Счетчик = Счетчик - 1;
					ИмяЭлемента = ТекущаяЧасть.Значение[Счетчик];
					ИндексЭлемента = СтруктураРеквизитовОбъекта[ТекущаяЧасть.Ключ].Найти(ИмяЭлемента);
					Если ИндексЭлемента = Неопределено Тогда
						ТекущаяЧасть.Значение.Удалить(Счетчик);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		СтруктураРеквизитовОбъекта = лВключаемыеРеквизиты;
		
	КонецЕсли;
	
	Если лИсключаемыеРеквизиты <> Неопределено Тогда
		
		Для Каждого ТекущаяЧасть Из лИсключаемыеРеквизиты Цикл
			
			Если СтруктураРеквизитовОбъекта.Свойство(ТекущаяЧасть.Ключ) Тогда
				
				Для Каждого ТекРеквизит Из ТекущаяЧасть.Значение Цикл
					
					ИндексЭлемента = СтруктураРеквизитовОбъекта[ТекущаяЧасть.Ключ].Найти(ТекРеквизит);
					Если ИндексЭлемента <> Неопределено Тогда
						СтруктураРеквизитовОбъекта[ТекущаяЧасть.Ключ].Удалить(ИндексЭлемента);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Для Каждого ТекущаяЗапись Из СтруктураРеквизитовОбъекта Цикл
		
		Если ТекущаяЗапись.Ключ = "Шапка" Тогда
			
			Если ТекущаяЗапись.Значение.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ИменаПолейШапки = "";
			Для Каждого цИмяРеквизита Из ТекущаяЗапись.Значение Цикл
				ИменаПолейШапки = ИменаПолейШапки + ?(ЗначениеЗаполнено(ИменаПолейШапки), ",","") + цИмяРеквизита;
			КонецЦикла;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	" + ИменаПолейШапки + "
			|ИЗ
			|	" + лМетаданныеОбъекта.ПолноеИмя() + " КАК Таблица
			|ГДЕ
			|	Таблица.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", вхОбъект);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Для Каждого цИмяРеквизита Из ТекущаяЗапись.Значение Цикл
					
					Если ЗначениеЗаполнено(Выборка[цИмяРеквизита]) И ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Выборка[цИмяРеквизита])) И лОбъектыДляРегистрации.Найти(Выборка[цИмяРеквизита]) = Неопределено Тогда
						Если лОбъектыДляРегистрации.Найти(Выборка[цИмяРеквизита]) = Неопределено Тогда
							ПолучитьОбъектыДляРегистрации(Выборка[цИмяРеквизита], лОбъектыДляРегистрации, вхВключаемыеРеквизиты, вхИсключаемыеРеквизиты);
						КонецЕсли;
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЦикла;
			
		Иначе
			
			Если ТекущаяЗапись.Значение.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ИменаПолейТабличнойЧасти = "";
			Для Каждого цИмяРеквизита Из ТекущаяЗапись.Значение Цикл
				ИменаПолейТабличнойЧасти = ИменаПолейТабличнойЧасти + ?(ЗначениеЗаполнено(ИменаПолейТабличнойЧасти), ",","") + "ТабличнаяЧасть." + цИмяРеквизита;
			КонецЦикла;
			
			Запрос = Новый Запрос("ВЫБРАТЬ
			|	" + ИменаПолейТабличнойЧасти + "
			|ИЗ
			|	" + лМетаданныеОбъекта.ПолноеИмя() + "." + ТекущаяЗапись.Ключ + " КАК ТабличнаяЧасть
			|ГДЕ
			|	ТабличнаяЧасть.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", вхОбъект);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Для Каждого цИмяРеквизита Из ТекущаяЗапись.Значение Цикл
					
					Если ЗначениеЗаполнено(Выборка[цИмяРеквизита]) И ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Выборка[цИмяРеквизита])) И лОбъектыДляРегистрации.Найти(Выборка[цИмяРеквизита]) = Неопределено Тогда
						Если лОбъектыДляРегистрации.Найти(Выборка[цИмяРеквизита]) = Неопределено Тогда
							ПолучитьОбъектыДляРегистрации(Выборка[цИмяРеквизита], лОбъектыДляРегистрации, вхВключаемыеРеквизиты, вхИсключаемыеРеквизиты);
						КонецЕсли;
					КонецЕсли;
				
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

//ХудинВВ{{

//Возвращает структуру с реквизитами по которым нужно контролировать изменения объекта
Функция РеквизитыКонтроляПоДокументу(МетаданныеОбъекта, ТаблицаИсключаемыхРеквизитов = Неопределено) Экспорт
	
	Если ТаблицаИсключаемыхРеквизитов = Неопределено Тогда
		ТаблицаИсключаемыхРеквизитов = ИнициализироватьТаблицуИсключаемыхРеквизитовКонтроля();
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Шапка", РеквизитыДокументаСтрокой(МетаданныеОбъекта,,ТаблицаИсключаемыхРеквизитов));
	
	СтруктураТЧ = Новый Структура;
	Для каждого ТЧ Из МетаданныеОбъекта.ТабличныеЧасти Цикл
		
		СтрокиИсключений = ТаблицаИсключаемыхРеквизитов.НайтиСтроки(Новый Структура("Реквизит,ИмяТЧ","",ТЧ.Имя));
		Если СтрокиИсключений.Количество() = 0 Тогда
			СтруктураТЧ.Вставить(ТЧ.Имя, РеквизитыДокументаСтрокой(МетаданныеОбъекта, ТЧ.Имя, ТаблицаИсключаемыхРеквизитов));
		КонецЕсли;
		
	КонецЦикла;
	Результат.Вставить("ТабличныеЧасти", СтруктураТЧ);
	
	Возврат Результат;
	
КонецФункции

Функция ИнициализироватьТаблицуИсключаемыхРеквизитовКонтроля() Экспорт
	
	 ТаблицаИсключаемыхРеквизитов = Новый ТаблицаЗначений;
	 ТаблицаИсключаемыхРеквизитов.Колонки.Добавить("Реквизит", Новый ОписаниеТипов("Строка"));
	 ТаблицаИсключаемыхРеквизитов.Колонки.Добавить("ИмяТЧ",    Новый ОписаниеТипов("Строка"));
	
	 Возврат ТаблицаИсключаемыхРеквизитов;
	
 КонецФункции
 
Процедура ДобавитьВИсключаемыеРевизиты(ТаблицаИсключаемыхРеквизитов, Реквизит = "", ИмяТЧ = "") Экспорт
	 
	 НоваяСтрока = ТаблицаИсключаемыхРеквизитов.Добавить();
	 НоваяСтрока.Реквизит = Реквизит;
	 НоваяСтрока.ИмяТЧ = ИмяТЧ;
	 
 КонецПроцедуры

Функция РеквизитыДокументаСтрокой(МетаданныеОбъекта, ИмяТабличнойЧасти = "", ТаблицаИсключаемыхРеквизитов)
	
	Если ИмяТабличнойЧасти = "" Тогда //Реквизиты шапки
		
		Реквизиты = "";	
		Для каждого Рек Из МетаданныеОбъекта.СтандартныеРеквизиты Цикл
			
			СтрокиИсключений = ТаблицаИсключаемыхРеквизитов.НайтиСтроки(Новый Структура("Реквизит,ИмяТЧ",Рек.Имя,""));
			Если СтрокиИсключений.Количество() = 0 Тогда
				Реквизиты = Реквизиты+","+Рек.Имя;
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого Рек Из МетаданныеОбъекта.Реквизиты Цикл
			
			СтрокиИсключений = ТаблицаИсключаемыхРеквизитов.НайтиСтроки(Новый Структура("Реквизит,ИмяТЧ",Рек.Имя,""));
			Если СтрокиИсключений.Количество() = 0 Тогда
				Реквизиты = Реквизиты+","+Рек.Имя;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Реквизиты = "";	
		Для каждого Рек Из МетаданныеОбъекта.ТабличныеЧасти[ИмяТабличнойЧасти].Реквизиты Цикл
			
			СтрокиИсключений = ТаблицаИсключаемыхРеквизитов.НайтиСтроки(Новый Структура("Реквизит, ИмяТЧ",Рек.Имя, ИмяТабличнойЧасти));
			Если СтрокиИсключений.Количество() = 0 Тогда
				Реквизиты = Реквизиты + ","+Рек.Имя;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Прав(Реквизиты,1) = "," Тогда
		Реквизиты = Лев(Реквизиты,СтрДлина(Реквизиты)-1);
	КонецЕсли;
	Если Лев(Реквизиты,1) = "," Тогда
		Реквизиты = Прав(Реквизиты,СтрДлина(Реквизиты)-1);
	КонецЕсли;
	
	Возврат Реквизиты;
	
КонецФункции
//}}

//____________________________________________
Процедура ЗарегистрироватьКОбменуБИТ(вхСсылкаНаОбъект, вхОтправитель = Неопределено) Экспорт	
	УзелПолучатель = ПланыОбмена.ОбменПартКом83_БитФинанс.ПолучитьСсылку(Новый УникальныйИдентификатор("356a626c-086c-11e6-80e1-005056817b9c"));
	Если вхОтправитель <> УзелПолучатель Тогда		
		Если ТипЗнч(вхСсылкаНаОбъект) = Тип("СправочникСсылка.Контрагенты") Тогда
			//ИЛИ ТипЗнч(вхСсылкаНаОбъект) = Тип("СправочникСсылка.Организации") Тогда
			СсылкаДляРегистрации = вхСсылкаНаОбъект;
		ИначеЕсли ТипЗнч(вхСсылкаНаОбъект) = Тип("СправочникСсылка.БанковскиеСчета")
			ИЛИ ТипЗнч(вхСсылкаНаОбъект) = Тип("СправочникСсылка.ДоговорыКонтрагентов")
			ИЛИ ТипЗнч(вхСсылкаНаОбъект) = Тип("СправочникСсылка.ТорговыеТочки") Тогда
			СсылкаДляРегистрации = ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНаОбъект, "Владелец");
			Если ТипЗнч(СсылкаДляРегистрации) <> Тип("СправочникСсылка.Контрагенты") Тогда
				СсылкаДляРегистрации = Неопределено;
			КонецЕсли;
		Иначе
			СсылкаДляРегистрации = Неопределено;
		КонецЕсли;
		Если СсылкаДляРегистрации <> Неопределено Тогда
			//Семенов И.П. 31.01.2019 XX-1768(
			//ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, СсылкаДляРегистрации);
			ЗарегистрироватьИзмененияВПланеОбмена(УзелПолучатель, СсылкаДляРегистрации);
			//)Семенов И.П.
		КонецЕсли;
		//ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, вхСсылкаНаОбъект);
	КонецЕсли;
	УзелПолучатель = ПланыОбмена.ОбменПартКом83_CRM.ПолучитьСсылку(Новый УникальныйИдентификатор("3b7555d0-95dd-11e6-80e5-005056817b9c"));
	Если вхОтправитель <> УзелПолучатель Тогда		
		Если ТипЗнч(вхСсылкаНаОбъект) = Тип("СправочникСсылка.Контрагенты")Тогда
			СсылкаДляРегистрации = вхСсылкаНаОбъект;
		ИначеЕсли ТипЗнч(вхСсылкаНаОбъект) = Тип("СправочникСсылка.ТорговыеТочки") Тогда
			СсылкаДляРегистрации = ОбщегоНазначения.ПолучитьЗначениеРеквизита(вхСсылкаНаОбъект, "Владелец");
		Иначе
			СсылкаДляРегистрации = Неопределено;
		КонецЕсли;
		Если СсылкаДляРегистрации <> Неопределено И ОбщегоНазначения.ЭтоСсылка(ТипЗнч(СсылкаДляРегистрации)) И Не ЭтоБитаяСсылка(СсылкаДляРегистрации) Тогда
			//Семенов И.П. 31.01.2019 XX-1768(
			//ПланыОбмена.ЗарегистрироватьИзменения(УзелПолучатель, СсылкаДляРегистрации);
			ЗарегистрироватьИзмененияВПланеОбмена(УзелПолучатель, СсылкаДляРегистрации);
			//)Семенов И.П.
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Добавлено Валиахметов А.А.  2017г.
Функция ЭтоБитаяСсылка(Ссылка) Экспорт 
	
	ПолноеИмя = Ссылка.Метаданные().ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Т.Ссылка
	               |ИЗ
	               |" + ПолноеИмя+ " КАК Т
	               |ГДЕ
	               |	Т.Ссылка = &Ссылка";
				   
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ЗаписатьОшибкиПриОбменеСТопЛог(СтруктураОшибки) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ОшибкиПриОбменеСТопЛог.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураОшибки);
		
	МенеджерЗаписи.Записать(Истина);
	
КонецПроцедуры

Процедура ОчиститьОшибкиПриОбменеСТопЛог(СтруктураОшибки) Экспорт 
	
	НаборЗаписей = РегистрыСведений.ОшибкиПриОбменеСТопЛог.СоздатьНаборЗаписей();
	Для Каждого КлючЗначение из СтруктураОшибки Цикл
		Выполнить("НаборЗаписей.Отбор." + КлючЗначение.Ключ +".Установить(КлючЗначение.Значение)"); 
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДополнитьДаннымиПоПечати(ОбъектXDTO, вхСсылкаНаДокумент, СЗ = Неопределено) Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ДополнитьДаннымиПоПечати";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если ТипЗнч(вхСсылкаНаДокумент) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ДополнитьДаннымиПоПечати_РеализацияТоваровУслуг(ОбъектXDTO, вхСсылкаНаДокумент, СЗ);
	ИначеЕсли ТипЗнч(вхСсылкаНаДокумент) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		ДополнитьДаннымиПоПечати_ВозвратТоваровПоставщику(ОбъектXDTO, вхСсылкаНаДокумент, СЗ);
	Иначе
		ДополнитьПустымиДаннымиПоПечати(ОбъектXDTO, вхСсылкаНаДокумент); //Для валидности схемы XDTO
	КонецЕсли;
	
КонецПроцедуры

//ХудинВВ 26022019 XX-1969
Процедура ДополнитьДаннымиПоПечати_ВозвратТоваровПоставщику(ОбъектXDTO, вхСсылкаНаДокумент, СЗ = Неопределено) Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ДополнитьДаннымиПоПечати_ВозвратТоваровПоставщику";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	ДополнитьПустымиДаннымиПоПечати(ОбъектXDTO, вхСсылкаНаДокумент); //Для валидности схемы XDTO
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "АктРассмотренияВозврата");
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.АктРассмотренияВозврата) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ВозвратТоваровПоставщику.ВидОперации КАК ВидОперации,
	                |	ВозвратТоваровПоставщику.Организация КАК Организация,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Организация.НаименованиеПолное, """") КАК ФирмаНаименование,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Организация.ИНН, """") + ВЫБОР
	                |		КОГДА ВозвратТоваровПоставщику.Организация.ЮрФизЛицо.Порядок = 0
	                |			ТОГДА ""/"" + ЕСТЬNULL(ВозвратТоваровПоставщику.Организация.КПП, """")
	                |		ИНАЧЕ """"
	                |	КОНЕЦ КАК ФирмаИНН,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Организация.КодПоОКПО, """") КАК ФирмаОКПО,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.НомерСчета, """") КАК НомерСчета,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.Банк.Код, """") КАК БИКБанка,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет, """") КАК СчетБанка,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.Банк.Наименование, """") КАК Банк,
	                |	ВозвратТоваровПоставщику.Контрагент КАК Контрагент,
	                |	ВЫБОР
	                |		КОГДА ВозвратТоваровПоставщику.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                |			ТОГДА ВозвратТоваровПоставщику.Контрагент
	                |		ИНАЧЕ ВозвратТоваровПоставщику.Грузополучатель
	                |	КОНЕЦ КАК Грузополучатель,
	                |	ВозвратТоваровПоставщику.Дата КАК ДатаДокумента,
	                |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОплаты,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.БанкДляРасчетов.Наименование, ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.Банк.Наименование) КАК БанкПолучателяСчетНаОплату,
	                |	ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчетаСчетНаОплату,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.БанкДляРасчетов.Код, ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.Банк.Код) КАК БИКБанкаСчетНаОплату,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.БанкДляРасчетов.КоррСчет, ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет) КАК КоррСчетСчетНаОплату,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.БанкДляРасчетов.Город, ВозвратТоваровПоставщику.Организация.ОсновнойБанковскийСчет.Банк.Город) КАК ГородБанка,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Контрагент.КодПоОКПО, """") КАК КонтрагентОКПО,
	                |	ВЫБОР
	                |		КОГДА ВозвратТоваровПоставщику.Организация.ВариантУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаНДС.ПоВидуОплаты)
	                |			ТОГДА НЕ ВозвратТоваровПоставщику.ДоговорКонтрагента.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхСредств.Наличные)
	                |		ИНАЧЕ ВозвратТоваровПоставщику.Организация.ВариантУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаНДС.Учитывать)
	                |	КОНЕЦ КАК УчитыватьНДС,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Склад.Сувенирный, ЛОЖЬ) КАК СкладСувенирный,
	                |	ВозвратТоваровПоставщику.ДоговорКонтрагента.ВидОплаты КАК ДоговорКонтрагентаВидОплаты,
	                |	ВозвратТоваровПоставщику.Контрагент.ЮрФизЛицо КАК КонтрагентЮрФизЛицо,
	                |	НЕОПРЕДЕЛЕНО КАК ТипДоставки,
	                |	ВозвратТоваровПоставщику.ТорговаяТочка,
	                |	ВозвратТоваровПоставщику.Номер КАК НомерДокументаТОРГ12,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.ДоговорКонтрагента.Номер, """") КАК ДоговорКонтрагентаНомер,
	                |	ВЫБОР
	                |		КОГДА ЕСТЬNULL(ВозвратТоваровПоставщику.ДоговорКонтрагента.ДоговорНаОферту, ЛОЖЬ)
	                |			ТОГДА ЕСТЬNULL(ВозвратТоваровПоставщику.ДоговорКонтрагента.ДатаДоговораОферты, ДАТАВРЕМЯ(1, 1, 1))
	                |		ИНАЧЕ ЕСТЬNULL(ВозвратТоваровПоставщику.ДоговорКонтрагента.Дата, ДАТАВРЕМЯ(1, 1, 1))
	                |	КОНЕЦ КАК ДоговорКонтрагентаДата_НеИспользуется,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.ДоговорКонтрагента.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДоговорКонтрагентаДата,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.ДоговорКонтрагента.ДопустимоеЧислоДнейЗадолженности, 0) КАК ГлубинаКредита,
	                |	ВозвратТоваровПоставщику.ДоговорКонтрагента.ВидРасчетаДней КАК ВидРасчетаДней,
	                |	"""" КАК МаршрутДоставкиСФ,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Контрагент.НаименованиеПлательщикаСФВУПД, """") КАК КонтрагентНаименованиеПлательщикаСФВУПД,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Контрагент.ГрузополучательТОРГ12, """") КАК КонтрагентГрузополучательТОРГ12,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Контрагент.ГрузополучательСФ, """") КАК КонтрагентГрузополучательСФ,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Контрагент.ИНН_СФ, """") КАК КонтрагентИНН_СФ,
	                |	ВозвратТоваровПоставщику.Контрагент.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.ДоговорКонтрагента.ДоговорНаОферту, ЛОЖЬ) КАК ДоговорНаОферту,
	                |	ЕСТЬNULL(ВозвратТоваровПоставщику.Контрагент.ПечататьСчетНаОплату, ЛОЖЬ) КАК ПечататьСчетНаОплату
	                |ИЗ
	                |	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	                |ГДЕ
	                |	ВозвратТоваровПоставщику.Ссылка = &Ссылка";
	
	//ХудинВВ XX-2603 19.06.2019
	//Поправил запрос, теперь в качестве ДоговорКонтрагентаДата всегда берется дата договора, даже для договора оферты
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ОбъектXDTO, Выборка, "ФирмаНаименование,ФирмаИНН,ФирмаОКПО");

	ФирмаАдрес = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Выборка.Организация, "Юридический");
	Если Не ЗначениеЗаполнено(ФирмаАдрес) Тогда 
		ФирмаАдрес = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Выборка.Организация, "Фактический");
	КонецЕсли;
	
	ОбъектXDTO.ФирмаАдрес = ФирмаАдрес;
	
	ФирмаБанковскиеРеквизиты = "";
	
	Если Не ЗначениеЗаполнено(Выборка.НомерСчета) Или Не ЗначениеЗаполнено(Выборка.Банк) Тогда 
		ФирмаБанковскиеРеквизиты = ", р/c " + СокрЛП(Выборка.НомерСчета) + " в " + Выборка.Банк + ?(ЗначениеЗаполнено(Выборка.БИКБанка),Выборка.БИКБанка,"") + 
		?(ЗначениеЗаполнено(Выборка.СчетБанка),", корр/c " + СокрЛП(Выборка.СчетБанка), "")
	КонецЕсли;
	ОбъектXDTO.ФирмаБанковскиеРеквизиты = ФирмаБанковскиеРеквизиты;	
		
	Если ЗначениеЗаполнено(Выборка.КонтрагентГрузополучательТОРГ12) Тогда
		ОбъектXDTO.ГрузополучательТОРГ12 = Выборка.КонтрагентГрузополучательТОРГ12;	
	ИначеЕсли Выборка.ГоловнойКонтрагент <> Выборка.Контрагент Тогда 
		ОбъектXDTO.ГрузополучательТОРГ12  = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.ГоловнойКонтрагент,  Выборка.ДатаДокумента), "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	Иначе	
		ОбъектXDTO.ГрузополучательТОРГ12  = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Грузополучатель,  Выборка.ДатаДокумента), "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	КонецЕсли;
	
	ОбъектXDTO.ПлательщикТОРГ12  = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Контрагент,  Выборка.ДатаДокумента));
	
	//ХудинВВ XX-2603 19.06.2019 ((
	//ПрефиксОснования = ?(Выборка.ДоговорНаОферту, "оферта", "договор");
	//ОбъектXDTO.ОснованиеТОРГ12 = ПрефиксОснования + " № " + СокрЛп(Выборка.ДоговорКонтрагентаНомер) + " от " + Формат(Выборка.ДоговорКонтрагентаДата,"ДФ=dd.MM.yyyy; ДЛФ=D"); 
	ОбъектXDTO.ОснованиеТОРГ12 = " № " + СокрЛп(Выборка.ДоговорКонтрагентаНомер) + " от " + Формат(Выборка.ДоговорКонтрагентаДата,"ДФ=dd.MM.yyyy; ДЛФ=D"); 
	//))
	
	ОбъектXDTO.ИнформацияВПодвалеТОРГ12 = "";
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(Выборка.Организация, Выборка.ДатаДокумента);
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;
	
	Если ТипЗнч(Руководитель) = Тип("Строка") Тогда 
		ОбъектXDTO.ФИОРуководителяТОРГ12 = Руководитель;
	Иначе
		ОбъектXDTO.ФИОРуководителяТОРГ12 = "";
	КонецЕсли;
	
	Если ТипЗнч(Бухгалтер) = Тип("Строка") Тогда 
		ОбъектXDTO.ФИОГлБухгалтераТОРГ12 = Бухгалтер;
	Иначе
		ОбъектXDTO.ФИОГлБухгалтераТОРГ12 = "";
	КонецЕсли;
	
	Если ТипЗнч(Руководители.РуководительДолжность) = Тип("Строка") Тогда 
		ОбъектXDTO.ДолжностьРуководителяТОРГ12 = Руководители.РуководительДолжность;
	Иначе
		ОбъектXDTO.ДолжностьРуководителяТОРГ12 = "";
	КонецЕсли;
	
	//СФ
	СведенияОбПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.ГоловнойКонтрагент, Выборка.ДатаДокумента);
	
	СведенияОПоставщике  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Организация,  Выборка.ДатаДокумента);
	Если Выборка.ГоловнойКонтрагент <> Выборка.Контрагент Тогда 
		СведенияОГрузополучателе  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.ГоловнойКонтрагент,  Выборка.ДатаДокумента);
		Грузополучатель =  Выборка.ГоловнойКонтрагент;
	Иначе	
		СведенияОГрузополучателе  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Грузополучатель,  Выборка.ДатаДокумента);
		Грузополучатель = Выборка.Грузополучатель;
	КонецЕсли;	
	
	ОбъектXDTO.ПродавецСФ = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
	
	Если ЗначениеЗаполнено(Выборка.КонтрагентГрузополучательСФ) Тогда 
		ОбъектXDTO.ГрузополучательСФ = Выборка.КонтрагентГрузополучательСФ;
	Иначе 
		ФактическийАдресГрузополучателя  = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Грузополучатель, "Фактический");
		Если Не ЗначениеЗаполнено(ФактическийАдресГрузополучателя) Тогда 
			ОбъектXDTO.ГрузополучательСФ  = ?(Не ЗначениеЗаполнено(Выборка.Грузополучатель), "", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ЮридическийАдрес,"));
		Иначе
			ОбъектXDTO.ГрузополучательСФ  = ?(Не ЗначениеЗаполнено(Выборка.Грузополучатель), "", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ФактическийАдрес,"));
		КонецЕсли;
	КонецЕсли;
	
	Если Выборка.КонтрагентЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда 
		ОбъектXDTO.АдресПокупателяСФ  = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Выборка.Контрагент, "Юридический");
	Иначе
		ОбъектXDTO.АдресПокупателяСФ  = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Выборка.Контрагент, "Фактический");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.КонтрагентНаименованиеПлательщикаСФВУПД) Тогда 
		ОбъектXDTO.ПокупательСФ = Выборка.КонтрагентНаименованиеПлательщикаСФВУПД;    
	Иначе 
		ОбъектXDTO.ПокупательСФ = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбПокупателе, "ПолноеНаименование,");    
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Выборка.КонтрагентИНН_СФ) Тогда
		ОбъектXDTO.ИННПокупателяСФ = Выборка.КонтрагентИНН_СФ;	
	Иначе
		ОбъектXDTO.ИННПокупателяСФ = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбПокупателе, "ИНН,", Ложь) + ?(Истина, "/" + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбПокупателе, "КПП,", Ложь), "");
	КонецЕсли;	

	ОбъектXDTO.НомерДокументаТОРГ12 = Выборка.НомерДокументаТОРГ12;
	ОбъектXDTO.ШтрихкодТОРГ12  = ОбщегоНазначения.СформироватьШК_дляДок(вхСсылкаНаДокумент);
	
	НомерДокументаСФ = "";
	ШтрихкодСФ = "";
	
	Если УчетНДС.ОпределитьСчетФактураТребуется(вхСсылкаНаДокумент) Тогда
		
		Если Выборка.ВидОперации = Перечисления.ВидыОперацийВозвратПоставщику.ОбратнаяРеализация Тогда
			
			//Выданный
			ДокСФ = УчетНДС.НайтиПодчиненныйДокумент(вхСсылкаНаДокумент, "СчетФактураВыданный");
			Если ЗначениеЗаполнено(ДокСФ) Тогда
				НомерДокументаСФ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСФ, "Номер");
				ШтрихкодСФ = ОбщегоНазначения.СформироватьШК_дляДок(ДокСФ);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбъектXDTO.НомерДокументаСФ 	= НомерДокументаСФ;
	ОбъектXDTO.ШтрихкодСФ 			= ШтрихкодСФ;
	ОбъектXDTO.КонтрагентОКПО 		= Выборка.КонтрагентОКПО;
	ОбъектXDTO.УчитыватьНДС 		= Выборка.УчитыватьНДС;
	
	ОбъектXDTO.ПечататьТОРГ2 		= Выборка.ВидОперации = Перечисления.ВидыОперацийВозвратПоставщику.КорректировочныйСчетФактура; 
	ОбъектXDTO.ПечататьСФ 			= Выборка.ВидОперации = Перечисления.ВидыОперацийВозвратПоставщику.ОбратнаяРеализация; 
	ОбъектXDTO.ПечататьТОРГ12 		= ОбъектXDTO.ПечататьСФ; 
	
КонецПроцедуры

Процедура ДополнитьДаннымиПоПечати_РеализацияТоваровУслуг(ОбъектXDTO, вхСсылкаНаДокумент, СЗ = Неопределено) Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ДополнитьДаннымиПоПечати_РеализацияТоваровУслуг";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("Вид", Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента);
	Запрос.Текст =  "ВЫБРАТЬ
	                |	РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация КАК Организация,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.НаименованиеПолное, """") КАК ФирмаНаименование,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ИНН, """") + ВЫБОР
	                |		КОГДА РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ЮрФизЛицо.Порядок = 0
	                |			ТОГДА ""/"" + ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.КПП, """")
	                |		ИНАЧЕ """"
	                |	КОНЕЦ КАК ФирмаИНН,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.КодПоОКПО, """") КАК ФирмаОКПО,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.НомерСчета, """") КАК НомерСчета,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.Банк.Код, """") КАК БИКБанка,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет, """") КАК СчетБанка,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.Банк.Наименование, """") КАК Банк,
	                |	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	                |	ВЫБОР
	                |		КОГДА РеализацияТоваровУслуг.Грузополучатель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	                |			ТОГДА РеализацияТоваровУслуг.Контрагент
	                |		ИНАЧЕ РеализацияТоваровУслуг.Грузополучатель
	                |	КОНЕЦ КАК Грузополучатель,
	                |	РеализацияТоваровУслуг.Дата КАК ДатаДокумента,
	                |	РеализацияТоваровУслуг.ДатаОплаты КАК ДатаОплаты,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.БанкДляРасчетов.Наименование, РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.Банк.Наименование) КАК БанкПолучателяСчетНаОплату,
	                |	РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчетаСчетНаОплату,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.БанкДляРасчетов.Код, РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.Банк.Код) КАК БИКБанкаСчетНаОплату,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.БанкДляРасчетов.КоррСчет, РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.Банк.КоррСчет) КАК КоррСчетСчетНаОплату,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.БанкДляРасчетов.Город, РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ОсновнойБанковскийСчет.Банк.Город) КАК ГородБанка,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.Контрагент.КодПоОКПО, """") КАК КонтрагентОКПО,
	                |	ВЫБОР
	                |		КОГДА РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ВариантУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаНДС.ПоВидуОплаты)
	                |			ТОГДА НЕ РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.ВидОплаты = ЗНАЧЕНИЕ(Перечисление.ВидыДенежныхСредств.Наличные)
	                |		ИНАЧЕ РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Организация.ВариантУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыУчетаНДС.Учитывать)
	                |	КОНЕЦ КАК УчитыватьНДС,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.Склад.Сувенирный, ЛОЖЬ) КАК СкладСувенирный,
	                |	РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.ВидОплаты КАК ДоговорКонтрагентаВидОплаты,
	                |	РеализацияТоваровУслуг.КонтрагентВзаиморасчетов.ЮрФизЛицо КАК КонтрагентЮрФизЛицо,
	                |	РеализацияТоваровУслуг.ТипДоставки,
	                |	РеализацияТоваровУслуг.ТорговаяТочка,
	                |	РеализацияТоваровУслуг.Номер КАК НомерДокументаТОРГ12,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Номер, """") КАК ДоговорКонтрагентаНомер,
	                |	ВЫБОР
	                |		КОГДА ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.ДоговорНаОферту, ЛОЖЬ)
	                |			ТОГДА ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.ДатаДоговораОферты, ДАТАВРЕМЯ(1, 1, 1))
	                |		ИНАЧЕ ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.Дата, ДАТАВРЕМЯ(1, 1, 1))
	                |	КОНЕЦ КАК ДоговорКонтрагентаДата,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.ДопустимоеЧислоДнейЗадолженности, 0) КАК ГлубинаКредита,
	                |	РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.ВидРасчетаДней КАК ВидРасчетаДней,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.МаршрутДоставки.Наименование, """") КАК МаршрутДоставкиСФ,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.Контрагент.НаименованиеПлательщикаСФВУПД, """") КАК КонтрагентНаименованиеПлательщикаСФВУПД,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.Контрагент.ГрузополучательТОРГ12, """") КАК КонтрагентГрузополучательТОРГ12,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.Контрагент.ГрузополучательСФ, """") КАК КонтрагентГрузополучательСФ,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.Контрагент.ИНН_СФ, """") КАК КонтрагентИНН_СФ,
	                |	РеализацияТоваровУслуг.КонтрагентВзаиморасчетов КАК ГоловнойКонтрагент,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.ДоговорКонтрагентаВзаиморасчетов.ДоговорНаОферту, ЛОЖЬ) КАК ДоговорНаОферту,
	                |	ЕСТЬNULL(РеализацияТоваровУслуг.Контрагент.ПечататьСчетНаОплату, ЛОЖЬ) КАК ПечататьСчетНаОплату
	                |ИЗ
	                |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                |ГДЕ
	                |	РеализацияТоваровУслуг.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(ОбъектXDTO, Выборка, "ФирмаНаименование,ФирмаИНН,ФирмаОКПО");
	
	ФирмаАдрес = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Выборка.Организация, "Юридический");
	Если Не ЗначениеЗаполнено(ФирмаАдрес) Тогда 
		ФирмаАдрес = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Выборка.Организация, "Фактический");
	КонецЕсли;
	
	ОбъектXDTO.ФирмаАдрес = ФирмаАдрес;
	
	ФирмаБанковскиеРеквизиты = "";
	
	Если Не ЗначениеЗаполнено(Выборка.НомерСчета) Или Не ЗначениеЗаполнено(Выборка.Банк) Тогда 
		ФирмаБанковскиеРеквизиты = ", р/c " + СокрЛП(Выборка.НомерСчета) + " в " + Выборка.Банк + ?(ЗначениеЗаполнено(Выборка.БИКБанка),Выборка.БИКБанка,"") + 
		?(ЗначениеЗаполнено(Выборка.СчетБанка),", корр/c " + СокрЛП(Выборка.СчетБанка), "")
	КонецЕсли;
	ОбъектXDTO.ФирмаБанковскиеРеквизиты = ФирмаБанковскиеРеквизиты;	
		
	Если ЗначениеЗаполнено(Выборка.КонтрагентГрузополучательТОРГ12) Тогда
		ОбъектXDTO.ГрузополучательТОРГ12 = Выборка.КонтрагентГрузополучательТОРГ12;	
	ИначеЕсли Выборка.ГоловнойКонтрагент <> Выборка.Контрагент Тогда 
		ОбъектXDTO.ГрузополучательТОРГ12  = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.ГоловнойКонтрагент,  Выборка.ДатаДокумента), "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	Иначе	
		ОбъектXDTO.ГрузополучательТОРГ12  = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Грузополучатель,  Выборка.ДатаДокумента), "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет");
	КонецЕсли;
	
	ОбъектXDTO.ПлательщикТОРГ12  = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Контрагент,  Выборка.ДатаДокумента));
	
	ПрефиксОснования = ?(Выборка.ДоговорНаОферту, "оферта", "договор");
	ОбъектXDTO.ОснованиеТОРГ12 = ПрефиксОснования + " № " + СокрЛп(Выборка.ДоговорКонтрагентаНомер) + " от " + Формат(Выборка.ДоговорКонтрагентаДата,"ДФ=dd.MM.yyyy; ДЛФ=D"); 
	
	ИнформацияВПодвалеТОРГ12 = "";
	Если Выборка.ГлубинаКредита > 0 Тогда 
		ДатаОплаты = УправлениеВзаиморасчетами.ПолучитьДатуОплаты(Выборка.ГлубинаКредита, Выборка.ВидРасчетаДней); 
		ИнформацияВПодвалеТОРГ12 = "Товар подлежит оплате до " + Формат(ДатаОплаты, "ДФ=dd.MM.yyyy; ДЛФ=D");
	КонецЕсли;
	
	ОбъектXDTO.ИнформацияВПодвалеТОРГ12 = ИнформацияВПодвалеТОРГ12;
	Руководители = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизации(Выборка.Организация, Выборка.ДатаДокумента);
	Руководитель = Руководители.Руководитель;
	Бухгалтер    = Руководители.ГлавныйБухгалтер;
	
	Если ТипЗнч(Руководитель) = Тип("Строка") Тогда 
		ОбъектXDTO.ФИОРуководителяТОРГ12 = Руководитель;
	Иначе
		ОбъектXDTO.ФИОРуководителяТОРГ12 = "";
	КонецЕсли;
	
	Если ТипЗнч(Бухгалтер) = Тип("Строка") Тогда 
		ОбъектXDTO.ФИОГлБухгалтераТОРГ12 = Бухгалтер;
	Иначе
		ОбъектXDTO.ФИОГлБухгалтераТОРГ12 = "";
	КонецЕсли;
	
	Если ТипЗнч(Руководители.РуководительДолжность) = Тип("Строка") Тогда 
		ОбъектXDTO.ДолжностьРуководителяТОРГ12 = Руководители.РуководительДолжность;
	Иначе
		ОбъектXDTO.ДолжностьРуководителяТОРГ12 = "";
	КонецЕсли;
	
	//СФ
	СведенияОбПокупателе = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.ГоловнойКонтрагент, Выборка.ДатаДокумента);
	
	СведенияОПоставщике  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Организация,  Выборка.ДатаДокумента);
	Если Выборка.ГоловнойКонтрагент <> Выборка.Контрагент Тогда 
		СведенияОГрузополучателе  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.ГоловнойКонтрагент,  Выборка.ДатаДокумента);
		Грузополучатель =  Выборка.ГоловнойКонтрагент;
	Иначе	
		СведенияОГрузополучателе  = УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Грузополучатель,  Выборка.ДатаДокумента);
		Грузополучатель = Выборка.Грузополучатель;
	КонецЕсли;	
	
	ОбъектXDTO.ПродавецСФ       = //"Продавец: " + 
	ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОПоставщике, "ПолноеНаименование,");
	
	Если ЗначениеЗаполнено(Выборка.КонтрагентГрузополучательСФ) Тогда 
		ОбъектXDTO.ГрузополучательСФ = Выборка.КонтрагентГрузополучательСФ;
	Иначе 
		ФактическийАдресГрузополучателя  = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Грузополучатель, "Фактический");
		Если Не ЗначениеЗаполнено(ФактическийАдресГрузополучателя) Тогда 
			ОбъектXDTO.ГрузополучательСФ  = //"Грузополучатель и его адрес: "              + 
			?(Не ЗначениеЗаполнено(Выборка.Грузополучатель), "", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ЮридическийАдрес,"));
		Иначе
			ОбъектXDTO.ГрузополучательСФ  = //"Грузополучатель и его адр/ес: "              + 
			?(Не ЗначениеЗаполнено(Выборка.Грузополучатель), "", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование,ФактическийАдрес,"));
		КонецЕсли;
	//Иначе
	//	ОбъектXDTO.ГрузополучательСФ  = //"Грузополучатель и его адрес: "              + 
	//	?(Не ЗначениеЗаполнено(Выборка.Грузополучатель), "", ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОГрузополучателе, "ПолноеНаименование")) + "," + Выборка.АдресДоставки;
	КонецЕсли;
	
	Если Выборка.КонтрагентЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо Тогда 
		ОбъектXDTO.АдресПокупателяСФ  = //"Адрес: " + 
		УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Выборка.Контрагент, "Юридический");
	Иначе
		ОбъектXDTO.АдресПокупателяСФ  = //"Адрес: " + 
		УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Выборка.Контрагент, "Фактический");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.КонтрагентНаименованиеПлательщикаСФВУПД) Тогда 
		ОбъектXDTO.ПокупательСФ = Выборка.КонтрагентНаименованиеПлательщикаСФВУПД;    
	Иначе 
		ОбъектXDTO.ПокупательСФ = //"Покупатель: " + 
			ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбПокупателе, "ПолноеНаименование,");    
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Выборка.КонтрагентИНН_СФ) Тогда
		ОбъектXDTO.ИННПокупателяСФ = Выборка.КонтрагентИНН_СФ;	
	Иначе
		ОбъектXDTO.ИННПокупателяСФ = //"Идентификационный номер покупателя (ИНН): " + 
		ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбПокупателе, "ИНН,", Ложь) + ?(Истина, "/" + ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбПокупателе, "КПП,", Ложь), "");
	КонецЕсли;	
	
	//Счет на оплату
	ОбъектXDTO.ПокупательСчетНаОплату = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.ГоловнойКонтрагент, Выборка.ДатаДокумента), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	ОбъектXDTO.БанкПолучателяСчетНаОплату = СОКРЛП(Выборка.БанкПолучателяСчетНаОплату) + ?(ПустаяСтрока(СОКРЛП(Выборка.ГородБанка)), "", " " + СОКРЛП(Выборка.ГородБанка)); 	
	Попытка
		ОбъектXDTO.НомерСчетаСчетНаОплату = Выборка.НомерСчетаСчетНаОплату;
	Исключение
		ЗаписьЖурналаРегистрации("Обмен XDTO",УровеньЖурналаРегистрации.Ошибка,вхСсылкаНаДокумент,вхСсылкаНаДокумент,"Ошибка: "+вхСсылкаНаДокумент,РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
	КонецПопытки;
	ОбъектXDTO.БИКБанкаСчетНаОплату = Выборка.БИКБанкаСчетНаОплату;
	ОбъектXDTO.КоррСчетСчетНаОплату = Выборка.КоррСчетСчетНаОплату;
	
	ОбъектXDTO.НомерДокументаТОРГ12 = Выборка.НомерДокументаТОРГ12;
	ОбъектXDTO.ШтрихкодТОРГ12  = ОбщегоНазначения.СформироватьШК_дляДок(вхСсылкаНаДокумент);
	
	НомерДокументаСФ = "";
	ШтрихкодСФ = "";
	
	// Добавлено Валиахметов А.А.  17.02.2018	
	Если УчетНДС.ОпределитьСчетФактураТребуется(вхСсылкаНаДокумент) Тогда //ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Организация.УчитыватьНДС") Тогда
		ДокСФ = УчетНДС.НайтиПодчиненныйДокумент(вхСсылкаНаДокумент, "СчетФактураВыданный");
	
		//Создаем СФ, если нет
		Если ТипЗнч(ДокСФ) <> Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			СФ = Документы.СчетФактураВыданный.СоздатьДокумент();
			Сф.Заполнить(вхСсылкаНаДокумент);
			Сф.Записать(РежимЗаписиДокумента.Проведение);
			ДокСф = Сф.Ссылка;
		КонецЕсли;
		НомерДокументаСФ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСФ, "Номер");
		ШтрихкодСФ = ОбщегоНазначения.СформироватьШК_дляДок(ДокСФ);
	КонецЕсли;
	// Конец Добавлено Валиахметов А.А.  17.02.2018
	
	ОбъектXDTO.НомерДокументаСФ = НомерДокументаСФ;
	ОбъектXDTO.ШтрихкодСФ = ШтрихкодСФ;
	ОбъектXDTO.КонтрагентОКПО = Выборка.КонтрагентОКПО;
	ОбъектXDTO.УчитыватьНДС = Выборка.УчитыватьНДС;
	ОбъектXDTO.МаршрутДоставкиСФ = Выборка.МаршрутДоставкиСФ;
	
	Если СЗ <> Неопределено Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЕСТЬNULL(СлужебноеЗадание.ТранспортнаяКомпания.Наименование, """") КАК ТранспортнаяКомпания,
		               |	ЕСТЬNULL(СлужебноеЗадание.Водитель.Наименование, """") КАК ВодительНаименование,
		               |	ЕСТЬNULL(СлужебноеЗадание.Водитель.ФизЛицо, ЗНАЧЕНИЕ(Справочник.Физическиелица.ПустаяСсылка)) КАК ВодительФизЛицо,
		               |	ЕСТЬNULL(ВЫБОР
		               |			КОГДА СлужебноеЗадание.Водитель.Автомобиль.Марка ЕСТЬ NULL
		               |				ТОГДА СлужебноеЗадание.Водитель.Автомобиль.Наименование
		               |			ИНАЧЕ СлужебноеЗадание.Водитель.Автомобиль.Марка.Наименование
		               |		КОНЕЦ, """") КАК МаркаАвто,
		               |	ЕСТЬNULL(СлужебноеЗадание.Водитель.ГосударственныйНомер, """") КАК ГосНомерАвто,
		               |	СлужебноеЗадание.Номер КАК НомерСлужебногоЗадания,
		               |	СлужебноеЗадание.Дата КАК ДатаСлужебногоЗадания,
		               |	СлужебноеЗадание.Ссылка,
		               |	СлужебноеЗадание.ДатаНачалаУпаковки,
		               |	СлужебноеЗадание.ВремяНачалаУпаковки,
		               |	СлужебноеЗадание.ДатаОкончанияДовыписки,
		               |	СлужебноеЗадание.ВремяОкончанияДовыписки,
		               |	СлужебноеЗадание.Комментарий КАК КомментарийСЗ,
		               |	ЕСТЬNULL(СлужебноеЗадание.Водитель.Код, """") КАК КодВодителя,
		               |	СлужебноеЗадание.Водитель КАК Водитель,
		               |	ЕСТЬNULL(СлужебноеЗадание.МаршрутДоставки.Наименование, """") КАК МаршрутДоставкиСЗ
		               |ИЗ
		               |	Документ.СлужебноеЗадание КАК СлужебноеЗадание
		               |ГДЕ
		               |	СлужебноеЗадание.Ссылка = &Ссылка";	
		Запрос.УстановитьПараметр("Ссылка", СЗ);
		ВыборкаСЗ = Запрос.Выполнить().Выбрать();
		ВыборкаСЗ.Следующий();
		ЗаполнитьЗначенияСвойств(ОбъектXDTO, ВыборкаСЗ, "ТранспортнаяКомпания,ВодительНаименование,МаркаАвто,ГосНомерАвто,НомерСлужебногоЗадания,ДатаСлужебногоЗадания,КомментарийСЗ,КодВодителя,МаршрутДоставкиСЗ");
		ОбъектXDTO.ВодительТелефон = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ВыборкаСЗ.ВодительФизЛицо, Справочники.ВидыКонтактнойИнформации.ТелефонФизЛицаСлужебный, Выборка.ДатаДокумента);
		ОбъектXDTO.ШтрихкодСЗ = ОбщегоНазначения.СформироватьШК_дляДок(ВыборкаСЗ.Ссылка);
		ОбъектXDTO.ДатаНачалаУпаковки = ВыборкаСЗ.ДатаНачалаУпаковки + Час(ВыборкаСЗ.ВремяНачалаУпаковки) * 60*60 + Минута(ВыборкаСЗ.ВремяНачалаУпаковки) * 60 + Секунда(ВыборкаСЗ.ВремяНачалаУпаковки);
		ОбъектXDTO.ДатаОкончанияДовыписки = ВыборкаСЗ.ДатаОкончанияДовыписки + Час(ВыборкаСЗ.ВремяОкончанияДовыписки) * 60*60 + Минута(ВыборкаСЗ.ВремяОкончанияДовыписки) * 60 + Секунда(ВыборкаСЗ.ВремяОкончанияДовыписки);
		ОбъектXDTO.ИДВодителя = XMLСтрока(ВыборкаСЗ.Водитель);
		
		//18.02.2019 Валиахметов XX-1860 Ошибка отображения Пункта доставки
		Если Не ЗначениеЗаполнено(ОбъектXDTO.МаршрутДоставкиСЗ) Тогда 
			ОбъектXDTO.МаршрутДоставкиСЗ = ОбъектXDTO.МаршрутДоставкиСФ;  
		КонецЕсли;
	Иначе
		ОбъектXDTO.ТранспортнаяКомпания = "";
		ОбъектXDTO.ВодительНаименование = "";
		ОбъектXDTO.МаркаАвто = "";
		ОбъектXDTO.ГосНомерАвто = "";
		ОбъектXDTO.НомерСлужебногоЗадания = "";
		ОбъектXDTO.ДатаСлужебногоЗадания = Дата(1,1,1);
		//ОбъектXDTO.МаршрутДоставкиСФ = "";
		ОбъектXDTO.КомментарийСЗ = "";
		ОбъектXDTO.КодВодителя = "";
		ОбъектXDTO.ВодительТелефон = "";
		ОбъектXDTO.ШтрихкодСЗ = "";
		ОбъектXDTO.ДатаНачалаУпаковки = Дата(1,1,1);
		ОбъектXDTO.ДатаОкончанияДовыписки = Дата(1,1,1);
		ОбъектXDTO.ИДВодителя = "";
		ОбъектXDTO.МаршрутДоставкиСЗ = "";
	КонецЕсли;
	
	// Упрощено Валиахметов А.А 07.06.2018
	
	ПечататьТЧ = Не Выборка.УчитыватьНДС;
	ПечататьСчетНаОплату = Выборка.ПечататьСчетНаОплату;
	ПечататьТОРГ12 = Выборка.УчитыватьНДС;
	ПечататьСФ = Выборка.УчитыватьНДС;
	
	//Если Выборка.ДоговорКонтрагентаВидОплаты = Перечисления.ВидыДенежныхСредств.Наличные Тогда 
	//	ПечататьТЧ = Истина;
	//	ПечататьСчетНаОплату = Ложь;
	//	ПечататьТОРГ12 = Ложь;
	//	ПечататьСФ = Ложь;
	//ИначеЕсли 	Выборка.КонтрагентЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда 
	//	Если Выборка.УчитыватьНДС Тогда 
	//		ПечататьТЧ = Истина;
	//		ПечататьСчетНаОплату = Ложь;
	//		ПечататьТОРГ12 = Ложь;
	//		ПечататьСФ = Ложь;
	//	Иначе
	//		ПечататьТЧ = Истина;
	//		ПечататьСчетНаОплату = Ложь;
	//		ПечататьТОРГ12 = Истина;
	//		ПечататьСФ = Не Выборка.СкладСувенирный;
	//	КонецЕсли;
	//Иначе
	//	ПечататьТЧ = Ложь;
	//	ПечататьСчетНаОплату = Истина;
	//	ПечататьТОРГ12 = Истина;
	//	ПечататьСФ = Не Выборка.СкладСувенирный;
	//КонецЕсли;
	
	ОбъектXDTO.ПечататьТЧ = ПечататьТЧ;
	ОбъектXDTO.ПечататьСчетНаОплату = ПечататьСчетНаОплату;
	ОбъектXDTO.ПечататьТОРГ12 = ПечататьТОРГ12;
	ОбъектXDTO.ПечататьТОРГ2 = Ложь; //ХудинВВ 26022019 XX-1969
	ОбъектXDTO.ПечататьСФ = ПечататьСФ;
		
	ОбъектXDTO.ЭкспрессДоставка = Выборка.ТипДоставки = Справочники.ТипыДоставки.ЭкспрессДоставка;
	ОбъектXDTO.АдресЭкспрессДоставки = 	УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Выборка.ТорговаяТочка, Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента, Выборка.ДатаДокумента);
	
	ОбъектXDTO.ФирмаОплаты = ФормированиеПечатныхФорм.ОписаниеОрганизации(УправлениеКонтактнойИнформацией.СведенияОЮрФизЛице(Выборка.Организация, Выборка.ДатаДокумента), "ПолноеНаименование,ИНН,КПП,ЮридическийАдрес,Телефоны,");
	
	ЦенаДоставки = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(СУММА(РеализацияТоваровУслугУслуги.Сумма), 0) КАК Сумма
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	             //  |	(РеализацияТоваровУслугУслуги.Номенклатура = &Доставка
	            //   |			ИЛИ РеализацияТоваровУслугУслуги.Номенклатура = &ЭкспрессДоставка)  И
	               |	 РеализацияТоваровУслугУслуги.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	// Сергеев - нужно передавать в топ лог новые услуги
	//Запрос.УстановитьПараметр("Доставка", Константы.ОсновнаяУслуга.Получить());
	//Запрос.УстановитьПараметр("ЭкспрессДоставка", Константы.УслугаЭкспрессДоставка.Получить());
	
	ВыборкаДост = Запрос.Выполнить().Выбрать();
	Если ВыборкаДост.Следующий() Тогда 
		ЦенаДоставки = ВыборкаДост.Сумма;
	КонецЕсли;
	ОбъектXDTO.ЦенаДоставки = ЦенаДоставки;
	
	КоличествоДокументовСЗ = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СлужебноеЗаданиеПокупатели.Реализация), 0) КАК КоличествоДокументовСЗ
	               |ИЗ
	               |	Документ.СлужебноеЗадание.Покупатели КАК СлужебноеЗаданиеПокупатели
	               |ГДЕ
	               |	СлужебноеЗаданиеПокупатели.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СЗ);
	ВыборкаКолво = Запрос.Выполнить().Выбрать();
	Если ВыборкаКолво.Следующий() Тогда 
		КоличествоДокументовСЗ = ВыборкаКолво.КоличествоДокументовСЗ;
	КонецЕсли;
	
	ОбъектXDTO.КоличествоДокументовСЗ = КоличествоДокументовСЗ;
КонецПроцедуры

Процедура ДополнитьПустымиДаннымиПоПечати(ОбъектXDTO, вхСсылкаНаДокумент) Экспорт
	
	ОбъектXDTO.ФирмаНаименование = "";
	ОбъектXDTO.ФирмаИНН = "";
	ОбъектXDTO.ФирмаОКПО = "";
	ОбъектXDTO.ФирмаАдрес = "";
	ОбъектXDTO.ФирмаБанковскиеРеквизиты = "";	
	ОбъектXDTO.ГрузополучательТОРГ12  = "";
	ОбъектXDTO.ПлательщикТОРГ12  = "";
	ОбъектXDTO.ОснованиеТОРГ12 = "";
	ОбъектXDTO.ИнформацияВПодвалеТОРГ12 = "";
	ОбъектXDTO.ФИОРуководителяТОРГ12 = "";
	ОбъектXDTO.ФИОГлБухгалтераТОРГ12 = "";
	ОбъектXDTO.ДолжностьРуководителяТОРГ12 = "";
	
	//СФ
	ОбъектXDTO.ПродавецСФ       = "";
	ОбъектXDTO.ГрузополучательСФ  = "";
	ОбъектXDTO.АдресПокупателяСФ  = "";
	ОбъектXDTO.ПокупательСФ = ""; 
	ОбъектXDTO.ИННПокупателяСФ = ""; 
	
	//Счет на оплату
	ОбъектXDTO.ПокупательСчетНаОплату = "";
	ОбъектXDTO.БанкПолучателяСчетНаОплату = ""; 	
	ОбъектXDTO.НомерСчетаСчетНаОплату = "";
	ОбъектXDTO.БИКБанкаСчетНаОплату = "";
	ОбъектXDTO.КоррСчетСчетНаОплату = "";
	
	ОбъектXDTO.НомерДокументаТОРГ12 = "";
	ОбъектXDTO.ШтрихкодТОРГ12  = "";
		
	ОбъектXDTO.НомерДокументаСФ = "";
	ОбъектXDTO.ШтрихкодСФ = "";
	ОбъектXDTO.КонтрагентОКПО = "";
	ОбъектXDTO.УчитыватьНДС = Ложь;
	
	ОбъектXDTO.ТранспортнаяКомпания = "";
	ОбъектXDTO.ВодительНаименование = "";
	ОбъектXDTO.МаркаАвто = "";
	ОбъектXDTO.ГосНомерАвто = "";
	ОбъектXDTO.НомерСлужебногоЗадания = "";
	ОбъектXDTO.ДатаСлужебногоЗадания = Дата(1,1,1);
	ОбъектXDTO.МаршрутДоставкиСФ = "";
	ОбъектXDTO.КомментарийСЗ = "";
	ОбъектXDTO.КодВодителя = "";
	ОбъектXDTO.ВодительТелефон = "";
	ОбъектXDTO.ШтрихкодСЗ = "";
	ОбъектXDTO.ДатаНачалаУпаковки = Дата(1,1,1);
	ОбъектXDTO.ДатаОкончанияДовыписки = Дата(1,1,1);
	
	ОбъектXDTO.ПечататьТЧ = Ложь;
	ОбъектXDTO.ПечататьСчетНаОплату = Ложь;
	ОбъектXDTO.ПечататьТОРГ12 = Ложь;
	ОбъектXDTO.ПечататьСФ = Ложь;
	ОбъектXDTO.ПечататьТОРГ2 = Ложь; //ХудинВВ 26022019 XX-1969
	
	
	ОбъектXDTO.ЭкспрессДоставка = Ложь;
	ОбъектXDTO.АдресЭкспрессДоставки = 	"";
	
	ОбъектXDTO.ФирмаОплаты = "";
	ОбъектXDTO.ЦенаДоставки = 0;
	ОбъектXDTO.ИДВодителя = "";
	ОбъектXDTO.КоличествоДокументовСЗ = 0;
	ОбъектXDTO.МаршрутДоставкиСЗ = "";
	
КонецПроцедуры

Функция СоответствиеСтрокЗаявокИSSID(ТоварыXDTO, ДокументДляПоиска = Неопределено) Экспорт 
	
	ДляТеста = Ложь;
	
	МассивSSID = Новый Массив;
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
		Если ЗначениеЗаполнено(СтрокаТовары.SSID) Тогда 
			МассивSSID.Добавить(СтрокаТовары.SSID);
			Если ДляТеста И СтрДлина(СтрокаТовары.SSID) > 20 Тогда 
				МассивSSID.Добавить(Лев(СтрокаТовары.SSID, 20));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ИдентификаторыСтрокЗаявок.Ссылка КАК СтрокаЗаявки,
	                |	ИдентификаторыСтрокЗаявок.IDSite КАК SSID
	                |ПОМЕСТИТЬ втОбщая
	                |ИЗ
	                |	Справочник.ИдентификаторыСтрокЗаявок КАК ИдентификаторыСтрокЗаявок
	                |ГДЕ
	                |	ИдентификаторыСтрокЗаявок.IDSite В(&МассивSSID)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	втОбщая.SSID
	                |ПОМЕСТИТЬ втБезДублей
	                |ИЗ
	                |	втОбщая КАК втОбщая
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	втОбщая.SSID
	                |
	                |ИМЕЮЩИЕ
	                |	КОЛИЧЕСТВО(втОбщая.СтрокаЗаявки) = 1
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	втОбщая.СтрокаЗаявки,
	                |	втОбщая.SSID
	                |ИЗ
	                |	втБезДублей КАК втБезДублей
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втОбщая КАК втОбщая
	                |		ПО втБезДублей.SSID = втОбщая.SSID
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ Различные
	                |	втОбщая.SSID
	                |ИЗ
	                |	втОбщая КАК втОбщая
	                |ГДЕ
	                |	НЕ втОбщая.SSID В
	                |				(ВЫБРАТЬ
	                |					втБезДублей.SSID
	                |				ИЗ
	                |					втБезДублей)";
	Запрос.УстановитьПараметр("МассивSSID", МассивSSID);
	Результаты = Запрос.ВыполнитьПакет();

	СоотвSSID = Новый Соответствие;
	Выборка = Результаты[2].Выбрать();
	Пока Выборка.Следующий() Цикл 
		СоотвSSID.Вставить(Выборка.SSID, Выборка.СтрокаЗаявки);	
	КонецЦикла;
	
	Если Не Результаты[3].Пустой() Тогда 
		СДублями = Результаты[3].Выгрузить();
		Если ДокументДляПоиска <> Неопределено  Тогда 
			Если ТипЗнч(ДокументДляПоиска) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
				ИмяТЧ = "РазмещениеСтрокПрихода";
			Иначе
				ИмяТЧ = "Товары";
			КонецЕсли;                                                                                
			
			Запрос = Новый Запрос;
			Запрос.Текст =  "ВЫБРАТЬ
			                |	втТовары.SSID
			                |ПОМЕСТИТЬ втТовары
			                |ИЗ
			                |	&втТовары КАК втТовары
			                |;
			                |
			                |////////////////////////////////////////////////////////////////////////////////
			                |ВЫБРАТЬ РАЗЛИЧНЫЕ
			                |	Док.СтрокаЗаявки.IDSite КАК SSID,
			                |	Док.СтрокаЗаявки
			                |ИЗ
			                |	" + ДокументДляПоиска.Метаданные().ПолноеИмя() + "." + ИмяТЧ + " КАК Док
			                |ГДЕ
			                |	Док.Ссылка = &Ссылка
			                |	И Док.СтрокаЗаявки.IDSite В
			                |			(ВЫБРАТЬ
			                |				втТовары.SSID
			                |			ИЗ
			                |				втТовары)";
			Запрос.УстановитьПараметр("Ссылка", ДокументДляПоиска);
			Запрос.УстановитьПараметр("втТовары", СДублями);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл 
				СоотвSSID.Вставить(Выборка.SSID, Выборка.СтрокаЗаявки);	
				НайденнаяСтрока = СДублями.Найти(Выборка.SSID, "SSID");
				Если НайденнаяСтрока <> Неопределено Тогда 
					СДублями.Удалить(НайденнаяСтрока);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если СДублями.Количество() > 0 Тогда 
			Запрос.Текст =  "ВЫБРАТЬ
			                |	втТовары.SSID
			                |ПОМЕСТИТЬ втТовары
			                |ИЗ
			                |	&втТовары КАК втТовары
			                |;
			                |
			                |////////////////////////////////////////////////////////////////////////////////
			                |ВЫБРАТЬ
			                |	втТовары.SSID,
			                |	ИдентификаторыСтрокЗаявок.Ссылка КАК СтрокаЗаявки,
			                |	ИдентификаторыСтрокЗаявок.ПоследняяКорректировка <> ЗНАЧЕНИЕ(Документ.КорректировкаЗаявкиПокупателя.ПустаяСсылка) КАК ЕстьКорректировка
			                |ИЗ
			                |	втТовары КАК втТовары
			                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыСтрокЗаявок КАК ИдентификаторыСтрокЗаявок
			                |		ПО втТовары.SSID = ИдентификаторыСтрокЗаявок.IDSite
			                |
			                |УПОРЯДОЧИТЬ ПО
			                |	ЕстьКорректировка УБЫВ,
			                |	ИдентификаторыСтрокЗаявок.СрокГарантированный УБЫВ";
			Запрос.УстановитьПараметр("втТовары", СДублями);
			Таблица = Запрос.Выполнить().Выгрузить();
			Для Каждого СтрокаТЧ Из СДублями Цикл 
				НайденнаяСтрока = Таблица.Найти(СтрокаТЧ.SSID, "SSID");
				Если НайденнаяСтрока <> Неопределено Тогда 
					СоотвSSID.Вставить(СтрокаТЧ.SSID, НайденнаяСтрока.СтрокаЗаявки);	
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	
	Возврат СоотвSSID;
	
КонецФункции

Функция НайтиСтрокуЗаявкиВСоответствии(СоотвSSID, SSID) Экспорт 
	
	ДляТеста = Ложь;
	
	СтрокаЗаявки = СоотвSSID[SSID];
	
	Если ДляТеста И Не ЗначениеЗаполнено(СтрокаЗаявки) И СтрДлина(SSID) > 20 Тогда 
		СтрокаЗаявки = СоотвSSID[Лев(SSID, 20)];
	КонецЕсли;
	
	Возврат СтрокаЗаявки;
	
КонецФункции

// Конец Добавлено Валиахметов А.А. 2017г.

//Устарело Валиахметов А.А. 22.04.2019
Процедура ПостОбработкаОбъектовПриОбменеСТопЛог() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтложенноеИзменениеОбъектовТопЛог.Объект
	               |ИЗ
	               |	РегистрСведений.ОтложенноеИзменениеОбъектовТопЛог КАК ОтложенноеИзменениеОбъектовТопЛог";
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		Результат = Запрос.Выполнить();
	ЗафиксироватьТранзакцию();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл 
		Попытка
			НачатьТранзакцию(РежимУправленияБлокировкойДанных.Автоматический);
				Если ТипЗнч(Выборка.Объект) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
					ОбработатьПТУ(Выборка.Объект);
				ИначеЕсли ТипЗнч(Выборка.Объект) = Тип("ДокументСсылка.СлужебноеЗадание") Тогда 
					ОбработатьСЗ(Выборка.Объект);
				КонецЕсли;
			НаборЗаписей = РегистрыСведений.ОтложенноеИзменениеОбъектовТопЛог.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Выборка.Объект);
			НаборЗаписей.Записать(Истина);
			
		    ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьПТУ(Объект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.СтрокаПрихода,
	               |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
	               |ПОМЕСТИТЬ втРазмещение
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка.ДокументОснование = &ДокументОснование
	               |	И ПеремещениеТоваровТовары.Ссылка.Проведен
	               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПеремещениеТоваровТовары.СтрокаПрихода
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПоступлениеТоваровУслугТовары.НомерСтроки,
	               |	ЕСТЬNULL(втРазмещение.Количество, 0) - ПоступлениеТоваровУслугТовары.КоличествоРазмещено КАК КоличествоДобавить
	               |ИЗ
	               |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втРазмещение КАК втРазмещение
	               |		ПО ПоступлениеТоваровУслугТовары.СтрокаПрихода = втРазмещение.СтрокаПрихода
	               |ГДЕ
	               |	ПоступлениеТоваровУслугТовары.КоличествоРазмещено - ЕСТЬNULL(втРазмещение.Количество, 0) <> 0
	               |	И ПоступлениеТоваровУслугТовары.Ссылка = &ДокументОснование";
	Запрос.УстановитьПараметр("ДокументОснование", Объект);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		ДокОбъект = Объект.ПолучитьОбъект();
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			СтрокаТЧ = ДокОбъект.Товары.Найти(Выборка.НомерСтроки, "НомерСтроки");
			СтрокаТЧ.КоличествоРазмещено = СтрокаТЧ.КоличествоРазмещено + Выборка.КоличествоДобавить;
		КонецЦикла;
		
		Товары = ДокОбъект.Товары.Выгрузить(, "Количество,КоличествоНеПринято,КоличествоРазмещено");
		Товары.Колонки.Добавить("КоличествоНеРазмещено", ОбщегоНазначения.ОписаниеТипаЧисло(15,3));
		
		Для Каждого СтрокаТЧ Из Товары Цикл 
			СтрокаТЧ.КоличествоНеРазмещено = СтрокаТЧ.Количество - СтрокаТЧ.КоличествоНеПринято - СтрокаТЧ.КоличествоРазмещено;	
		КонецЦикла;
		
		СтрокиНеРазм = Товары.НайтиСтроки(Новый Структура("КоличествоНеРазмещено",0));
		Если Товары.Количество() = СтрокиНеРазм.Количество() Тогда 
			ДокОбъект.СтатусДокумента = Справочники.СтатусыДокументов.ПоступлениеТоваровРазмещен; 
		КонецЕсли;
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ПоступлениеТоваровУслугТовары.НомерСтроки
		               |ИЗ
		               |	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
		               |ГДЕ
		               |	ПоступлениеТоваровУслугТовары.Ссылка = &Ссылка
		               |	И ПоступлениеТоваровУслугТовары.Количество - ПоступлениеТоваровУслугТовары.КоличествоНеПринято - ПоступлениеТоваровУслугТовары.КоличествоРазмещено <> 0";
		Запрос.УстановитьПараметр("Ссылка", Объект);
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда 
			ДокОбъект = Объект.ПолучитьОбъект();
			ДокОбъект.СтатусДокумента = Справочники.СтатусыДокументов.ПоступлениеТоваровРазмещен;
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработатьСЗ(Объект)
	
	СтатусСЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект, "СтатусДокумента");
	Если ЗначениеЗаполнено(СтатусСЗ) И СтатусСЗ <> Справочники.СтатусыДокументов.СлужебноеЗаданиеИдетСборка Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СлужебноеЗаданиеПокупатели.Реализация.СтатусДокумента КАК СтатусДокумента
	               |ИЗ
	               |	Документ.СлужебноеЗадание.Покупатели КАК СлужебноеЗаданиеПокупатели
	               |ГДЕ
	               |	СлужебноеЗаданиеПокупатели.Ссылка = &Ссылка
	               |	И СлужебноеЗаданиеПокупатели.Реализация.СтатусДокумента <> ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.РеализацияТоваровУслугОтгружен)";
	Запрос.УстановитьПараметр("Ссылка", Объект);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		ДокОбъект = Объект.ПолучитьОбъект();
		ДокОбъект.СтатусДокумента = Справочники.СтатусыДокументов.СлужебноеЗаданиеВыданВодителю;
		ДокОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры
//Конец Устарело Валиахметов А.А. 22.04.2019

// ЛНА
Процедура ПланыОбмена_ЗарегистрироватьИзменения(УзлыПолучатели, СсылкаДляРегистрации) Экспорт
КонецПроцедуры

//Семенов И.П. 30.01.2019 XX-1768(
Процедура ИнициализироватьПараметрыДляХраненияТекущихДанных(ВключитьЗапись=Истина) Экспорт 
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ИнициализироватьПараметрыДляХраненияТекущихДанных";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	
	ИнициализироватьТекущиеДанныеОбменаПоОбъектам();
	
	ИнициализироватьВключенаЗаписьИсторииОбменаПоОбъектам();
	
КонецПроцедуры

Процедура ИнициализироватьТекущиеДанныеОбменаПоОбъектам() Экспорт 
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ИнициализироватьТекущиеДанныеОбменаПоОбъектам";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.ТекущиеДанныеОбменаПоОбъектам = Новый ФиксированныйМассив(Новый Массив);
	
КонецПроцедуры

Процедура ИнициализироватьВключенаЗаписьИсторииОбменаПоОбъектам(ВключитьЗапись=Ложь) Экспорт 
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ИнициализироватьВключенаЗаписьИсторииОбменаПоОбъектам";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.ВключенаЗаписьИсторииОбменаПоОбъектам = ВключитьЗапись;
	
КонецПроцедуры

Процедура НачатьЗаписьВИсториюОбменовПоОбъектам() Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_НачатьЗаписьВИсториюОбменовПоОбъектам";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	
	ИнициализироватьТекущиеДанныеОбменаПоОбъектам();
	ИнициализироватьВключенаЗаписьИсторииОбменаПоОбъектам(Истина);
	
КонецПроцедуры

Функция ПолучитьСтруктуруСтрокиИсторииОбъекта()
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ПолучитьСтруктуруСтрокиИсторииОбъекта";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;
	
	Возврат Новый Структура("Период,Объект,Разделитель,ТелоСообщения,Ошибка,ТекстОшибки,ИмяМетаданных,ДополнительныеСведения");
	
КонецФункции

Функция ПолучитьТаблицуИсторииИзПараметраСеанса() Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ПолучитьТаблицуИсторииИзПараметраСеанса";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;
	
	ТаблицаИстории = Новый ТаблицаЗначений;
	
	СтруктураСтроки = ПолучитьСтруктуруСтрокиИсторииОбъекта();
	
	Для Каждого ЭлементСтруктуры Из СтруктураСтроки Цикл 
		
		ТаблицаИстории.Колонки.Добавить(ЭлементСтруктуры.Ключ);
		
	КонецЦикла;
	
	Для Каждого СтруктураСтроки Из ПараметрыСеанса.ТекущиеДанныеОбменаПоОбъектам Цикл 
		
		ЗаполнитьЗначенияСвойств(ТаблицаИстории.Добавить(),СтруктураСтроки);
		
	КонецЦикла;

	Возврат ТаблицаИстории;
	
КонецФункции

Процедура ДобавитьСтрокуИсторииПоОбъекту(Объект, ТелоСообщения, ИмяМетаданных="", Ошибка=Ложь, ТекстОшибки="",Разделитель = Неопределено) Экспорт 
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ДобавитьСтрокуИсторииПоОбъекту";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Объект = Неопределено Или ПараметрыСеанса.ВключенаЗаписьИсторииОбменаПоОбъектам = Ложь Тогда 
		Возврат;
	КонецЕсли;
	
	СтрокаИстории = ПолучитьСтруктуруСтрокиИсторииОбъекта();
	
	СтрокаИстории.Период = ТекущаяДата();
	СтрокаИстории.Объект = Объект;
	ОбъектЭтоСсылка = Ложь;
	ТипОбъекта = ТипЗнч(Объект);
	Если Справочники.ТипВсеСсылки().СодержитТип(ТипОбъекта)
		ИЛИ Документы.ТипВсеСсылки().СодержитТип(ТипОбъекта) Тогда 
		
		ОбъектЭтоСсылка = Истина;
		Если НЕ ЗначениеЗаполнено(Объект.ВерсияДанных) Тогда  
			СтрокаИстории.Объект = Строка(Объект.УникальныйИдентификатор());
		КонецЕсли;		
	КонецЕсли;
	
	ТекстСообщения = ТелоСообщения;
	Попытка
		Если ТипЗнч(ТелоСообщения) = Тип("ДокументDOM") Тогда 
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку("UTF-8");
			ЗаписьDOM = Новый ЗаписьDOM;
			ЗаписьDOM.Записать(ТелоСообщения,ЗаписьXML);
			ТекстСообщения = ЗаписьXML.Закрыть();
		ИначеЕсли ТипЗнч(ТелоСообщения) = Тип("ОбъектXDTO") Тогда  															
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку("UTF-8");
			ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ТелоСообщения);
			ТекстСообщения = ЗаписьXML.Закрыть();
		ИначеЕсли  ТипЗнч(ТелоСообщения) = Тип("Структура") тогда 
			ЗаписьХмл = Новый ЗаписьXML;
			ЗаписьХмл.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьXML(ЗаписьХмл, ТелоСообщения, НазначениеТипаXML.Явное);
			ТекстСообщения = ЗаписьХмл.Закрыть();	
		КонецЕсли;
	Исключение
		ТекстСообщения = "";
	КонецПопытки;
	СтрокаИстории.ТелоСообщения = ТекстСообщения;
	СтрокаИстории.Ошибка        = Ошибка;
	
	Если ТипЗнч(ТекстОшибки) = Тип("Массив") тогда 
		СтрокаИстории.ДополнительныеСведения = новый ХранилищеЗначения(ТекстОшибки);
		//#XX-2733 Kalinin V.A. ( 2019-07-08 )  /*
		ВсеОшибки ="";
		Для Каждого СтрокаОшибки из ТекстОшибки цикл 
			ВсеОшибки =  ВсеОшибки +СтрокаОшибки.ТекстДляОднойОшибки +Символы.ПС;
		КонецЦикла;
		СтрокаИстории.ТекстОшибки   = ВсеОшибки;  
	Иначе 		
		СтрокаИстории.ТекстОшибки   = ТекстОшибки;
	КонецЕсли;

	Если ИмяМетаданных = "" И ОбъектЭтоСсылка Тогда 
		СтрокаИстории.ИмяМетаданных = Объект.Метаданные().ПолноеИмя();
	Иначе
		СтрокаИстории.ИмяМетаданных = ИмяМетаданных;
	КонецЕсли;	
	
	МассивСтрок = Новый Массив(ПараметрыСеанса.ТекущиеДанныеОбменаПоОбъектам);
	
	//#XX-2240 Kalinin V.A. ( 2019-04-11 )  /*
	Если Разделитель = Неопределено тогда 
		СтрокаИстории.Разделитель = МассивСтрок.Количество() + 1;
	иначе 
		СтрокаИстории.Разделитель   = Разделитель;
	КонецЕсли;
	// */
	
	МассивСтрок.Добавить(Новый ФиксированнаяСтруктура(СтрокаИстории));	
	ПараметрыСеанса.ТекущиеДанныеОбменаПоОбъектам = Новый ФиксированныйМассив(МассивСтрок);
	
КонецПроцедуры

Процедура ЗафиксироватьСообщениеВИсторииОбмена(НомерСообщения, Узел, ТелоСообщения, Исходящее=Ложь, Ошибка=Ложь, ТекстОшибки="", Период = Неопределено,КоличествоОбъектов = Неопределено) Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ЗафиксироватьСообщениеВИсторииОбмена";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаИсторииОбъектов = ПолучитьТаблицуИсторииИзПараметраСеанса();
	
	//# Kalinin V.A. ( 2019-03-28 )
	Если КоличествоОбъектов = Неопределено тогда
	КоличествоОбъектов = ТаблицаИсторииОбъектов.Количество();
	КонецЕсли; 
	// */
	
	НаборЗаписей = РегистрыСведений.ИсторияОбменовПоСообщениям.СоздатьНаборЗаписей();
	
	// 13.03.19 Строганов Роман > 
	Если Период = Неопределено Тогда
		Период = ТекущаяДата();
	КонецЕсли;
	// 13.03.19 Строганов Роман <
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.НомерСообщения.Установить(НомерСообщения);
	НаборЗаписей.Отбор.Исходящее.Установить(Исходящее);
	НаборЗаписей.Отбор.Узел.Установить(Узел);
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	
	ЗаписьНабора.Период             = Период;
	ЗаписьНабора.НомерСообщения     = НомерСообщения;
	ЗаписьНабора.Узел               = Узел;
	ЗаписьНабора.Исходящее          = Исходящее;
	
	ЗаписьНабора.ХранилищеСообщения = Новый ХранилищеЗначения(ТелоСообщения, Новый СжатиеДанных(9));
	
	ЗаписьНабора.КоличествоОбъектов = КоличествоОбъектов;
	ЗаписьНабора.Ошибка            	= Ошибка;
	ЗаписьНабора.ТекстОшибки        = ТекстОшибки;	
	ЗаписьНабора.Пользователь       = глЗначениеПеременной("глТекущийПользователь");
	Если КоличествоОбъектов<>0 Тогда 
		ЗаписьНабора.ЕстьОшибкиПоОбъектам = ТаблицаИсторииОбъектов.Найти(Истина,"Ошибка")<>Неопределено;
	КонецЕсли;
	ЗаписьНабора.ПланОбменаПредставление = Узел.Метаданные().Синоним;
	
	НаборЗаписей.Записать(Истина);
	
	Если ПараметрыСеанса.ВключенаЗаписьИсторииОбменаПоОбъектам = Истина 
		И КоличествоОбъектов <> 0 Тогда 
		
		РегистрыСведений.ИсторияОбменовПоОбъектам.СоздатьЗаписиПоСообщению(ЗаписьНабора, ТаблицаИсторииОбъектов);
		
	КонецЕсли;
	
	ИнициализироватьПараметрыДляХраненияТекущихДанных();
	
КонецПроцедуры

Процедура ОткрытьПросмотрИсторииОбменов() Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ОткрытьПросмотрИсторииОбменов";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////
	
	#Если Клиент Тогда
		
	ОбработкаСсылка = Справочники.ВнешниеОбработки.НайтиПоКоду("000000110"); //Просмотр истории обменов
	Если ЗначениеЗаполнено(ОбработкаСсылка) Тогда 
		Попытка
			
			ИмяФайла = ПолучитьИмяВременногоФайла();
			ДвоичныеДанные = ОбработкаСсылка.ХранилищеВнешнейОбработки.Получить();
			ДвоичныеДанные.Записать(ИмяФайла);
			
			Форма = ВнешниеОбработки.ПолучитьФорму(ИмяФайла);
					
			Если Не Форма = Неопределено Тогда			
				Форма.Открыть();		
			Иначе		
				ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла);			
			КонецЕсли;
			
			УдалитьФайлы(ИмяФайла);
			
		Исключение
			
			Сообщить("Выбранный файл не является внешней обработкой.
							   |Либо, данная обработка не предназначена для
							   |запуска в этой конфигурации.",СтатусСообщения.Важное);
		
		КонецПопытки;
	Иначе
		Сообщить("Не удалось найти обработку в справочнике 'Внешние обработки' по коду '000000110'!",СтатусСообщения.Важное);
	КонецЕсли;
	
	#КонецЕсли	
	
КонецПроцедуры

// 14.03.19 Строганов Роман > 
Процедура ОткрытьМониторЗагрузкиЗаявокПокупателей() Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ОткрытьМониторЗагрузкиЗаявокПокупателей";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////
	
	#Если Клиент Тогда
		
	ОбработкаСсылка = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Монитор загрузки заявок покупателей");
	Если ЗначениеЗаполнено(ОбработкаСсылка) Тогда 
		Попытка
			
			ИмяФайла = ПолучитьИмяВременногоФайла();
			ДвоичныеДанные = ОбработкаСсылка.ХранилищеВнешнейОбработки.Получить();
			ДвоичныеДанные.Записать(ИмяФайла);
			
			Форма = ВнешниеОбработки.ПолучитьФорму(ИмяФайла);
					
			Если Не Форма = Неопределено Тогда			
				Форма.Открыть();		
			Иначе		
				ВнешняяОбработка = ВнешниеОбработки.Создать(ИмяФайла);			
			КонецЕсли;
			
			УдалитьФайлы(ИмяФайла);
			
		Исключение
			
			Сообщить("Выбранный файл не является внешней обработкой.
							   |Либо, данная обработка не предназначена для
							   |запуска в этой конфигурации.",СтатусСообщения.Важное);
		
		КонецПопытки;
	Иначе
		Сообщить("Не удалось найти обработку в справочнике 'Внешние обработки' с наименованием 'Монитор загрузки заявок покупателей'!",СтатусСообщения.Важное);
	КонецЕсли;
	
	#КонецЕсли	
	
КонецПроцедуры
// 14.03.19 Строганов Роман <

Процедура ЗарегистрироватьИзмененияВПланеОбмена(Узлы, Данные=Неопределено, КонтекстВызова="") Экспорт 
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ЗарегистрироватьИзмененияВПланеОбмена";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	
	ПланыОбмена.ЗарегистрироватьИзменения(Узлы, Данные);
	
	Если ТипЗнч(Узлы)=Тип("Массив") Тогда 
		Для Каждого Узел Из Узлы Цикл 
			
			ЗаписатьВИсториюРегистрацииПоУзлу(Узел, Данные, КонтекстВызова);
			
		КонецЦикла;
	Иначе
		ЗаписатьВИсториюРегистрацииПоУзлу(Узлы, Данные, КонтекстВызова);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗаписатьВИсториюРегистрацииПоУзлу(Узел, Данные, КонтекстВызова)
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ЗаписатьВИсториюРегистрацииПоУзлу";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	
	ТипДанные = ТипЗнч(Данные); 
	Если ТипДанные = Тип("ОбъектМетаданных") Тогда 
		
		Если Метаданные.Документы.Содержит(Данные) <> Неопределено
			ИЛИ Метаданные.Справочники.Содержит(Данные) <> Неопределено
			Тогда			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ТаблицаОбъекта.Ссылка
			               |ИЗ
			               |	"+Данные.ПолноеИмя()+" КАК ТаблицаОбъекта";
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл 
				
				СоздатьЗаписьИсторииРегистрации(Узел, Выборка.Ссылка, КонтекстВызова, Истина);
				
			КонецЦикла;
		Иначе
			СоздатьЗаписьИсторииРегистрации(Узел, Данные.ПолноеИмя(), КонтекстВызова, Истина);
		КонецЕсли;
		
	ИначеЕсли ТипДанные = Тип("УдалениеОбъекта") Тогда	
		
		СоздатьЗаписьИсторииРегистрации(Узел, Данные.Ссылка, КонтекстВызова);
		
	ИначеЕсли Данные <> Неопределено Тогда 
		
		ОбъектМетаданных = Данные.Метаданные();
		
		Если Метаданные.Документы.Содержит(ОбъектМетаданных)
			ИЛИ Метаданные.Справочники.Содержит(ОбъектМетаданных) 
			Тогда 
			
			СоздатьЗаписьИсторииРегистрации(Узел, Данные.Ссылка, КонтекстВызова);
			
		Иначе
			
			СоздатьЗаписьИсторииРегистрации(Узел, ОбъектМетаданных.ПолноеИмя(), КонтекстВызова);
			
		КонецЕсли;
	Иначе
		
		СоздатьЗаписьИсторииРегистрации(Узел, "Все данные всех объектов", КонтекстВызова, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура СоздатьЗаписьИсторииРегистрации(Узел, СсылкаНаОбъект, КонтекстВызова="", ВсеДанныеОбъекта = Ложь) Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_СоздатьЗаписьИсторииРегистрации";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИсторияРегистрацииОбъектов.СоздатьНаборЗаписей();
	
	Период = ТекущаяДата();
	
	НаборЗаписей.Отбор.Период.Установить(Период);
	НаборЗаписей.Отбор.Ссылка.Установить(СсылкаНаОбъект);
	НаборЗаписей.Отбор.УзелОбмена.Установить(Узел);
	
	ЗаписьНабора = НаборЗаписей.Добавить();
	
	ЗаписьНабора.Период           = Период;
	ЗаписьНабора.УзелОбмена       = Узел;
	ЗаписьНабора.Ссылка           = СсылкаНаОбъект;
	
	ЗаписьНабора.Пользователь     = глЗначениеПеременной("глТекущийПользователь");
	ЗаписьНабора.ИмяКомпьютера    = ИмяКомпьютера();
	ЗаписьНабора.НомерСеанса      = НомерСеансаИнформационнойБазы();
	ЗаписьНабора.Контекст         = КонтекстВызова;
	ЗаписьНабора.ВсеДанныеОбъекта = ВсеДанныеОбъекта;
	
	НаборЗаписей.Записать(Истина);	
	
КонецПроцедуры
//)Семенов И.П.

Процедура ОбменПартКом83_77_РегистрацияИзмененийДокументовПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
КонецПроцедуры

Процедура ОбменПартКом83_77_РегистрацияИзмененийДокументовПередУдалениемПередУдалением(Источник, Отказ) Экспорт
	
КонецПроцедуры

Процедура ОбменПартКом83_77_РегистрацияИзмененийДокументовПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
КонецПроцедуры

// 25.03.19 Строганов Роман > 
Функция ПолучитьXML(ОбъектXDTO, ПространстваИмен = Неопределено) Экспорт
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку();
	Если ПространстваИмен = Неопределено Тогда
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO);
	Иначе
		ФабрикаXDTO.ЗаписатьXML(ЗаписьXML, ОбъектXDTO, ПространстваИмен);
	КонецЕсли;
	
	Возврат ЗаписьXML.Закрыть();
	
КонецФункции

// 25.03.19 Строганов Роман > 
Процедура ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета = Неопределено, СсылкаНаОбъект = Неопределено, Обработано = Истина, Ошибка = Ложь, ТекстОшибки = "") Экспорт
	
	Если СтруктураОтчета <> Неопределено И ТипЗнч(СтруктураОтчета) = Тип("Структура") Тогда
		СтруктураОтчета.СсылкаНаОбъект = СсылкаНаОбъект;
		СтруктураОтчета.Обработано = Обработано;
		СтруктураОтчета.Ошибка = Ошибка;
		СтруктураОтчета.ТекстОшибки = ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

//30.04.2019 Валиахметов 
Функция ЕстьВОчередиНаРегулярнуюВыписку(Знач Склад, Знач Контрагент)  Экспорт 
	
	лКлючАлгоритма = "ОбщийМодуль_ОбменДаннымиКлиентСервер_ЕстьВОчередиНаРегулярнуюВыписку";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ОчередьФормированияСлужебныхЗаданий.ПараметрФормированияСЗ,
	                |	ОчередьФормированияСлужебныхЗаданий.ПараметрФормированияСЗ.МаршрутДоставки КАК МаршрутДоставки
	                |ПОМЕСТИТЬ вт
	                |ИЗ
	                |	РегистрСведений.ОчередьФормированияСлужебныхЗаданий КАК ОчередьФормированияСлужебныхЗаданий
	                |ГДЕ
	                |	ОчередьФормированияСлужебныхЗаданий.ДатаЗавершения = ДАТАВРЕМЯ(1, 1, 1)
	                |	И ОчередьФормированияСлужебныхЗаданий.Параметры_ДатаОкончания >= &ТекДата
	                |	И ОчередьФормированияСлужебныхЗаданий.ПараметрФормированияСЗ.Склад = ВЫРАЗИТЬ(&Склад КАК Справочник.Склады).ФизическийСклад
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	вт.ПараметрФормированияСЗ
	                |ИЗ
	                |	вт КАК вт
	                |ГДЕ
	                |	(ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки.Родитель.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки.Родитель.Родитель.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки2 = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки2.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки2.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки2.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки2.Родитель.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки2.Родитель.Родитель.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки3 = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки3.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки3.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки3.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки3.Родитель.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки3.Родитель.Родитель.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки4 = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки4.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки4.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки4.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки4.Родитель.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки4.Родитель.Родитель.Родитель.Родитель.Родитель = вт.МаршрутДоставки
					//Валиахметов http://jira.part-kom.ru/browse/XX-2534 05.06.2019
					|			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки5 = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки5.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки5.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки5.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки5.Родитель.Родитель.Родитель.Родитель = вт.МаршрутДоставки
	                |			ИЛИ ВЫРАЗИТЬ(&Контрагент КАК Справочник.Контрагенты).ОсновнаяТорговаяТочка.МаршрутДоставки5.Родитель.Родитель.Родитель.Родитель.Родитель = вт.МаршрутДоставки)";
					//Конец Валиахметов http://jira.part-kom.ru/browse/XX-2534 05.06.2019
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Если ЭтоАктивнаяЗадачаJirа(Справочники.ЗадачиJira.XX2518) Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "РегистрСведений.ОчередьФормированияСлужебныхЗаданий", "РегистрСведений.ОчередьФормированияСлужебныхЗаданийНовый");
	КонецЕсли;
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции
//Конец 30.04.2019 Валиахметов 

//ХудинВВ XX-2933 16072019
Процедура ПеререгистрироватьОбъектыВОбмене(УзелОбмена) Экспорт
	
	лКлючАлгоритма = "ПланОбмена_ОбменПартКом83_ОкноПоставщика_МодульМенеджера_ПеререгистрироватьОбъектыВОбмене";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);		
		Возврат;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	МассивСсылок = Новый Массив;
	МассивНЗ	 = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Узел", УзелОбмена);
	МетаданныеПланаОбмена = УзелОбмена.Метаданные();
	
	Для Каждого ТекМета Из МетаданныеПланаОбмена.Состав Цикл
		
		лОбъектМетаданных = ТекМета.Метаданные;
		
		Если ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(лОбъектМетаданных) Тогда 
			Запрос.Текст = "ВЫБРАТЬ
			|	ИзмененияОбъекта.Ссылка КАК Ссылка
			|ИЗ
			|" + лОбъектМетаданных.ПолноеИмя() + ".Изменения КАК ИзмененияОбъекта
			|ГДЕ
			|	НЕ ИзмененияОбъекта.НомерСообщения ЕСТЬ NULL
			|И
			|	ИзмененияОбъекта.Узел = &Узел";
			Выб = Запрос.Выполнить().Выбрать();
			Пока Выб.Следующий() Цикл
				МассивСсылок.Добавить(Выб.Ссылка);
			КонецЦикла;
			
		ИначеЕсли ОбщегоНазначения.ЭтоРегистрСведений(лОбъектМетаданных) Тогда 
			
			лОбъектыДляВыгрузки = СоздатьСтруктуруРегистраСведений(лОбъектМетаданных);
			
			лМенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лОбъектМетаданных);
			
			лИзмеренияРегистра = "";
			
			Если (лОбъектМетаданных.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический) Тогда
				лИзмеренияРегистра = "Период";
			КонецЕсли;
			Если (лОбъектМетаданных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору) Тогда
				лИзмеренияРегистра = лИзмеренияРегистра + ?(ЗначениеЗаполнено(лИзмеренияРегистра),",","") + "Регистратор";
			КонецЕсли;
			
			Для Каждого лИзмерение Из лОбъектМетаданных.Измерения Цикл
				лИзмеренияРегистра = лИзмеренияРегистра + ?(ЗначениеЗаполнено(лИзмеренияРегистра),",","") + лИзмерение.Имя;
			КонецЦикла;
			
			лЗапрос = Новый Запрос;
			лЗапрос.УстановитьПараметр("Узел", УзелОбмена);
			лЗапрос.Текст = 
			
			"ВЫБРАТЬ 
			|	" + лИзмеренияРегистра + "
			|ИЗ
			|	" + лОбъектМетаданных.ПолноеИмя() + ".Изменения КАК Т
			|ГДЕ
			|	Т.Узел = &Узел";
			Таблица = лЗапрос.Выполнить().Выгрузить();
			Для Каждого СтрокаТЧ Из Таблица Цикл 
				НаборЗаписейРегистра = лМенеджерОбъекта.СоздатьНаборЗаписей();
				Для Индекс = 0 По НаборЗаписейРегистра.Отбор.Количество() - 1 Цикл 
					ЭлементОтбора = НаборЗаписейРегистра.Отбор.Получить(Индекс);
					ЭлементОтбора.Установить(СтрокаТЧ[ЭлементОтбора.Имя]);
				КонецЦикла;
				МассивНЗ.Добавить(НаборЗаписейРегистра);
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ЭлементМассива Из МассивСсылок Цикл
		//Семенов И.П. 31.01.2019 XX-1768(
		//ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ЭлементМассива);
		ОбменДаннымиКлиентСервер.ЗарегистрироватьИзмененияВПланеОбмена(УзелОбмена, ЭлементМассива);
		//)Семенов И.П.
	КонецЦикла;
	Для Каждого ЭлементМассива Из МассивНЗ Цикл
		ОбменДаннымиКлиентСервер.ЗарегистрироватьИзмененияВПланеОбмена(УзелОбмена, ЭлементМассива);
	КонецЦикла;
	
КонецПроцедуры

//ХудинВВ XX-2933 16072019
Функция СоздатьСтруктуруРегистраСведений(вхРегистр) Экспорт
	
	лТип = ТипЗнч(вхРегистр);
	лМетаданныеРегистра = Неопределено;
	Если (лТип = Тип("Строка")) тогда
		лМетаданныеРегистра = Метаданные.РегистрыСведений.Найти(вхРегистр);
	ИначеЕсли (лТип = Тип("ОбъектМетаданных")) И Метаданные.РегистрыСведений.Содержит(вхРегистр) тогда
		лМетаданныеРегистра = вхРегистр;
	КонецЕсли;
	
	Если (лМетаданныеРегистра = Неопределено) тогда
		ВызватьИсключение "[лСоздатьСтруктуруРегистраСведений]: неправильный параметр номер 1.";
	КонецЕсли;
	
	выхТабДвиж = Новый ТаблицаЗначений;
	Если (лМетаданныеРегистра.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический) тогда
		выхТабДвиж.Колонки.Добавить("Период", лМетаданныеРегистра.СтандартныеРеквизиты.Период.Тип);
	КонецЕсли;
	Если (лМетаданныеРегистра.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору) тогда
		выхТабДвиж.Колонки.Добавить("Регистратор", лМетаданныеРегистра.СтандартныеРеквизиты.Регистратор.Тип);
	КонецЕсли;
		
	Для Каждого лОбъектМетаданных Из лМетаданныеРегистра.Измерения цикл
		выхТабДвиж.Колонки.Добавить(лОбъектМетаданных.Имя, лОбъектМетаданных.Тип);
	КонецЦикла;
	
	Возврат выхТабДвиж
	
КонецФункции
