

&НаКлиенте
Процедура ИзменитьВидимость()

	Элементы.ГруппаОтображения.Доступность = НаборКонстант.МегаЛогист_Автограф_ПодключениеРазрешено;

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИзменитьВидимость();
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Проверка заполнения
	Если НаборКонстант.МегаЛогист_Автограф_ПодключениеРазрешено Тогда
		Если Не ЗначениеЗаполнено(НаборКонстант.МегаЛогист_Автограф_URLСервиса) Тогда
			Сообщить("Не заполнен: URL сервиса");
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(НаборКонстант.МегаЛогист_Автограф_ПортСервиса) Тогда
			Сообщить("Не заполнен: Порт сервиса");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(НаборКонстант.МегаЛогист_Автограф_ПортСервиса) Тогда
	
		НаборКонстант.МегаЛогист_Автограф_ПортСервиса = 24800;
	
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПроверитьПодключениеНаСервере()
	Если МегаЛогист_РаботаСАвтограф.ПроверитьСоединение() <> Неопределено Тогда
		Сообщить("Соединение с сервисом AutoGRAPH успешно установлено!");
	Иначе 
		Сообщить("Соединение с сервисом AutoGRAPH не установлено. Проверьте URL сервиса и порт подключения.");
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	Записать();
	ПроверитьПодключениеНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура МегаЛогист_Автограф_ПодключениеРазрешеноПриИзменении(Элемент)
	
	ИзменитьВидимость();
	
КонецПроцедуры

