#Область ПараметрыУчетаНДС
Функция  ВариантУчетаНДСОрганизации(Организация) Экспорт
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ВариантыУчетаНДС.НеУчитывать");
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация,"ВариантУчетаНДС");
		
КонецФункции


Функция УчитыватьНДСПоВариантуУчета(ВариантУчетаНДС,ВидОплаты = Неопределено) Экспорт
	
	Если ВариантУчетаНДС  = ПредопределенноеЗначение("Перечисление.ВариантыУчетаНДС.Учитывать") тогда 
		Возврат Истина
	иначеесли ВариантУчетаНДС = ПредопределенноеЗначение("Перечисление.ВариантыУчетаНДС.ПоВидуОплаты") тогда 
		Если ВидОплаты = Неопределено тогда 
			Возврат Ложь
		КонецЕсли;		
		Возврат ВидОплаты = ПредопределенноеЗначение("Перечисление.ВидыДенежныхСредств.Безналичные");
	Иначе 
		возврат Ложь
	КонецЕсли;
	
	
КонецФункции	
#КонецОбласти