
Процедура ПередЗаписью(Отказ)
	лКлючАлгоритма = "ПланыВидовХарактеристик_ОбщедоступныеРеквизиты_МодульОбъект_ПередЗаписью";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////	
	
	Если не ЗначениеЗаполнено(ИмяМетаданных) тогда 
		Типы  = ТипЗначения.Типы();
		Если Типы.Количество() тогда 
			МетаданныеОбъект = Метаданные.НайтиПоТипу(Типы[0])	;
			ИмяМетаданных= МетаданныеОбъект.ПолноеИмя();
		КонецЕсли;	
	КонецЕсли	
	
	КонецПроцедуры
