Функция ПрочитатьПараметрыПользователяИБ(КодПользователя) Экспорт
	Если РольДоступна("ПолныеПрава") Или РольДоступна("СБ") Или РольДоступна("СБ_КРО") Тогда 
		лКлючАлгоритма = "ОбщийМодуль_ПривелегированныйСервер_ПрочитатьПараметрыПользователяИБ";
		лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
		Если Не лЗамена = Неопределено Тогда
			АлгоритмыЗначениеВозврата = Неопределено;		
			Выполнить(лЗамена);		
			Возврат АлгоритмыЗначениеВозврата;		
		КонецЕсли;	
		///////////////////////////////////////////////////////////////////////////
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(КодПользователя);
		Если ПользовательИБ = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("Имя");
		СтруктураВозврата.Вставить("ПолноеИмя");
		СтруктураВозврата.Вставить("АутентификацияСтандартная");
		СтруктураВозврата.Вставить("ПоказыватьВСпискеВыбора");
		СтруктураВозврата.Вставить("ПарольУстановлен");
		СтруктураВозврата.Вставить("АутентификацияОС");
		СтруктураВозврата.Вставить("ПользовательОС");
		СтруктураВозврата.Вставить("ОсновнойИнтерфейс");
		
		ЗаполнитьЗначенияСвойств(СтруктураВозврата, ПользовательИБ);
		СтруктураВозврата.Вставить("ОсновнойИнтерфейс", СокрЛП(ПользовательИБ.ОсновнойИнтерфейс));
		
		СтруктураВозврата.Вставить("Роли", Новый Массив);
		Для Каждого лРоль Из ПользовательИБ.Роли Цикл
			СтруктураВозврата.Роли.Добавить(Новый Структура("Имя", лРоль.Имя));
		КонецЦикла;
		
		
		Возврат СтруктураВозврата;	
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьПользователей() Экспорт
	Если РольДоступна("ПолныеПрава") Или РольДоступна("СБ") Или РольДоступна("СБ_КРО") Тогда 
		Пользователи1 = ПользователиИнформационнойБазы.ПолучитьПользователей();
		Возврат Пользователи1;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции

Функция ПолучитьПравоПользователя(ПравоДоступа,ВыбПользователь) Экспорт
	Если РольДоступна("ПолныеПрава") Или РольДоступна("СБ") Или РольДоступна("СБ_КРО") Тогда 
		Право = ПравоДоступа(ПравоДоступа,Метаданные,ВыбПользователь);
		Возврат Право;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции	