Функция МенеджерКлиента(Контрагент,ВидМенеджера,Период = Неопределено) Экспорт
	лКлючАлгоритма = "РегистрСыедений_МенеджерыТорговыхТочек_МенеджерКлиента";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////
	
	Запрос=Новый Запрос;
	ЗАПРОС.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
	|	МенеджерыТорговыхТочекСрезПоследних.Менеджер
	|ИЗ
	|	РегистрСведений.МенеджерыТорговыхТочек.СрезПоследних(&Период, ) КАК МенеджерыТорговыхТочекСрезПоследних
	|ГДЕ
	|	МенеджерыТорговыхТочекСрезПоследних.Контрагент = &Контрагент
	|	И НЕ МенеджерыТорговыхТочекСрезПоследних.Менеджер = ЗНАЧЕНИЕ(Справочник.Менеджеры.Пустаяссылка)
	|	И МенеджерыТорговыхТочекСрезПоследних.ВидМенеджера = &ВидМенеджера";
	Запрос.УстановитьПараметр("Контрагент",Контрагент.Ссылка);
	Запрос.УстановитьПараметр("ВидМенеджера",Перечисления.ВидыМенеджеров.Продажи);
	Запрос.УстановитьПараметр("Период",?(Период = Неопределено,ТекущаяДата(),Период));
	Результат=Запрос.Выполнить();
	Если Результат.Пустой() тогда 
		возврат  Справочники.Менеджеры.ПустаяСсылка();
	иначе 
		Выборка  = Результат.Выбрать();
		Выборка.Следующий();
		Возврат выборка.Менеджер ;
	КонецЕсли;	
	
		
КонецФункции