Функция ПространствоИмен() Экспорт
	Возврат   "http://ws-02.part-kom.ru/partkom83/hs/SiteExchange/XMLSchema";
КонецФункции

Функция СкладРозничнойЗаявки()  Экспорт
	Возврат Константы.СкладОсновной.Получить();	
КонецФункции	

Функция ГородКОнтрагента(Регион) Экспорт
ЗапросГорода  = новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                             |	Города.Ссылка КАК Город
                             |ИЗ
                             |	Справочник.Города КАК Города
                             |ГДЕ
                             |	Города.Регион = &Регион");
ЗапросГорода.УстановитьПараметр("Регион",Регион);
Результат = ЗапросГорода.Выполнить();
Если Не Результат.Пустой() тогда 
	 Выборка  = Результат.Выбрать();
	 Выборка.Следующий();
	 Возврат  Выборка.Город;
КонецЕсли; 
		
КонецФункции	


Функция НайтиВидОбъектаПоСтроке(ВидОбъектаСтрокой) Экспорт
	ПозицияТочки = СтрНайти(ВидОбъектаСтрокой,".");
	ПредставлениеОбъекта  = Сред(ВидОбъектаСтрокой,ПозицияТочки+1);
	
	МетаданныеПеречисления  = Перечисления.ВидыОбъектовОбмена.ПустаяСсылка().Метаданные();
	Если МетаданныеПеречисления.ЗначенияПеречисления.Найти(ПредставлениеОбъекта)  = Неопределено тогда 
		возврат ВидОбъектаСтрокой ;
	Иначе 
		Возврат  Перечисления.ВидыОбъектовОбмена[ПредставлениеОбъекта];
	КонецЕсли;	
	
		
КонецФункции	