
#Область  СостояниеЗаявокЗаказов

Функция СтрокаЗаявкиЗакрыта(СтрокаЗаявки,МоментВремемени = Неопределено) Экспорт 
Остаток = РегистрыНакопления.ЗаявкиПокупателей.Остатки(МоментВремемени,Новый Структура("СтрокаЗаявки",СтрокаЗаявки),"СтрокаЗаявки","Количество");
Если Остаток.Количество() тогда 
	Возврат Ложь;
иначе 
	Возврат Истина;
КонецЕсли;

КонецФункции	


Функция ЗаявкаЗакрыта(ДокументСсылка)  Экспорт
ЗапросОстатков = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                              |	ЗаявкиПокупателейОстатки.СтрокаЗаявки
                              |ИЗ
                              |	Документ.ЗаявкаПокупателя.Товары КАК ЗаявкаПокупателяТовары
                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаявкиПокупателей.Остатки КАК ЗаявкиПокупателейОстатки
                              |		ПО ЗаявкаПокупателяТовары.СтрокаЗаявки = ЗаявкиПокупателейОстатки.СтрокаЗаявки
                              |			И (ЗаявкиПокупателейОстатки.КоличествоОстаток > 0)
                              |ГДЕ
                              |	ЗаявкаПокупателяТовары.Ссылка = &ДокументСсылка");
ЗапросОстатков.УстановитьПараметр("ДокументСсылка",ДокументСсылка);
Результат = ЗапросОстатков.Выполнить();
Возврат Результат.Пустой() 	
КонецФункции	
	
#КонецОбласти