//////////////////////////////////////////////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////////////
// БИБЛИОТЕКА ДЛЯ РАБОТЫ С ОБЪЕКТАМИ ГРАФИЧЕСКОЙ СХЕМЫ v.1.1. Константы
//        											© Быков Александр, 2017
//////////////////////////////////////////////////////////////////////////////////////


Функция МинимальнаяДлинаСегмента() Экспорт
	
	Возврат 20;
КонецФункции // 
 
Функция ВысотаВарианта() Экспорт
	Возврат 18;
КонецФункции // 
 
Функция ТипОбъектаДекорация() Экспорт
	Возврат 0;
КонецФункции // 
 
Функция ТипОбъектаЛиния() Экспорт
	Возврат 1;
КонецФункции // 
 
Функция ТипОбъектаСтарт() Экспорт
	Возврат 2;
КонецФункции // 
 
Функция ТипОбъектаЗавершение() Экспорт
	Возврат 3
КонецФункции // 
 
Функция ТипОбъектаУсловие() Экспорт
	Возврат 4;
КонецФункции // 
 
Функция ТипОбъектаДействие() Экспорт
	Возврат 5;
КонецФункции // 
 
Функция ТипОбъектаВыборВарианта() Экспорт
	Возврат 6;
КонецФункции // 
 
Функция ТипОбъектаРазделение() Экспорт
	Возврат 7;
КонецФункции // 
 
Функция ТипОбъектаСлияние() Экспорт
	Возврат 8;
КонецФункции // 
 
Функция ТипОбъектаОбработка() Экспорт
	Возврат 9;
КонецФункции // 
 
Функция ТипОбъектаВложенныйПроцесс() Экспорт
	Возврат 10;
КонецФункции // 
 
