Процедура Добавить(СсылкаНаДокумент, ДатаДокумента = Неопределено ) Экспорт
	
	Если ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаСоздания = НачалоДня(ДатаДокумента);
	Иначе
		ДатаСоздания = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Дата"));
	КонецЕсли;
	
	Если Не ПроведениеДокументовКлиентСервер.ИспользуютсяМФП(ДатаСоздания) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГраницаМФП.ДатаСоздания
		|ИЗ
		|	РегистрСведений.ДатыДляСозданияМФП КАК ГраницаМФП
		|ГДЕ
		|	ГраницаМФП.ДатаСоздания <= &ДатаСоздания";
	
	Запрос.УстановитьПараметр("ДатаСоздания", ДатаСоздания);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		 НЗ = РегистрыСведений.ГраницаМФП.СоздатьНаборЗаписей();
		 НоваяЗапись =  НЗ.Добавить();
		 НоваяЗапись.ДатаСоздания = ДатаСоздания;
		 НоваяЗапись.Документ	 = СсылкаНаДокумент;
		 НЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры