
Процедура Добавить(АктРассмотренияВозврата, Событие, ИсточникСобытия = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СобытияКОбработкеАктовРассмотренияВозврата.АктРассмотренияВозврата
	|ИЗ
	|	РегистрСведений.СобытияКОбработкеАктовРассмотренияВозврата КАК СобытияКОбработкеАктовРассмотренияВозврата
	|ГДЕ
	|	СобытияКОбработкеАктовРассмотренияВозврата.АктРассмотренияВозврата = &АктРассмотренияВозврата
	|	И СобытияКОбработкеАктовРассмотренияВозврата.Событие = &Событие ";
	
	Запрос.УстановитьПараметр("АктРассмотренияВозврата", АктРассмотренияВозврата);
	Запрос.УстановитьПараметр("Событие", Событие);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	
		МЗ 							= РегистрыСведений.СобытияКОбработкеАктовРассмотренияВозврата.СоздатьМенеджерЗаписи();
		МЗ.Период 					= ТекущаяДата();
		МЗ.АктРассмотренияВозврата 	= АктРассмотренияВозврата;
		МЗ.Событие 					= Событие;
		МЗ.ПараметрСобытия 			= ИсточникСобытия;
		МЗ.Записать();	
	КонецЕсли;
	
КонецПроцедуры



