
//// ОБРАБОТЧИКИ МОДУЛЯ ОБЪЕКТА

Процедура ВыполнитьПроведение(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ВыполнитьПроведение";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	Если ПроведениеДокументовКлиентСервер.ОперативноеПроведение(вхПараметры) И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата") + 20 < ТекущаяДата() Тогда 
		вхПараметры.Вставить("ОперативноеПроведение", Ложь);
	КонецЕсли;
	//Если Не ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "НеПерепроводитьПартии", Неопределено) Тогда 
	//	вхПараметры.Вставить("НеПерепроводитьПартии", Ложь);
	//КонецЕсли;
	
	// 28.01.19 Строганов Роман > XX-1835
	Если Не ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "СобственнаяПартия", Неопределено) Тогда 
		вхПараметры.Вставить("СобственнаяПартия", Ложь);
	КонецЕсли;
	// 28.01.19 Строганов Роман < XX-1835
	
	лФильтр = Неопределено;
	ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "Фильтр", лФильтр);	
		
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ТоварыНаСкладах") тогда
		ЗаблокироватьРегистрыТоварыНаСкладах(вхСсылкаНаДокумент);

		Если Не ПроведениеДокументовКлиентСервер.ЧастичноеСписаниеРазмещений(вхСсылкаНаДокумент) Тогда 
			КонтрольОстатков(вхСсылкаНаДокумент, вхОтказ,вхПараметры); //Cвой контроль с учетом собств. резерва
			ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "ТоварыНаСкладах",РегистрыНакопления_ТоварыНаСкладах(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
		КонецЕсли;	
		ОбновитьПоступление(вхСсылкаНаДокумент);
	КонецЕсли;
	
	Если РаботаСоСтатусамиДокументовСервер.НоваяСхемаЗакрытияЗаявок(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент,"Дата")) тогда  
		Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ЗаявкиПокупателей") тогда
			ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "ЗаявкиПокупателей", РегистрыНакопления_ЗаявкиПокупателей(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
		КонецЕсли;
	КонецЕсли;
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "РезервыТоваров") тогда
		ЗаблокироватьРегистрРезервыНаСкладах(вхСсылкаНаДокумент);
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "РезервыТоваров", РегистрыНакопления_РезервыТоваров(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
	КонецЕсли;
	
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ПартииТоваров") 
		//ИЛИ ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ПартииТоваровVMI") 
		//ИЛИ ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ПартииТоваровВПути") 
		Тогда
		
		ЗаблокироватьРегистрПартииТоваров(вхСсылкаНаДокумент);

		лОчищать = ПроведениеДокументовКлиентСервер.НеобходимоОчиститьДвиженияПартииТоваров(вхСсылкаНаДокумент, лФильтр);		
		
		НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПартионныйУчет, вхПараметры);
		
		Если лОчищать тогда
			Если лФильтр = Неопределено Тогда 
				ПроведениеДокументовКлиентСервер.ОчиститьДвиженияДокумента(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.ПартииТоваров);
				лБазовая = Неопределено;
				ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ПартииТоваров", лБазовая);
			Иначе
				// Очищаем только движения по фильтру
				лБазовая = ПроведениеДокументовКлиентСервер.ЗначенияДвиженийДокумента(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.ПартииТоваров);	
				лРазделенныеБазовая = РаботаСПоследовательностямиКлиентСервер.РазделенныеДанные(лБазовая, лФильтр);
				ОбщегоНазначения.ЗаписатьДвиженияДокументаБезОбработки(вхСсылкаНаДокумент, РегистрыНакопления.ПартииТоваров, лРазделенныеБазовая.Исключенные, Истина); 
				лБазовая = лРазделенныеБазовая.Исключенные;
			КонецЕсли;
		Иначе
			лБазовая = ПроведениеДокументовКлиентСервер.ЗначенияДвиженийДокумента(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.ПартииТоваров);	
		КонецЕсли;
		
		лРазделенныеБазовая = РаботаСПоследовательностямиКлиентСервер.РазделенныеДанные(лБазовая, лФильтр);
		лИсходная = лРазделенныеБазовая.Включенные;
		//Если вхПараметры.НеПерепроводитьПартии Тогда 
		//	Структура = Неопределено;
		//	ПартииСписаны = ПроведениеДокументовКлиентСервер.СписатьПартииБезПерепроведения(вхСсылкаНаДокумент, вхОтказ, вхПараметры, лФильтр, лБазовая, Структура);
		//	//СписатьПартииБезПерепроведения(вхСсылкаНаДокумент, вхОтказ, вхПараметры, лФильтр, лБазовая, Структура);  	
		//Иначе
		//	ПартииСписаны = Ложь; 
		//КонецЕсли;	
		//Если Не ПартииСписаны Тогда 
			Структура = РегистрыНакопления_ПартииТоваров(вхСсылкаНаДокумент, вхОтказ, вхПараметры, лФильтр);
		//КонецЕсли;
		Если Не вхОтказ Тогда 
			лТребуемая = Структура.ПартииТоваров;
			
			//Удалим служебные колонки 
			ОбщегоНазначения.УдалитьКолонки(лИсходная, лТребуемая);
			
			лРазностныеДанные = РаботаСПоследовательностямиКлиентСервер.РазностныеДанные(лИсходная, лТребуемая); 
			ПроведениеДокументовКлиентСервер.ЗаписатьДвижения(вхСсылкаНаДокумент, Метаданные.РегистрыНакопления.ПартииТоваров,
			лРазностныеДанные, лРазделенныеБазовая.Исключенные);
			
			ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПартионныйУчет, вхПараметры);
			Если лФильтр = Неопределено Тогда 
				РаботаСПоследовательностямиКлиентСервер.ЗарегистрироватьОбъектПоСсылке(вхСсылкаНаДокумент, "ПартионныйУчет", Истина);
			КонецЕсли;
			ПроведениеДокументовКлиентСервер.ЗаписатьИзмененныеДвижения(вхСсылкаНаДокумент, лФильтр, Структура.ПартииТоваровVMI, Метаданные.РегистрыНакопления.ПартииТоваровVMI);
			
			ПроведениеДокументовКлиентСервер.ЗаписатьИзмененныеДвижения(вхСсылкаНаДокумент, лФильтр, Структура.ПартииТоваровВПути, Метаданные.РегистрыНакопления.ПартииТоваровВПути);
		КонецЕсли;	
	КонецЕсли;
	
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ТоварыКРезервированию") тогда                   
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "ТоварыКРезервированию",
		РегистрыНакопления_ТоварыКРезервированию(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
	КонецЕсли;
	
		
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ТоварыВПути") тогда
		КонтрольОстатковТоваровВПути(вхСсылкаНаДокумент, вхОтказ);
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "ТоварыВПути",
		РегистрыНакопления_ТоварыВПути(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
	КонецЕсли;
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ПополнениеСклада") тогда
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "ПополнениеСклада",
		РегистрыНакопления_ПополнениеСклада(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
	КонецЕсли;
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ОтказыПоЗаявкам") тогда
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "ОтказыПоЗаявкам",
		РегистрыНакопления_ОтказыПоЗаявкам(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
	КонецЕсли;
	
	Если ПроведениеДокументовКлиентСервер.ПроводитсяПо(вхПараметры, "ТоварыКРазмещениюНаСкладах") тогда                   
		ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "ТоварыКРазмещениюНаСкладах",
		РегистрыНакопления_ТоварыКРазмещениюНаСкладах(вхСсылкаНаДокумент, вхОтказ, вхПараметры));
	КонецЕсли;

	
		
КонецПроцедуры

Процедура ВыполнитьОтменуПроведения(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ВыполнитьОтменуПроведения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	
	НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПартионныйУчет, вхПараметры);
	ПроведениеДокументовКлиентСервер.ОчиститьДвиженияДокумента(вхСсылкаНаДокумент);
	ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, Метаданные.Последовательности.ПартионныйУчет, вхПараметры);
	
	РаботаСПоследовательностямиКлиентСервер.ЗарегистрироватьОбъектПоСсылке(вхСсылкаНаДокумент, "ПартионныйУчет", Ложь);
	
	ОбновитьПоступление(вхСсылкаНаДокумент, Ложь);
	
КонецПроцедуры

//// ТАБЛИЦЫ ДВИЖЕНИЙ ДОКУМЕНТОВ

Функция РегистрыНакопления_ЗаявкиПокупателей(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_РегистрыНакопления_ЗаявкиПокупателей";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ЗаявкиПокупателей", ТаблицаДвижений);
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент,"Дата") < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(вхСсылкаНаДокумент.ДокументОснование) и ТипЗнч(вхСсылкаНаДокумент.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") тогда
		
	Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент,"ДокументОснование.Контрагент");
	Если РаботаСоСтатусамиДокументовСервер.КонтрагентЗакрываетсяБезРазмещения(Контрагент) тогда 
		Возврат ТаблицаДвижений;
	КонецЕсли;
	КонецЕсли;	

	
	
	ЗапросЗаявок = новый Запрос("ВЫБРАТЬ
	                            |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	                            |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество,
	                            |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель КАК Склад,
	                            |	ПеремещениеТоваровТовары.Номенклатура,
	                            |	ПеремещениеТоваровТовары.Качество,
	                            |	ПеремещениеТоваровТовары.Ссылка.Дата КАК Период,
	                            |	ПеремещениеТоваровТовары.СтрокаЗаявки.Количество КАК КоличествоВЗаявке
	                            |ПОМЕСТИТЬ ВТДанныеПеремещения
	                            |ИЗ
	                            |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                            |ГДЕ
	                            |	ПеремещениеТоваровТовары.Ссылка.Ссылка = &ДокументСсылка
	                            |	И ПеремещениеТоваровТовары.СтрокаЗаявки.ТипПоставки = ЗНАЧЕНИЕ(Перечисление.ТипПоставки.ПополнениеСклада)
								//|	И ПеремещениеТоваровТовары.СтрокаЗаявки.СостояниеЗаявки <> ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ЗаявкаПокупателяЗакрыт)
	                            |
	                            |СГРУППИРОВАТЬ ПО
	                            |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	                            |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
	                            |	ПеремещениеТоваровТовары.Номенклатура,
	                            |	ПеремещениеТоваровТовары.Качество,
	                            |	ПеремещениеТоваровТовары.Ссылка.Дата,
	                            |	ПеремещениеТоваровТовары.СтрокаЗаявки.Количество
	                            |;
	                            |
	                            |////////////////////////////////////////////////////////////////////////////////
	                            |ВЫБРАТЬ
	                            |	ВТДанныеПеремещения.Склад КАК Склад,
	                            |	ВТДанныеПеремещения.Номенклатура КАК Номенклатура,
	                            |	ВТДанныеПеремещения.Качество,
	                            |	ВТДанныеПеремещения.СтрокаЗаявки,
	                            |	ЗаявкиПокупателей.ТорговаяТочка,
	                            |	ЗаявкиПокупателей.ДоговорКонтрагента,
	                            |	СУММА(ВЫБОР
	                            |			КОГДА ВТДанныеПеремещения.Количество + ЕСТЬNULL(ОтказыПоЗаявкамОбороты.КоличествоОборот, 0) <= ВТДанныеПеремещения.КоличествоВЗаявке
	                            |				ТОГДА ВЫБОР
	                            |						КОГДА ВТДанныеПеремещения.Количество <= ЗаявкиПокупателейОстатки.КоличествоОстаток
	                            |							ТОГДА ВТДанныеПеремещения.Количество
	                            |						ИНАЧЕ ЗаявкиПокупателейОстатки.КоличествоОстаток
	                            |					КОНЕЦ
	                            |			ИНАЧЕ ВЫБОР
	                            |					КОГДА ВТДанныеПеремещения.КоличествоВЗаявке - ЕСТЬNULL(ОтказыПоЗаявкамОбороты.КоличествоОборот, 0) <= ЗаявкиПокупателейОстатки.КоличествоОстаток
	                            |						ТОГДА ВТДанныеПеремещения.КоличествоВЗаявке - ЕСТЬNULL(ОтказыПоЗаявкамОбороты.КоличествоОборот, 0)
	                            |					ИНАЧЕ ЗаявкиПокупателейОстатки.КоличествоОстаток
	                            |				КОНЕЦ
	                            |		КОНЕЦ) КАК Количество,
	                            |	СУММА(ВЫБОР
	                            |			КОГДА ЕСТЬNULL(ЗаявкиПокупателей.Количество, 0) = 0
	                            |				ТОГДА 0
	                            |			ИНАЧЕ ЕСТЬNULL(ЗаявкиПокупателей.СуммаРегл, 0) / ЗаявкиПокупателей.Количество * ВТДанныеПеремещения.Количество - ЕСТЬNULL(ОтказыПоЗаявкамОбороты.КоличествоОборот, 0)
	                            |		КОНЕЦ) КАК СуммаРегл,
	                            |	СУММА(ВЫБОР
	                            |			КОГДА ЕСТЬNULL(ЗаявкиПокупателей.Количество, 0) = 0
	                            |				ТОГДА 0
	                            |			ИНАЧЕ ЕСТЬNULL(ЗаявкиПокупателей.СуммаУпр, 0) / ЗаявкиПокупателей.Количество * ВТДанныеПеремещения.Количество - ЕСТЬNULL(ОтказыПоЗаявкамОбороты.КоличествоОборот, 0)
	                            |		КОНЕЦ) КАК СуммаУпр,
	                            |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	                            |	ВТДанныеПеремещения.Период КАК Период
	                            |ИЗ
	                            |	ВТДанныеПеремещения КАК ВТДанныеПеремещения
	                            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаявкиПокупателей КАК ЗаявкиПокупателей
	                            |		ПО (ЗаявкиПокупателей.СтрокаЗаявки = ВТДанныеПеремещения.СтрокаЗаявки)
	                            |			И (ЗаявкиПокупателей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
	                            |			И (ЗаявкиПокупателей.Регистратор ССЫЛКА Документ.ЗаявкаПокупателя
	                            |				ИЛИ ЗаявкиПокупателей.Регистратор ССЫЛКА Документ.КорректировкаЗаявкиПокупателя)
	                            |			И (ЗаявкиПокупателей.Период <= ВТДанныеПеремещения.Период)
	                            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОтказыПоЗаявкам.Обороты(
	                            |				,
	                            |				&Период,
	                            |				,
	                            |				СтрокаЗаявки В
	                            |					(ВЫБРАТЬ
	                            |						ВТДанныеПеремещения.СтрокаЗаявки КАК СтрокаЗаявки
	                            |					ИЗ
	                            |						ВТДанныеПеремещения КАК ВТДанныеПеремещения)) КАК ОтказыПоЗаявкамОбороты
	                            |		ПО ВТДанныеПеремещения.СтрокаЗаявки = ОтказыПоЗаявкамОбороты.СтрокаЗаявки
	                            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаявкиПокупателей.Остатки(
	                            |				&Период,
	                            |				СтрокаЗаявки В
	                            |					(ВЫБРАТЬ
	                            |						ВТДанныеПеремещения.СтрокаЗаявки КАК СтрокаЗаявки
	                            |					ИЗ
	                            |						ВТДанныеПеремещения КАК ВТДанныеПеремещения)) КАК ЗаявкиПокупателейОстатки
	                            |		ПО ВТДанныеПеремещения.СтрокаЗаявки = ЗаявкиПокупателейОстатки.СтрокаЗаявки
	                            |			И (ЗаявкиПокупателейОстатки.КоличествоОстаток > 0)
	                            |
	                            |СГРУППИРОВАТЬ ПО
	                            |	ВТДанныеПеремещения.Склад,
	                            |	ВТДанныеПеремещения.Номенклатура,
	                            |	ВТДанныеПеремещения.Качество,
	                            |	ВТДанныеПеремещения.СтрокаЗаявки,
	                            |	ЗаявкиПокупателей.ТорговаяТочка,
	                            |	ЗаявкиПокупателей.ДоговорКонтрагента,
	                            |	ВТДанныеПеремещения.Период
	                            |
	                            |ИМЕЮЩИЕ
	                            |	СУММА(ВТДанныеПеремещения.КоличествоВЗаявке - ЕСТЬNULL(ОтказыПоЗаявкамОбороты.КоличествоОборот, 0)) > 0"  );
	
	ЗапросЗаявок.УстановитьПараметр("ДокументСсылка",вхСсылкаНаДокумент);
	ЗапросЗаявок.УстановитьПараметр("Период",Новый Граница(вхСсылкаНаДокумент.МоментВремени(), ВидГраницы.Исключая));
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ЗапросЗаявок.Выполнить().Выгрузить(), ТаблицаДвижений);
	
	Возврат ТаблицаДвижений;
	
	
	
	
КонецФункции

Функция РегистрыНакопления_ТоварыНаСкладах(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_РегистрыНакопления_ТоварыНаСкладах";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ТоварыНаСкладах", ТаблицаДвижений);
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "Дата,СтатусДокумента,ВидОперации");
	
	Если Реквизиты.Дата < глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;

	Если Реквизиты.Дата < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	ПеремещенияВыгружаютсяИз77 = глЗначениеПеременной("ПеремещенияВыгружаютсяИз77");	
	
	Если Не ПеремещенияВыгружаютсяИз77 Тогда  
		Если Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровНовый Или (Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог И Не Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил) Тогда
			Возврат ТаблицаДвижений;
		КонецЕсли;
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	ПеремещениеТоваровТовары.Ссылка КАК Регистратор,
		               |	ПеремещениеТоваровТовары.Ссылка.Дата КАК Период,
		               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Качество,
		               |	ПеремещениеТоваровТовары.КоличествоПлан КАК Количество
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		               |	И (ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ОтгрузкаТопЛог)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику))
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		               |	ПеремещениеТоваровТовары.Ссылка,
		               |	ПеремещениеТоваровТовары.Ссылка.Дата,
		               |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Качество,
		               |	ПеремещениеТоваровТовары.Количество
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		               |	И (ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику))
		               |	И ПеремещениеТоваровТовары.Количество > 0
		               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		               |	ПеремещениеТоваровТовары.Ссылка,
		               |	ПеремещениеТоваровТовары.Ссылка.Дата,
		               |	ВЫБОР
		               |		КОГДА ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ОтгрузкаТопЛог)
		               |			ТОГДА ПеремещениеТоваровТовары.Ссылка.СкладОтправитель
		               |		ИНАЧЕ ПеремещениеТоваровТовары.Ссылка.СкладПолучатель
		               |	КОНЕЦ,
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	&КачествоНедостача,
		               |	ПеремещениеТоваровТовары.КоличествоПлан - ПеремещениеТоваровТовары.Количество
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
		               |	И ПеремещениеТоваровТовары.КоличествоПлан - ПеремещениеТоваровТовары.Количество > 0";
					   
		Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
		Запрос.УстановитьПараметр("КачествоНедостача", Справочники.Качество.Недостача);

		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	ПеремещениеТоваровТовары.Ссылка КАК Регистратор,
		               |	ПеремещениеТоваровТовары.Ссылка.Дата КАК Период,
		               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Качество,
		               |	ПеремещениеТоваровТовары.Количество КАК Количество
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		               |	И (ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику))
		               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
		               |	И ПеремещениеТоваровТовары.Количество > 0
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		               |	ПеремещениеТоваровТовары.Ссылка,
		               |	ПеремещениеТоваровТовары.Ссылка.Дата,
		               |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Качество,
		               |	ПеремещениеТоваровТовары.Количество
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		               |	И (ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику))
		               |	И ПеремещениеТоваровТовары.Количество > 0
		               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
		               |	И ПеремещениеТоваровТовары.Количество > 0";
			Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
			ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);
	КонецЕсли;
	
	Возврат ТаблицаДвижений;

КонецФункции

Функция РегистрыНакопления_РезервыТоваров(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_РегистрыНакопления_РезервыТоваров";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ТаблицаДвижений = Новый ТаблицаЗначений;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("РезервыТоваров", ТаблицаДвижений);
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "Дата,СтатусДокумента,ВидОперации,АктРассмотренияВозврата");
		
	Если Реквизиты.Дата < глЗначениеПеременной("ДатаЗапускаПроведенияПоПартиямРезервам") Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;

	Если Реквизиты.Дата < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	//ХудинВВ 28032019 XX-2167
	Если ЗначениеЗаполнено(Реквизиты.АктРассмотренияВозврата) Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	ПеремещенияВыгружаютсяИз77 = глЗначениеПеременной("ПеремещенияВыгружаютсяИз77");	
	
	Если Не ПеремещенияВыгружаютсяИз77 Тогда 
		Если Не (Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил 
			И (Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог
				ИЛИ  Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение 
				ИЛИ  Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу
				ИЛИ  Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)) Тогда
			Возврат ТаблицаДвижений;
		КонецЕсли;
	Иначе
		Если Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровНовый Тогда 
			Возврат ТаблицаДвижений;
		КонецЕсли;
	КонецЕсли;
	
	//Списание резерва
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
	               |	ПеремещениеТоваровТовары.Номенклатура,
	               |	ПеремещениеТоваровТовары.Качество,
	               |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	               |	ПеремещениеТоваровТовары.СтрокаПрихода,
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваровТовары.КоличествоПлан >= ПеремещениеТоваровТовары.Количество
	               |			ТОГДА ПеремещениеТоваровТовары.КоличествоПлан
	               |		ИНАЧЕ ПеремещениеТоваровТовары.Количество
	               |	КОНЕЦ КАК Количество
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Поступление = &ПустоеПоступление
	               |	И ПеремещениеТоваровТовары.СтрокаЗаявки <> &ПустаяСтрокаЗаявки
	               |	И ПеремещениеТоваровТовары.Ссылка = &Ссылка
	               |	И НЕ ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная";
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("ПустоеПоступление", Документы.ПоступлениеТоваровУслуг.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяСтрокаЗаявки", Справочники.ИдентификаторыСтрокЗаявок.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		втТовары = РезультатЗапроса.Выгрузить();
		Запрос = Новый Запрос;
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	втТовары.Склад,
	                   |	втТовары.Номенклатура,
	                   |	втТовары.Качество,
	                   |	втТовары.СтрокаЗаявки
	                   |ПОМЕСТИТЬ втТовары
	                   |ИЗ
	                   |	&втТовары КАК втТовары
	                   |;
	                   |
	                   |////////////////////////////////////////////////////////////////////////////////
	                   |ВЫБРАТЬ
	                   |	РезервыТоваровОстатки.Склад,
	                   |	РезервыТоваровОстатки.Номенклатура,
	                   |	РезервыТоваровОстатки.Качество,
	                   |	РезервыТоваровОстатки.СтрокаЗаявки,
	                   |	РезервыТоваровОстатки.СтрокаПрихода,
	                   |	РезервыТоваровОстатки.КоличествоОстаток КАК Количество
	                   |ИЗ
	                   |	РегистрНакопления.РезервыТоваров.Остатки(
	                   |			&КонПериода,
	                   |			(Склад, Номенклатура, Качество, СтрокаЗаявки) В
	                   |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                   |					втТовары.Склад,
	                   |					втТовары.Номенклатура,
	                   |					втТовары.Качество,
	                   |					втТовары.СтрокаЗаявки
	                   |				ИЗ
	                   |					втТовары)) КАК РезервыТоваровОстатки
	                   |
	                   |ДЛЯ ИЗМЕНЕНИЯ
	                   |	РегистрНакопления.РезервыТоваров.Остатки";
		Запрос.УстановитьПараметр("втТовары", втТовары);		   
		Запрос.УстановитьПараметр("КонПериода", вхСсылкаНаДокумент.МоментВремени());
		Товары = РезультатЗапроса.Выбрать();
		Остатки = Запрос.Выполнить().Выгрузить();
		ПроведениеДокументовКлиентСервер.СписатьРезервы(Товары, Остатки, ТаблицаДвижений, вхСсылкаНаДокумент);
	КонецЕсли;
	
	//Оприходование резерва
	Запрос = Новый Запрос;
	НоваяСхемаЗакрытияЗаявок = РаботаСоСтатусамиДокументовСервер.НоваяСхемаЗакрытияЗаявок(Реквизиты.Дата);
	Если НоваяСхемаЗакрытияЗаявок тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		               |	ПеремещениеТоваровТовары.Ссылка.Ссылка КАК Регистратор,
		               |	ПеремещениеТоваровТовары.Ссылка.Дата КАК Период,
		               |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель КАК Склад,
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Качество,
		               |	ПеремещениеТоваровТовары.СтрокаЗаявки,
		               |	ПеремещениеТоваровТовары.СтрокаПрихода,
		               |	ПеремещениеТоваровТовары.Количество
		               |ПОМЕСТИТЬ ВтДанныеДокумента
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		               |	И ПеремещениеТоваровТовары.СтрокаЗаявки <> &ПустаяСтрокаЗаявки
		               |	И ПеремещениеТоваровТовары.Количество > 0
		               |	И НЕ ПеремещениеТоваровТовары.СтрокаЗаявки.ТипПоставки = ЗНАЧЕНИЕ(Перечисление.ТипПоставки.ПополнениеСклада)
		               |	И НЕ ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗаявкиПокупателей.СтрокаЗаявки,
		               |	ЗаявкиПокупателей.КоличествоОстаток КАК Количество
		               |ПОМЕСТИТЬ ВтЗаказано
		               |ИЗ
		               |	РегистрНакопления.ЗаявкиПокупателей.Остатки(
		               |			&ГраницаОстатков,
		               |			СтрокаЗаявки В
		               |				(ВЫБРАТЬ
		               |					ВтДанныеДокумента.СтрокаЗаявки
		               |				ИЗ
		               |					ВтДанныеДокумента)) КАК ЗаявкиПокупателей
		               |ГДЕ
		               |	ЗаявкиПокупателей.КоличествоОстаток > 0
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗаявкиПокупателей.СтрокаЗаявки,
		               |	СУММА(ЗаявкиПокупателей.Количество) КАК Количество
		               |ПОМЕСТИТЬ ВтЗаказано_Старое
		               |ИЗ
		               |	ВтДанныеДокумента КАК ВтДанныеДокумента
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаявкиПокупателей КАК ЗаявкиПокупателей
		               |		ПО ВтДанныеДокумента.СтрокаЗаявки = ЗаявкиПокупателей.СтрокаЗаявки
		               |			И (ЗаявкиПокупателей.Регистратор ССЫЛКА Документ.ЗаявкаПокупателя
		               |				ИЛИ ЗаявкиПокупателей.Регистратор ССЫЛКА Документ.КорректировкаЗаявкиПокупателя)
		               |			И (ЗаявкиПокупателей.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход))
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЗаявкиПокупателей.СтрокаЗаявки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВтДанныеДокумента.ВидДвижения,
		               |	ВтДанныеДокумента.Регистратор,
		               |	ВтДанныеДокумента.Период,
		               |	ВтДанныеДокумента.Склад,
		               |	ВтДанныеДокумента.Номенклатура,
		               |	ВтДанныеДокумента.Качество,
		               |	ВтДанныеДокумента.СтрокаЗаявки,
		               |	ВтДанныеДокумента.СтрокаПрихода,
		               |	ВЫБОР
		               |		КОГДА ВтЗаказано.Количество < ВтДанныеДокумента.Количество
		               |			ТОГДА ВтЗаказано.Количество
		               |		ИНАЧЕ ВтДанныеДокумента.Количество
		               |	КОНЕЦ КАК Количество
		               |ИЗ
		               |	ВтДанныеДокумента КАК ВтДанныеДокумента
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтЗаказано КАК ВтЗаказано
		               |		ПО ВтДанныеДокумента.СтрокаЗаявки = ВтЗаказано.СтрокаЗаявки";	
	Иначе  	
		Запрос.Текст = "ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	ПеремещениеТоваровТовары.Ссылка.Ссылка КАК Регистратор,
		|	ПеремещениеТоваровТовары.Ссылка.Дата КАК Период,
		|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель КАК Склад,
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.Качество,
		|	ПеремещениеТоваровТовары.СтрокаЗаявки,
		|	ПеремещениеТоваровТовары.СтрокаПрихода,
		|	ПеремещениеТоваровТовары.Количество
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|ГДЕ
		|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		|	И ПеремещениеТоваровТовары.СтрокаЗаявки <> &ПустаяСтрокаЗаявки
		//|	И ПеремещениеТоваровТовары.СтрокаЗаявки.ПрайсПоставщика.Склад = &ПустойСклад
		|	И ПеремещениеТоваровТовары.Количество > 0
		|	И ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкаПокупателя.ЗаявкаПокупателя)
		|	И НЕ ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная";
	КонецЕсли; 			   
	                      
	Запрос.УстановитьПараметр("ГраницаОстатков", Новый Граница(вхСсылкаНаДокумент.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДатаДокумента",Реквизиты.дата);
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("ПустаяСтрокаЗаявки", Справочники.ИдентификаторыСтрокЗаявок.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойСклад", Справочники.Склады.ПустаяСсылка());
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);
	
	Возврат ТаблицаДвижений;
	
КонецФункции

Функция РегистрыНакопления_ТоварыКРазмещениюНаСкладах(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено) Экспорт
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_РегистрыНакопления_ТоварыКРазмещениюНаСкладах";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ТоварыКРазмещениюНаСкладах", ТаблицаДвижений);
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "Дата,СтатусДокумента,ВидОперации,СкладОтправитель");
	
	Если Реквизиты.Дата < глЗначениеПеременной("ДатаЗапускаПервогоЭтапа")
		или Реквизиты.Дата < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	Если Не (Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил И РаботаСоСтатусамиДокументовСервер.ЭтоСкладПриемки(Реквизиты.СкладОтправитель)) Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	ЗапросТоваровКРазмещению = новый	 Запрос; 	
	ЗапросТоваровКРазмещению.Текст = "ВЫБРАТЬ
	                                 |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	                                 |	&СкладОтправитель КАК Склад,
	                                 |	ПеремещениеТоваровТовары.Номенклатура,
	                                 |	ПеремещениеТоваровТовары.СтрокаПрихода,
	                                 |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество,
	                                 |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	                                 |	&Период
	                                 |ИЗ
	                                 |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                                 |ГДЕ
	                                 |	ПеремещениеТоваровТовары.Ссылка = &ДокументСсылка
	                                 |	И ПеремещениеТоваровТовары.СтрокаЗаявки <> ЗНАЧЕНИЕ(Справочник.ИдентификаторыСтрокЗаявок.Пустаяссылка)
	                                 |	И ПеремещениеТоваровТовары.Количество > 0
	                                 |
	                                 |СГРУППИРОВАТЬ ПО
	                                 |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	                                 |	ПеремещениеТоваровТовары.СтрокаПрихода,
	                                 |	ПеремещениеТоваровТовары.Номенклатура";
	
	ЗапросТоваровКРазмещению.УстановитьПараметр("ДокументСсылка",вхСсылкаНаДокумент);
	ЗапросТоваровКРазмещению.УстановитьПараметр("СкладОтправитель",Реквизиты.СкладОтправитель);
	ЗапросТоваровКРазмещению.УстановитьПараметр("Период",Реквизиты.Дата);
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ЗапросТоваровКРазмещению.Выполнить().Выгрузить(), ТаблицаДвижений);
	
	Возврат ТаблицаДвижений;
	


КонецФункции

//Функция ЗапросОприходывания(вхСсылкаНаДокумент)

Функция РегистрыНакопления_ПартииТоваров(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено, вхФильтр = Неопределено)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_РегистрыНакопления_ПартииТоваров";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	

	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ПартииТоваров", ТаблицаДвижений);
	
	ТаблицаДвиженийVMI = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ПартииТоваровVMI", ТаблицаДвиженийVMI);
	
	ТаблицаДвиженийТвП = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ПартииТоваровВПути", ТаблицаДвиженийТвП);
	
	СтруктураТаблиц = Новый Структура;
	
	СтруктураТаблиц.Вставить("ПартииТоваров",     ТаблицаДвижений);
	СтруктураТаблиц.Вставить("ПартииТоваровVMI",  ТаблицаДвиженийVMI);
	СтруктураТаблиц.Вставить("ПартииТоваровВПути",ТаблицаДвиженийТвП);
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "Дата,СтатусДокумента,ВидОперации,СкладОтправитель,СкладПолучатель,Организация");
		
	Если Реквизиты.Дата < глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда
		Возврат СтруктураТаблиц;
	КонецЕсли;

	Если Реквизиты.Дата < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		Возврат СтруктураТаблиц;
	КонецЕсли;
	
	Если Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровНовый Или (Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог И Не Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил) Тогда
		Возврат СтруктураТаблиц;
	КонецЕсли;
	
	//Если ПроведениеДокументовКлиентСервер.ЧастичноеСписаниеРазмещений(вхСсылкаНаДокумент) Тогда 
	//	СтруктураТаблиц = ПроведениеДокументовКлиентСервер.НовоеСписаниеПоПартиямИТоварамДляРазмещений(вхСсылкаНаДокумент);
	//	ОбщегоНазначения.ЗаписатьДвиженияДокумента(вхСсылкаНаДокумент, "ТоварыНаСкладах", СтруктураТаблиц.ТоварыНаСкладах);
	//	Возврат СтруктураТаблиц;
	//КонецЕсли;
	
	ПеремещенияВыгружаютсяИз77 = глЗначениеПеременной("ПеремещенияВыгружаютсяИз77");	
	Если Не ПеремещенияВыгружаютсяИз77 Тогда 
		Если Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ОтгрузкаТопЛог 
			ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение
			ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу 
			ИЛИ  Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику Тогда 
			
			ВозврСтруктураТаблиц = ПроведениеДокументовКлиентСервер.ПогашениеПартийТоваровНовое(вхСсылкаНаДокумент, вхОтказ,, вхФильтр);
			ТаблицаДвижений = ВозврСтруктураТаблиц.ПартииТоваров;
			ТаблицаДвиженийVMI = ВозврСтруктураТаблиц.ПартииТоваровVMI;
			
			СтруктураТаблиц.ПартииТоваров 	 = ТаблицаДвижений;
			СтруктураТаблиц.ПартииТоваровVMI = ТаблицаДвиженийVMI;
					
			Если Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ОтгрузкаТопЛог Тогда 
				Строки = ТаблицаДвижений.НайтиСтроки(Новый Структура("ВидСписания", "Списание"));
				
				КопияТаблицаДвижений = ТаблицаДвижений.Скопировать(Строки,"Регистратор,Период,Номенклатура,Качество,СтатусПартии,СтрокаПрихода,Организация,Количество,СуммаРубли,СуммаДоллары,СуммаЕвро");
				
				ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(КопияТаблицаДвижений, ТаблицаДвиженийТвП);
				
				ТаблицаДвиженийТвП.ЗаполнитьЗначения(Реквизиты.СкладОтправитель, "СкладОтправитель");
				ТаблицаДвиженийТвП.ЗаполнитьЗначения(Реквизиты.СкладПолучатель, "СкладПолучатель");
				ТаблицаДвиженийТвП.ЗаполнитьЗначения(ВидДвиженияНакопления.Приход, "ВидДвижения");
				ТаблицаДвиженийТвП.ЗаполнитьЗначения(вхСсылкаНаДокумент, "ДокументОснование");
			КонецЕсли;
			
			СтруктураТаблиц.ПартииТоваровВПути = ТаблицаДвиженийТвП;
			
		ИначеЕсли Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог Тогда 	
			
			Запрос = Новый Запрос;
			Запрос.Текст =  "ВЫБРАТЬ
			                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
			                |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
			                |	ПеремещениеТоваровТовары.Номенклатура,
			                |	ПеремещениеТоваровТовары.Качество,
			                |	ПеремещениеТоваровТовары.СтрокаПрихода,
							// 28.01.19 Строганов Роман > XX-1835
							|	ВЫБОР КОГДА &СобственнаяПартия ТОГДА
							|		ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
							|	ИНАЧЕ
							// 28.01.19 Строганов Роман < XX-1835
							|	ВЫБОР
							|		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.СкладVMI
							|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
							|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
							|	КОНЕЦ КОНЕЦ  КАК СтатусПартии,
			                |	ПеремещениеТоваровТовары.Ссылка.ДокументОснование,
			                |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество,
			                |	""Нормальное"" КАК РаспределениеПартий
			                |ПОМЕСТИТЬ втТовары
			                |ИЗ
			                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
			                |ГДЕ
			                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
			                |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
			                |	И ПеремещениеТоваровТовары.СтрокаПрихода <> &ПустаяСтрокаПрихода
							|	И ПеремещениеТоваровТовары.Количество > 0 %УсловиеПоНоменклатуре%
			                |
			                |СГРУППИРОВАТЬ ПО
			                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
			                |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
			                |	ПеремещениеТоваровТовары.Номенклатура,
			                |	ПеремещениеТоваровТовары.Качество,
			                |	ПеремещениеТоваровТовары.СтрокаПрихода,
							|	ПеремещениеТоваровТовары.Ссылка.ДокументОснование,
							// 28.01.19 Строганов Роман > XX-1835
							|	ВЫБОР КОГДА &СобственнаяПартия ТОГДА
							|		ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
							|	ИНАЧЕ
							// 28.01.19 Строганов Роман < XX-1835
							|	ВЫБОР
							|		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.СкладVMI
							|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
			                |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
			                |	КОНЕЦ КОНЕЦ
			                |
			                |ОБЪЕДИНИТЬ ВСЕ
			                |
			                |ВЫБРАТЬ
			                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
							|	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
							|	ПеремещениеТоваровТовары.Номенклатура,
							|	ПеремещениеТоваровТовары.Качество,
							|	ПеремещениеТоваровТовары.СтрокаПрихода,
							// 28.01.19 Строганов Роман > XX-1835
							|	ВЫБОР КОГДА &СобственнаяПартия ТОГДА
							|		ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
							|	ИНАЧЕ
							// 28.01.19 Строганов Роман < XX-1835
							|	ВЫБОР
							|		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.СкладVMI
							|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
							|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
							|	КОНЕЦ КОНЕЦ,
							|	ПеремещениеТоваровТовары.Ссылка.ДокументОснование,
							|	СУММА(ПеремещениеТоваровТовары.КоличествоПлан - ПеремещениеТоваровТовары.Количество),
							|	""Недостача""
			                |ИЗ
			                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
			                |ГДЕ
			                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
			                |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
			                |	И ПеремещениеТоваровТовары.СтрокаПрихода <> &ПустаяСтрокаПрихода
							|	И ПеремещениеТоваровТовары.КоличествоПлан - ПеремещениеТоваровТовары.Количество > 0  %УсловиеПоНоменклатуре%
			                |
			                |СГРУППИРОВАТЬ ПО
			                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
			                |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
			                |	ПеремещениеТоваровТовары.Номенклатура,
			                |	ПеремещениеТоваровТовары.Качество,
							|	ПеремещениеТоваровТовары.СтрокаПрихода,
							|	ПеремещениеТоваровТовары.Ссылка.ДокументОснование,
							// 28.01.19 Строганов Роман > XX-1835
							|	ВЫБОР КОГДА &СобственнаяПартия ТОГДА
							|		ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
							|	ИНАЧЕ
							// 28.01.19 Строганов Роман < XX-1835
							|	ВЫБОР
							|		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.СкладVMI
							|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
			                |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
			                |	КОНЕЦ КОНЕЦ
			                |;
			                |
			                |////////////////////////////////////////////////////////////////////////////////
			                |ВЫБРАТЬ
			                |	ПартииТоваровВПутиОстатки.СкладОтправитель,
			                |	ПартииТоваровВПутиОстатки.СкладПолучатель,
			                |	ПартииТоваровВПутиОстатки.Номенклатура,
			                |	ПартииТоваровВПутиОстатки.Качество,
			                |	ПартииТоваровВПутиОстатки.СтрокаПрихода,
			                |	ПартииТоваровВПутиОстатки.СтатусПартии,
			                |	ПартииТоваровВПутиОстатки.Организация,
			                |	ПартииТоваровВПутиОстатки.ДокументОснование,
			                |	ПартииТоваровВПутиОстатки.КоличествоОстаток КАК Количество,
			                |	ПартииТоваровВПутиОстатки.СуммаРублиОстаток КАК СуммаРубли,
			                |	ПартииТоваровВПутиОстатки.СуммаДолларыОстаток КАК СуммаДоллары,
			                |	ПартииТоваровВПутиОстатки.СуммаЕвроОстаток КАК СуммаЕвро,
			                |	ПартииТоваровВПутиОстатки.Организация = &Организация КАК ЭтаОрганизация
			                |ИЗ
			                |	РегистрНакопления.ПартииТоваровВПути.Остатки(
			                |			&КонПериода,
			                |			(СкладОтправитель, СкладПолучатель, Номенклатура, Качество, СтрокаПрихода, СтатусПартии, ДокументОснование) В
			                |				(ВЫБРАТЬ
			                |					втТовары.СкладОтправитель,
			                |					втТовары.СкладПолучатель,
			                |					втТовары.Номенклатура,
			                |					втТовары.Качество,
			                |					втТовары.СтрокаПрихода,
			                |					втТовары.СтатусПартии,
			                |					втТовары.ДокументОснование
			                |				ИЗ
			                |					втТовары КАК втТовары)) КАК ПартииТоваровВПутиОстатки
			                |
			                |ДЛЯ ИЗМЕНЕНИЯ
			                |	РегистрНакопления.ПартииТоваровВПути.Остатки
			                |
			                |УПОРЯДОЧИТЬ ПО
			                |	ЭтаОрганизация УБЫВ
			                |;
			                |
			                |////////////////////////////////////////////////////////////////////////////////
			                |ВЫБРАТЬ
			                |	втТовары.СкладОтправитель,
			                |	втТовары.СкладПолучатель,
			                |	втТовары.Номенклатура,
			                |	втТовары.Качество,
			                |	втТовары.СтрокаПрихода,
			                |	втТовары.СтатусПартии,
			                |	втТовары.ДокументОснование,
			                |	втТовары.Количество,
			                |	втТовары.РаспределениеПартий
			                |ИЗ
			                |	втТовары КАК втТовары";
			Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
			Запрос.УстановитьПараметр("КонПериода", вхСсылкаНаДокумент.МоментВремени());
			Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
			Запрос.УстановитьПараметр("ПустаяСтрокаПрихода", Справочники.ИдентификаторыСтрокПриходов.ПустаяСсылка());
			// 28.01.19 Строганов Роман > XX-1835
			Запрос.УстановитьПараметр("СобственнаяПартия", вхПараметры.СобственнаяПартия);
			// 28.01.19 Строганов Роман < XX-1835

			Если ТипЗнч(вхФильтр) = Тип("Структура") и вхФильтр.Свойство("Номенклатура") Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, " %УсловиеПоНоменклатуре%", " И ПеремещениеТоваровТовары.Номенклатура = &Номенклатура");
				Запрос.УстановитьПараметр("Номенклатура", вхФильтр.Номенклатура);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, " %УсловиеПоНоменклатуре%", "");
			КонецЕсли;
			Результаты = Запрос.ВыполнитьПакет();
			ОстаткиПоСтрокамПрихода = Результаты[1].Выгрузить();
			
			ТаблицаПоFIFO = ОстаткиПоСтрокамПрихода.СкопироватьКолонки("СкладОтправитель,СкладПолучатель,Номенклатура,Качество,СтатусПартии,ДокументОснование,Количество");
			ТаблицаПоFIFO.Колонки.Добавить("РаспределениеПартий", Новый ОписаниеТипов("Строка"));
			
			Если ОстаткиПоСтрокамПрихода.Количество() > 0 Тогда  
				Товары = Результаты[2].Выбрать();
				Пока Товары.Следующий() Цикл 
					Отбор = Новый Структура("СкладОтправитель,СкладПолучатель,Номенклатура,Качество,СтрокаПрихода,СтатусПартии,ДокументОснование");
					ЗаполнитьЗначенияСвойств(Отбор, Товары);
					СтрокиОстатков = ОстаткиПоСтрокамПрихода.НайтиСтроки(Отбор);
					
					КоличествоРаспределить = Товары.Количество;
					ИндексСтроки = 0;
					Пока КоличествоРаспределить > 0 И ИндексСтроки < СтрокиОстатков.Количество() Цикл 
						СтрокаОст = СтрокиОстатков.Получить(ИндексСтроки);
						Если СтрокаОст.Количество > 0 Тогда 
							
							СписываемоеКоличество = Мин(КоличествоРаспределить, СтрокаОст.Количество);
			                СтрокаДвижений = ТаблицаДвиженийТвП.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаОст);
							
							СтрокаДвижений.ВидДвижения = ВидДвиженияНакопления.Расход;
							СтрокаДвижений.Количество = СписываемоеКоличество;
							СтрокаДвижений.Регистратор = вхСсылкаНаДокумент;
							СтрокаДвижений.Период = Реквизиты.Дата;
							
							Если СтрокаДвижений.Количество <> СтрокаОст.Количество Тогда 
								СтрокаДвижений.СуммаРубли   = СтрокаДвижений.Количество * СтрокаДвижений.СуммаРубли/СтрокаОст.Количество;
								СтрокаДвижений.СуммаДоллары = СтрокаДвижений.Количество * СтрокаДвижений.СуммаДоллары/СтрокаОст.Количество;
								СтрокаДвижений.СуммаЕвро 	= СтрокаДвижений.Количество * СтрокаДвижений.СуммаЕвро/СтрокаОст.Количество;
							КонецЕсли;
							
							СтрокаДвиженийПТ = ТаблицаДвижений.Добавить();
							ЗаполнитьЗначенияСвойств(СтрокаДвиженийПТ, СтрокаДвижений);
							СтрокаДвиженийПТ.Склад = СтрокаДвижений.СкладПолучатель;
							СтрокаДвиженийПТ.ВидДвижения = ВидДвиженияНакопления.Приход;

							Если Товары.РаспределениеПартий = "Недостача" Тогда 
								СтрокаДвиженийПТ.Качество = Справочники.Качество.Недостача;
							КонецЕсли;
							
							
							СтрокаОст.Количество   = СтрокаОст.Количество - СписываемоеКоличество;	
							СтрокаОст.СуммаРубли   = СтрокаОст.СуммаРубли - СтрокаДвижений.СуммаРубли;	
							СтрокаОст.СуммаДоллары = СтрокаОст.СуммаДоллары - СтрокаДвижений.СуммаДоллары;
							СтрокаОст.СуммаЕвро    = СтрокаОст.СуммаЕвро - СтрокаДвижений.СуммаЕвро;
							
							КоличествоРаспределить = КоличествоРаспределить - СписываемоеКоличество;
						КонецЕсли;	
						ИндексСтроки = ИндексСтроки + 1;
					КонецЦикла;
					Если КоличествоРаспределить > 0 Тогда
						
						//Нет партий по данной строке прихода, пытаемся списать по FIFO 
						НоваяСтрока = ТаблицаПоFIFO.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Товары);
						НоваяСтрока.Количество = КоличествоРаспределить;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
			               |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
			               |	ПеремещениеТоваровТовары.Номенклатура,
			               |	ПеремещениеТоваровТовары.Качество,
			               |	ВЫБОР
			               |		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.СкладVMI
			               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
			               |	КОНЕЦ КАК СтатусПартии,
			               |	ПеремещениеТоваровТовары.Ссылка.ДокументОснование,
			               |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество,
			               |	""Нормальное"" КАК РаспределениеПартий
			               |ПОМЕСТИТЬ втТовары
			               |ИЗ
			               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
			               |ГДЕ
			               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
			               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
			               |	И ПеремещениеТоваровТовары.СтрокаПрихода = &ПустаяСтрокаПрихода
			               |	И ПеремещениеТоваровТовары.Количество > 0   %УсловиеПоНоменклатуре%
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
			               |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
			               |	ПеремещениеТоваровТовары.Номенклатура,
			               |	ПеремещениеТоваровТовары.Качество,
			               |	ПеремещениеТоваровТовары.Ссылка.ДокументОснование,
			               |	ВЫБОР
			               |		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.СкладVMI
			               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
			               |	КОНЕЦ
			               |
			               |ОБЪЕДИНИТЬ ВСЕ
			               |
			               |ВЫБРАТЬ
			               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
			               |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
			               |	ПеремещениеТоваровТовары.Номенклатура,
			               |	ПеремещениеТоваровТовары.Качество,
			               |	ВЫБОР
			               |		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.СкладVMI
			               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
			               |	КОНЕЦ,
			               |	ПеремещениеТоваровТовары.Ссылка.ДокументОснование,
			               |	СУММА(ПеремещениеТоваровТовары.КоличествоПлан - ПеремещениеТоваровТовары.Количество),
			               |	""Недостача""
			               |ИЗ
			               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
			               |ГДЕ
			               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
			               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
			               |	И ПеремещениеТоваровТовары.СтрокаПрихода = &ПустаяСтрокаПрихода
			               |	И ПеремещениеТоваровТовары.КоличествоПлан - ПеремещениеТоваровТовары.Количество > 0   %УсловиеПоНоменклатуре%
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
			               |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
			               |	ПеремещениеТоваровТовары.Номенклатура,
			               |	ПеремещениеТоваровТовары.Качество,
			               |	ПеремещениеТоваровТовары.Ссылка.ДокументОснование,
			               |	ВЫБОР
			               |		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.СкладVMI
			               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
			               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
			               |	КОНЕЦ
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ТаблицаДвижений.СкладОтправитель КАК СкладОтправитель,
			               |	ТаблицаДвижений.СкладПолучатель КАК СкладПолучатель,
			               |	ТаблицаДвижений.Номенклатура КАК Номенклатура,
			               |	ТаблицаДвижений.Качество КАК Качество,
			               |	ТаблицаДвижений.ДокументОснование КАК ДокументОснование,
			               |	ТаблицаДвижений.СтатусПартии КАК СтатусПартии,
			               |	ТаблицаДвижений.СтрокаПрихода КАК СтрокаПрихода,
			               |	ТаблицаДвижений.Организация КАК Организация,
			               |	ТаблицаДвижений.Количество КАК Количество,
			               |	ТаблицаДвижений.СуммаРубли КАК СуммаРубли,
			               |	ТаблицаДвижений.СуммаДоллары КАК СуммаДоллары,
			               |	ТаблицаДвижений.СуммаЕвро КАК СуммаЕвро
			               |ПОМЕСТИТЬ ТаблицаДвижений
			               |ИЗ
			               |	&ТаблицаДвижений КАК ТаблицаДвижений
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ТаблицаДвижений.СкладОтправитель КАК СкладОтправитель,
			               |	ТаблицаДвижений.СкладПолучатель КАК СкладПолучатель,
			               |	ТаблицаДвижений.Номенклатура КАК Номенклатура,
			               |	ТаблицаДвижений.Качество КАК Качество,
			               |	ТаблицаДвижений.ДокументОснование КАК ДокументОснование,
			               |	ТаблицаДвижений.СтатусПартии КАК СтатусПартии,
			               |	ТаблицаДвижений.СтрокаПрихода КАК СтрокаПрихода,
			               |	ТаблицаДвижений.Организация КАК Организация,
			               |	СУММА(ТаблицаДвижений.Количество) КАК Количество,
			               |	СУММА(ТаблицаДвижений.СуммаРубли) КАК СуммаРубли,
			               |	СУММА(ТаблицаДвижений.СуммаДоллары) КАК СуммаДоллары,
			               |	СУММА(ТаблицаДвижений.СуммаЕвро) КАК СуммаЕвро
			               |ПОМЕСТИТЬ ТаблицаДвиженийСвернутая
			               |ИЗ
			               |	ТаблицаДвижений КАК ТаблицаДвижений
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	ТаблицаДвижений.СкладОтправитель,
			               |	ТаблицаДвижений.СкладПолучатель,
			               |	ТаблицаДвижений.Номенклатура,
			               |	ТаблицаДвижений.Качество,
			               |	ТаблицаДвижений.Организация,
			               |	ТаблицаДвижений.СтрокаПрихода,
			               |	ТаблицаДвижений.СтатусПартии,
			               |	ТаблицаДвижений.ДокументОснование
			               |
			               |ИНДЕКСИРОВАТЬ ПО
			               |	СкладОтправитель,
			               |	СкладПолучатель,
			               |	Номенклатура,
			               |	Качество,
			               |	ДокументОснование,
			               |	СтатусПартии,
			               |	СтрокаПрихода,
			               |	Организация
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	ПартииТоваровВПутиОстатки.СкладОтправитель,
			               |	ПартииТоваровВПутиОстатки.СкладПолучатель,
			               |	ПартииТоваровВПутиОстатки.Номенклатура,
			               |	ПартииТоваровВПутиОстатки.Качество,
			               |	ПартииТоваровВПутиОстатки.СтрокаПрихода,
			               |	ПартииТоваровВПутиОстатки.СтатусПартии,
			               |	ПартииТоваровВПутиОстатки.Организация,
			               |	ПартииТоваровВПутиОстатки.ДокументОснование,
			               |	ПартииТоваровВПутиОстатки.КоличествоОстаток - ЕСТЬNULL(ТаблицаДвиженийСвернутая.Количество, 0) КАК Количество,
			               |	ПартииТоваровВПутиОстатки.СуммаРублиОстаток - ЕСТЬNULL(ТаблицаДвиженийСвернутая.СуммаРубли, 0) КАК СуммаРубли,
			               |	ПартииТоваровВПутиОстатки.СуммаДолларыОстаток - ЕСТЬNULL(ТаблицаДвиженийСвернутая.СуммаДоллары, 0) КАК СуммаДоллары,
			               |	ПартииТоваровВПутиОстатки.СуммаЕвроОстаток - ЕСТЬNULL(ТаблицаДвиженийСвернутая.СуммаЕвро, 0) КАК СуммаЕвро,
			               |	ПартииТоваровВПутиОстатки.Организация = &Организация КАК ЭтаОрганизация,
			               |	ПартииТоваровВПутиОстатки.СтрокаПрихода.Дата КАК СтрокаПриходаДата
			               |ИЗ
			               |	РегистрНакопления.ПартииТоваровВПути.Остатки(
			               |			&КонПериода,
			               |			(СкладОтправитель, СкладПолучатель, Номенклатура, Качество, СтатусПартии, ДокументОснование) В
			               |				(ВЫБРАТЬ
			               |					втТовары.СкладОтправитель,
			               |					втТовары.СкладПолучатель,
			               |					втТовары.Номенклатура,
			               |					втТовары.Качество,
			               |					втТовары.СтатусПартии,
			               |					втТовары.ДокументОснование
			               |				ИЗ
			               |					втТовары КАК втТовары)) КАК ПартииТоваровВПутиОстатки
			               |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДвиженийСвернутая КАК ТаблицаДвиженийСвернутая
			               |		ПО ПартииТоваровВПутиОстатки.СкладОтправитель = ТаблицаДвиженийСвернутая.СкладОтправитель
			               |			И ПартииТоваровВПутиОстатки.СкладПолучатель = ТаблицаДвиженийСвернутая.СкладПолучатель
			               |			И ПартииТоваровВПутиОстатки.Номенклатура = ТаблицаДвиженийСвернутая.Номенклатура
			               |			И ПартииТоваровВПутиОстатки.Качество = ТаблицаДвиженийСвернутая.Качество
			               |			И ПартииТоваровВПутиОстатки.ДокументОснование = ТаблицаДвиженийСвернутая.ДокументОснование
			               |			И ПартииТоваровВПутиОстатки.СтатусПартии = ТаблицаДвиженийСвернутая.СтатусПартии
			               |			И ПартииТоваровВПутиОстатки.СтрокаПрихода = ТаблицаДвиженийСвернутая.СтрокаПрихода
			               |			И ПартииТоваровВПутиОстатки.Организация = ТаблицаДвиженийСвернутая.Организация
			               |ГДЕ
			               |	ПартииТоваровВПутиОстатки.КоличествоОстаток - ЕСТЬNULL(ТаблицаДвиженийСвернутая.Количество, 0) > 0
			               |
			               |ДЛЯ ИЗМЕНЕНИЯ
			               |	РегистрНакопления.ПартииТоваровВПути.Остатки
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	ЭтаОрганизация УБЫВ,
			               |	СтрокаПриходаДата
			               |;
			               |
			               |////////////////////////////////////////////////////////////////////////////////
			               |ВЫБРАТЬ
			               |	втТовары.СкладОтправитель,
			               |	втТовары.СкладПолучатель,
			               |	втТовары.Номенклатура,
			               |	втТовары.Качество,
			               |	втТовары.СтатусПартии,
			               |	втТовары.ДокументОснование,
			               |	втТовары.Количество,
			               |	втТовары.РаспределениеПартий
			               |ИЗ
			               |	втТовары КАК втТовары";
			Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
			Запрос.УстановитьПараметр("ПустаяСтрокаПрихода", Справочники.ИдентификаторыСтрокПриходов.ПустаяСсылка());
			Запрос.УстановитьПараметр("ТаблицаДвижений", ТаблицаДвиженийТвП);
			Запрос.УстановитьПараметр("КонПериода", вхСсылкаНаДокумент.МоментВремени());
			Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
			
			Если ТипЗнч(вхФильтр) = Тип("Структура") и вхФильтр.Свойство("Номенклатура") Тогда 
				Запрос.Текст = СтрЗаменить(Запрос.Текст, " %УсловиеПоНоменклатуре%", " И ПеремещениеТоваровТовары.Номенклатура = &Номенклатура");
				Запрос.УстановитьПараметр("Номенклатура", вхФильтр.Номенклатура);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, " %УсловиеПоНоменклатуре%", "");
			КонецЕсли;
			
			Результаты = Запрос.ВыполнитьПакет();
			ОстаткиПоFIFO = Результаты[3].Выгрузить();
			Товары = Результаты[4].Выгрузить();
			Для Каждого СтрокаТЧ Из ТаблицаПоFIFO Цикл 
				ЗаполнитьЗначенияСвойств(Товары.Добавить(), СтрокаТЧ);
			КонецЦикла;
			Товары.Свернуть("СкладОтправитель,СкладПолучатель,Номенклатура,Качество,СтатусПартии,ДокументОснование,РаспределениеПартий", "Количество");
			
			Для Каждого СтрокаТовары Из Товары Цикл 
				Отбор = Новый Структура("СкладОтправитель,СкладПолучатель,Номенклатура,Качество,СтатусПартии,ДокументОснование");
				ЗаполнитьЗначенияСвойств(Отбор, СтрокаТовары);
				СтрокиОстатков = ОстаткиПоFIFO.НайтиСтроки(Отбор);
				
				КоличествоРаспределить = СтрокаТовары.Количество;
				ИндексСтроки = 0;
				Пока КоличествоРаспределить > 0 И ИндексСтроки < СтрокиОстатков.Количество() Цикл
					СтрокаОст = СтрокиОстатков.Получить(ИндексСтроки);
					Если СтрокаОст.Количество > 0 Тогда 
						СписываемоеКоличество = Мин(КоличествоРаспределить, СтрокаОст.Количество);
						СтрокаДвижений = ТаблицаДвиженийТвП.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаОст);
						
						СтрокаДвижений.ВидДвижения = ВидДвиженияНакопления.Расход;
						СтрокаДвижений.Количество = СписываемоеКоличество;
						СтрокаДвижений.Регистратор = вхСсылкаНаДокумент;
						СтрокаДвижений.Период = Реквизиты.Дата;
						
						Если СтрокаДвижений.Количество <> СтрокаОст.Количество Тогда 
							СтрокаДвижений.СуммаРубли   = СтрокаДвижений.Количество * СтрокаДвижений.СуммаРубли/СтрокаОст.Количество;
							СтрокаДвижений.СуммаДоллары = СтрокаДвижений.Количество * СтрокаДвижений.СуммаДоллары/СтрокаОст.Количество;
							СтрокаДвижений.СуммаЕвро 	= СтрокаДвижений.Количество * СтрокаДвижений.СуммаЕвро/СтрокаОст.Количество;
						КонецЕсли;
						
						СтрокаДвиженийПТ = ТаблицаДвижений.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаДвиженийПТ, СтрокаДвижений);
						СтрокаДвиженийПТ.Склад = СтрокаДвижений.СкладПолучатель;
						СтрокаДвиженийПТ.ВидДвижения = ВидДвиженияНакопления.Приход;
						
						Если СтрокаТовары.РаспределениеПартий = "Недостача" Тогда 
							СтрокаДвиженийПТ.Качество = Справочники.Качество.Недостача;
						КонецЕсли;

						СтрокаОст.Количество   = СтрокаОст.Количество - СписываемоеКоличество;	
						СтрокаОст.СуммаРубли   = СтрокаОст.СуммаРубли - СтрокаДвижений.СуммаРубли;	
						СтрокаОст.СуммаДоллары = СтрокаОст.СуммаДоллары - СтрокаДвижений.СуммаДоллары;
						СтрокаОст.СуммаЕвро    = СтрокаОст.СуммаЕвро - СтрокаДвижений.СуммаЕвро;
						
						КоличествоРаспределить = КоличествоРаспределить - СписываемоеКоличество;
					КонецЕсли;
					ИндексСтроки = ИндексСтроки + 1;
				КонецЦикла;
				Если КоличествоРаспределить > 0 Тогда
					Сообщить("[ПогашениеПартийТоваровВПути]: не удалось списать по партиям номенклатуру " + СтрокаТовары.Номенклатура + " в количестве " + КоличествоРаспределить + " с качеством " + СтрокаТовары.Качество + " документ основание: " + СтрокаТовары.ДокументОснование);
					вхОтказ = Истина;
				КонецЕсли;
			КонецЦикла;
			
			СтруктураТаблиц.ПартииТоваровВПути = ТаблицаДвиженийТвП;
			СтруктураТаблиц.ПартииТоваров = ТаблицаДвижений;
		КонецЕсли;
	Иначе
		ПараметрыСписания = Новый Структура;
		ПараметрыСписания.Вставить("ОперативноеПроведение", ПроведениеДокументовКлиентСервер.ОперативноеПроведение(вхПараметры));
		// 19.02.19 Строганов Роман > XX-1835
		ПараметрыСписания.Вставить("СобственнаяПартия", вхПараметры.СобственнаяПартия);
		// 19.02.19 Строганов Роман < XX-1835
		Если вхПараметры.Свойство("Перепровести") Тогда 
			ПараметрыСписания.Вставить("Перепровести");
		КонецЕсли;
		
		ВозврСтруктураТаблиц = ПроведениеДокументовКлиентСервер.ПогашениеПартийТоваровНовое(вхСсылкаНаДокумент, вхОтказ, , вхФильтр, ПараметрыСписания);
		ТаблицаДвижений = ВозврСтруктураТаблиц.ПартииТоваров;
		ТаблицаДвиженийVMI = ВозврСтруктураТаблиц.ПартииТоваровVMI;
			
		СтруктураТаблиц.ПартииТоваров 	 = ТаблицаДвижений;
		СтруктураТаблиц.ПартииТоваровVMI = ТаблицаДвиженийVMI;
	КонецЕсли;
	
	Возврат СтруктураТаблиц;
	
КонецФункции

Функция РегистрыНакопления_ТоварыКРезервированию(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_РегистрыНакопления_ТоварыКРезервированию";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ТоварыКРезервированию", ТаблицаДвижений);
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "Дата,СтатусДокумента,ВидОперации,ДокументОснование");
	
	Если Реквизиты.Дата < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	Если Реквизиты.Дата < глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	ПеремещенияВыгружаютсяИз77 = глЗначениеПеременной("ПеремещенияВыгружаютсяИз77");	
	Если Не ПеремещенияВыгружаютсяИз77 Тогда 
		Если Не ((Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ОтгрузкаТопЛог И (Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровВыгруженВТопЛог ИЛИ Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил))
			Или (Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение И Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил)
			Или (Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу И Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил)
			Или (Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику И Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил))
			Тогда
			Возврат ТаблицаДвижений;
		КонецЕсли;
	Иначе
		Если Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровНовый Тогда
			Возврат ТаблицаДвижений;
		КонецЕсли;
	КонецЕсли;
	
	ОперативноеПроведение = ПроведениеДокументовКлиентСервер.ОперативноеПроведение(вхПараметры);
	
	БлокировкаДанных = Новый БлокировкаДанных;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
	               |	ПеремещениеТоваровТовары.Номенклатура,
	               |	ПеремещениеТоваровТовары.СтрокаЗаявки
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	               |	И ПеремещениеТоваровТовары.СтрокаЗаявки <> &ПустаяСтрокаЗаявки";
	
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("ПустаяСтрокаЗаявки", Справочники.ИдентификаторыСтрокЗаявок.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ТоварыКРезервированию");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("СтрокаЗаявки", "СтрокаЗаявки");
	
	БлокировкаДанных.Заблокировать();
	
	//Если Не (ЗначениеЗаполнено(Реквизиты.ДокументОснование) И ТипЗнч(Реквизиты.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")) Тогда 
	//	Возврат ТаблицаДвижений;
	//КонецЕсли;
				
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ПеремещениеТоваровТовары.Ссылка КАК Регистратор,
	//               |	ПеремещениеТоваровТовары.Ссылка.Дата КАК Период,
	//               |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	//               |	ПеремещениеТоваровТовары.СтрокаПрихода,
	//               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
	//               |	ПеремещениеТоваровТовары.Номенклатура,
	//               |	ПеремещениеТоваровТовары.КоличествоПлан КАК Количество,
	//               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	//               |ПОМЕСТИТЬ втТовары
	//               |ИЗ
	//               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	//               |ГДЕ
	//               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	//               |	И ПеремещениеТоваровТовары.Поступление <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	//               |	И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ПриРазмещенииИгнорироватьСтатусПартии
	//               |;
	//               |
	//               |////////////////////////////////////////////////////////////////////////////////
	//               |ВЫБРАТЬ
	//               |	втТовары.ВидДвижения,
	//               |	втТовары.Регистратор,
	//               |	втТовары.Период,
	//               |	втТовары.СтрокаЗаявки,
	//               |	ТоварыКРезервированиюОстатки.СтрокаПрихода,
	//               |	втТовары.Склад,
	//               |	втТовары.Номенклатура,
	//               |	ВЫБОР
	//               |		КОГДА втТовары.Количество < ТоварыКРезервированиюОстатки.КоличествоОстаток
	//               |			ТОГДА втТовары.Количество
	//               |		ИНАЧЕ ТоварыКРезервированиюОстатки.КоличествоОстаток
	//               |	КОНЕЦ КАК Количество
	//               |ИЗ
	//               |	втТовары КАК втТовары
	//               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКРезервированию.Остатки(
	//               |				&КонПериода,
	//               |				(СтрокаЗаявки, СтрокаПрихода, Склад, Номенклатура) В
	//               |					(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//               |						втТовары.СтрокаЗаявки,
	//               |						втТовары.СтрокаПрихода,
	//               |						втТовары.Склад,
	//               |						втТовары.Номенклатура
	//               |					ИЗ
	//               |						втТовары КАК втТовары)) КАК ТоварыКРезервированиюОстатки
	//               |		ПО втТовары.СтрокаЗаявки = ТоварыКРезервированиюОстатки.СтрокаЗаявки
	//               |			И втТовары.Склад = ТоварыКРезервированиюОстатки.Склад
	//               |			И втТовары.Номенклатура = ТоварыКРезервированиюОстатки.Номенклатура
	//               |			И втТовары.СтрокаПрихода = ТоварыКРезервированиюОстатки.СтрокаПрихода
	//               |ГДЕ
	//               |	ВЫБОР
	//               |			КОГДА втТовары.Количество < ТоварыКРезервированиюОстатки.КоличествоОстаток
	//               |				ТОГДА втТовары.Количество
	//               |			ИНАЧЕ ТоварыКРезервированиюОстатки.КоличествоОстаток
	//               |		КОНЕЦ > 0";
	//	
	//Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	//Запрос.УстановитьПараметр("КонПериода", вхСсылкаНаДокумент.МоментВремени());
	//ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);	
	//
	//Возврат ТаблицаДвижений;
	//
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
	               |	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	               |	ПеремещениеТоваровТовары.СтрокаЗаявки КАК СтрокаЗаявки,
	               |	ПеремещениеТоваровТовары.СтрокаПрихода КАК СтрокаПрихода,
	               |	ПеремещениеТоваровТовары.КоличествоПлан КАК Количество
	               |ПОМЕСТИТЬ втТовары
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Склад,
	               |	СтрокаЗаявки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварыКРезервированиюОстатки.Склад,
	               |	ТоварыКРезервированиюОстатки.Номенклатура,
	               |	ТоварыКРезервированиюОстатки.СтрокаЗаявки,
	               |	ТоварыКРезервированиюОстатки.СтрокаПрихода,
	               |	ТоварыКРезервированиюОстатки.КоличествоОстаток КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ТоварыКРезервированию.Остатки(
	               |			&КонПериода,
	               |			(Номенклатура, Склад, СтрокаЗаявки) В
	               |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |					втТовары.Номенклатура,
	               |					втТовары.Склад,
	               |					втТовары.СтрокаЗаявки
	               |				ИЗ
	               |					втТовары)) КАК ТоварыКРезервированиюОстатки
	               |
	               |ДЛЯ ИЗМЕНЕНИЯ
	               |	РегистрНакопления.ТоварыКРезервированию.Остатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТовары.Склад,
	               |	втТовары.Номенклатура,
	               |	втТовары.СтрокаЗаявки,
	               |	втТовары.СтрокаПрихода,
	               |	втТовары.Количество
	               |ИЗ
	               |	втТовары КАК втТовары";
				   
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("КонПериода", ?(ОперативноеПроведение, Неопределено, вхСсылкаНаДокумент.МоментВремени()));
	
	Результаты = Запрос.ВыполнитьПакет();
	Выборка = Результаты[1].Выгрузить();
	Товары = Результаты[2].Выбрать();
	ТаблицаНеудалосьРаспределить = Выборка.СкопироватьКолонки();
	
	Пока Товары.Следующий() Цикл 
		Отбор = Новый Структура("Склад,Номенклатура,СтрокаЗаявки,СтрокаПрихода");
		ЗаполнитьЗначенияСвойств(Отбор, Товары);
		Строки = Выборка.НайтиСтроки(Отбор);
		
		КоличествоРаспределить = Товары.Количество;
		ИндексСтроки = 0;
		Пока КоличествоРаспределить > 0 И ИндексСтроки < Строки.Количество() Цикл 
			СтрокаТовКРезерв = Строки.Получить(ИндексСтроки);
			Если СтрокаТовКРезерв.Количество > 0 Тогда 
				СписываемоеКоличество = Мин(КоличествоРаспределить, СтрокаТовКРезерв.Количество);
				СтрокаДвижений = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаТовКРезерв);
				СтрокаДвижений.Количество = СписываемоеКоличество;
				СтрокаТовКРезерв.Количество = СтрокаТовКРезерв.Количество - СписываемоеКоличество;
				КоличествоРаспределить = КоличествоРаспределить - СписываемоеКоличество;
			КонецЕсли;
			ИндексСтроки = ИндексСтроки + 1;
		КонецЦикла;
		Если КоличествоРаспределить > 0 Тогда 
			НоваяСтрока = ТаблицаНеудалосьРаспределить.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Товары);
			НоваяСтрока.Количество = КоличествоРаспределить;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из ТаблицаНеудалосьРаспределить Цикл 
		Отбор = Новый Структура("Склад,Номенклатура,СтрокаЗаявки");
		ЗаполнитьЗначенияСвойств(Отбор, Строка);
		Строки = Выборка.НайтиСтроки(Отбор);
		
		КоличествоРаспределить = Строка.Количество;
		ИндексСтроки = 0;
		Пока КоличествоРаспределить > 0 И ИндексСтроки < Строки.Количество() Цикл
			СтрокаТовКРезерв = Строки.Получить(ИндексСтроки);
			Если СтрокаТовКРезерв.Количество > 0 Тогда 
				СписываемоеКоличество = Мин(КоличествоРаспределить, СтрокаТовКРезерв.Количество);
				СтрокаДвижений = ТаблицаДвижений.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаТовКРезерв);
				СтрокаДвижений.Количество = СписываемоеКоличество;
				СтрокаТовКРезерв.Количество = СтрокаТовКРезерв.Количество - СписываемоеКоличество;
				КоличествоРаспределить = КоличествоРаспределить - СписываемоеКоличество;
			КонецЕсли;
			ИндексСтроки = ИндексСтроки + 1;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаДвижений.ЗаполнитьЗначения(вхСсылкаНаДокумент, "Регистратор");
	ТаблицаДвижений.ЗаполнитьЗначения(Реквизиты.Дата, "Период");
	ТаблицаДвижений.ЗаполнитьЗначения(ВидДвиженияНакопления.Расход, "ВидДвижения");

	Возврат ТаблицаДвижений;
	
КонецФункции

Функция РегистрыНакопления_ТоварыВПути(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_РегистрыНакопления_ТоварыВПути";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ТаблицаДвижений = Неопределено;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ТоварыВПути", ТаблицаДвижений);
	
	ПеремещенияВыгружаютсяИз77 = глЗначениеПеременной("ПеремещенияВыгружаютсяИз77");	
	Если ПеремещенияВыгружаютсяИз77 Тогда 
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "Дата,СтатусДокумента,ВидОперации,ДокументОснование");
		
	Если Реквизиты.Дата < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	Если Реквизиты.Дата < глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	Если Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровНовый 
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение
		ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу 
		Или Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	ПеремещениеТоваровТовары.Ссылка КАК Регистратор,
	               |	ПеремещениеТоваровТовары.Ссылка.Дата КАК Период,
	               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	               |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
	               |	ПеремещениеТоваровТовары.Номенклатура,
	               |	ПеремещениеТоваровТовары.Качество,
	               |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	               |	ПеремещениеТоваровТовары.Ссылка КАК ДокументОснование,
	               |	ВЫБОР
	               |		КОГДА ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
	               |			ТОГДА ПеремещениеТоваровТовары.Количество
	               |		ИНАЧЕ ПеремещениеТоваровТовары.КоличествоПлан
	               |	КОНЕЦ КАК Количество
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка.Ссылка = &Ссылка
	               |	И ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ОтгрузкаТопЛог)
	               |	И ВЫБОР
	               |			КОГДА ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
	               |				ТОГДА ПеремещениеТоваровТовары.Количество
	               |			ИНАЧЕ ПеремещениеТоваровТовары.КоличествоПлан
	               |		КОНЕЦ > 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	               |	ПеремещениеТоваровТовары.Ссылка,
	               |	ПеремещениеТоваровТовары.Ссылка.Дата,
	               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	               |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
	               |	ПеремещениеТоваровТовары.Номенклатура,
	               |	ПеремещениеТоваровТовары.Качество,
	               |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	               |	ПеремещениеТоваровТовары.Ссылка.ДокументОснование,
	               |	ПеремещениеТоваровТовары.КоличествоПлан
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка.Ссылка = &Ссылка
	               |	И ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог)
	               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)";
				   
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);	
	
	Возврат ТаблицаДвижений;
	
КонецФункции

Функция РегистрыНакопления_ПополнениеСклада(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_РегистрыНакопления_ПополнениеСклада";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ТаблицаДвижений = Новый ТаблицаЗначений;  
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ПополнениеСклада", ТаблицаДвижений);
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "Дата,СтатусДокумента,ВидОперации,ДокументОснование");
		
	Если Реквизиты.Дата < глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;

	Если Реквизиты.Дата < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	ПеремещенияВыгружаютсяИз77 = глЗначениеПеременной("ПеремещенияВыгружаютсяИз77");	
	Если Не ПеремещенияВыгружаютсяИз77 Тогда 
		Если Не (Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил 
			И (Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог 
			ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение
			ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу
			ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)) Тогда
			Возврат ТаблицаДвижений;
		КонецЕсли;
		Если Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог Тогда 
			ДокументОснование = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Реквизиты.ДокументОснование, "ДокументОснование");
		ИначеЕсли Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение
			ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу 
			ИЛИ Реквизиты.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику Тогда 
			ДокументОснование = Реквизиты.ДокументОснование;
		КонецЕсли;
		
	Иначе
		Если Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровНовый Тогда
			Возврат ТаблицаДвижений;
		КонецЕсли;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПеремещениеТоваровТовары.Ссылка КАК Регистратор,
	               |	ПеремещениеТоваровТовары.Ссылка.Дата КАК Период,
	               |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель КАК Склад,
	               |	ПеремещениеТоваровТовары.Номенклатура,
	               |	ПеремещениеТоваровТовары.Качество,
	               |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	               |	ПеремещениеТоваровТовары.Количество
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	               |	И ПеремещениеТоваровТовары.СтрокаЗаявки <> &ПустаяСтрокаЗаявки
				   //|	И ПеремещениеТоваровТовары.СтрокаЗаявки.ПрайсПоставщика.Склад = &ПустойСклад
	               |	И ПеремещениеТоваровТовары.Количество > 0
	               |	И ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийЗаявкаПокупателя.ПополнениеСклада)
	               |	И ПеремещениеТоваровТовары.Поступление <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	               |	И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ПриРазмещенииИгнорироватьСтатусПартии";
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("ПустаяСтрокаЗаявки", Справочники.ИдентификаторыСтрокЗаявок.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустойСклад", Справочники.Склады.ПустаяСсылка());
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);
	
	Возврат ТаблицаДвижений;

КонецФункции

Функция РегистрыНакопления_ОтказыПоЗаявкам(вхСсылкаНаДокумент, вхОтказ, вхПараметры = Неопределено)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_РегистрыНакопления_ОтказыПоЗаявкам";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ТаблицаДвижений = Новый ТаблицаЗначений;
	ОбщегоНазначения.СоздатьСтруктуруРегистраНакопления("ОтказыПоЗаявкам", ТаблицаДвижений);
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "Дата,СтатусДокумента,ВидОперации,ДокументОснование");
	
	ПеремещенияВыгружаютсяИз77 = глЗначениеПеременной("ПеремещенияВыгружаютсяИз77");	
	
	Если Не ПеремещенияВыгружаютсяИз77 Тогда 
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	Если Реквизиты.Дата < глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда
		Возврат ТаблицаДвижений;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПеремещениеТоваровТовары.Ссылка КАК Регистратор,
	                |	ПеремещениеТоваровТовары.Ссылка.Дата КАК Период,
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	                |	&ПричинаОтказа,
	                |	ПеремещениеТоваровТовары.КоличествоПлан - ПеремещениеТоваровТовары.Количество КАК Количество
	                |ИЗ
	                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                |ГДЕ
	                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	                |	И ПеремещениеТоваровТовары.КоличествоПлан - ПеремещениеТоваровТовары.Количество > 0
	                |	И ПеремещениеТоваровТовары.Поступление <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
	                |	И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ПриРазмещенииИгнорироватьСтатусПартии";
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("ПричинаОтказа", Справочники.СостоянияСтрокДокументов.НеНайденоПриСборке);
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Запрос.Выполнить().Выгрузить(), ТаблицаДвижений);
	
	Возврат ТаблицаДвижений;
	
КонецФункции

//// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьМетаданные()
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ПолучитьМетаданные";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	Возврат Метаданные.Документы.ПеремещениеТоваров;	
КонецФункции

Функция ТаблицыДляРасчетаСписанияПоПартиям(вхСсылкаНаДокумент, вхФильтр = Неопределено, вхПараметры = Неопределено) Экспорт
	
	лКлючАлгоритма = "ДокументПеремещениеТоваров_МодульМенеджера_ТаблицыДляРасчетаСписанияПоПартиям";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;		
	
	Если вхПараметры = Неопределено Тогда
		вхПараметры = Новый Структура;
	КонецЕсли;
	
	Товары = Неопределено;
	вхПараметры.Свойство("Товары", Товары);
	
	ПеремещенияВыгружаютсяИз77 = глЗначениеПеременной("ПеремещенияВыгружаютсяИз77");	
	Если Не ПеремещенияВыгружаютсяИз77 Тогда 	
 
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		                |	ПеремещениеТоваровТовары.Ссылка,
		                |	ПеремещениеТоваровТовары.Ссылка.Дата,
		                |	ПеремещениеТоваровТовары.Номенклатура,
		                |	ПеремещениеТоваровТовары.КоличествоПлан КАК Количество,
		                |	ПеремещениеТоваровТовары.СтрокаПрихода,
		                |	""Списание"" КАК ВидСписания,
		                |	ПеремещениеТоваровТовары.СтрокаПрихода = &ПустаяСтрокаПрихода КАК ПустаяСтрокаПрихода,
		                |	ВЫБОР
		                |		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.СкладVMI
		                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
		                |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
		                |	КОНЕЦ КАК СтатусПартии,
		                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
		                |	ПеремещениеТоваровТовары.Качество,
		                |	NULL КАК СкладПеремещения,
		                |	NULL КАК КачествоПеремещения
		                |ИЗ
		                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		                |ГДЕ
		                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		                |	И (ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение)
						|		ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу)
						|  ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)) %УсловиеПоНоменклатуре%
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	ПеремещениеТоваровТовары.Ссылка,
		                |	ПеремещениеТоваровТовары.Ссылка.Дата,
		                |	ПеремещениеТоваровТовары.Номенклатура,
		                |	ВЫБОР
		                |		КОГДА ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
		                |			ТОГДА ПеремещениеТоваровТовары.Количество
		                |		ИНАЧЕ ПеремещениеТоваровТовары.КоличествоПлан
		                |	КОНЕЦ,
		                |	ПеремещениеТоваровТовары.СтрокаПрихода,
		                |	""Списание"",
		                |	ПеремещениеТоваровТовары.СтрокаПрихода = &ПустаяСтрокаПрихода,
		                |	ВЫБОР
		                |		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.СкладVMI
		                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
		                |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
		                |	КОНЕЦ,
		                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
		                |	ПеремещениеТоваровТовары.Качество,
		                |	NULL,
		                |	NULL
		                |ИЗ
		                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		                |ГДЕ
		                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		                |	И ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ОтгрузкаТопЛог)
		                |	И ВЫБОР
		                |			КОГДА ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
		                |				ТОГДА ПеремещениеТоваровТовары.Количество
		                |			ИНАЧЕ ПеремещениеТоваровТовары.КоличествоПлан
		                |		КОНЕЦ > 0  %УсловиеПоНоменклатуре%
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	ПеремещениеТоваровТовары.Ссылка,
		                |	ПеремещениеТоваровТовары.Ссылка.Дата,
		                |	ПеремещениеТоваровТовары.Номенклатура,
		                |	ПеремещениеТоваровТовары.КоличествоПлан,
		                |	ПеремещениеТоваровТовары.СтрокаПрихода,
		                |	""Перемещение"",
		                |	ПеремещениеТоваровТовары.СтрокаПрихода = &ПустаяСтрокаПрихода,
		                |	ВЫБОР
		                |		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.СкладVMI
		                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
		                |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
		                |	КОНЕЦ,
		                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
		                |	ПеремещениеТоваровТовары.Качество,
		                |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
		                |	ЗНАЧЕНИЕ(Справочник.Качество.Недостача)
		                |ИЗ
		                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		                |ГДЕ
		                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		                |	И (ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение)
						|		ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу)
						|      ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)) %УсловиеПоНоменклатуре%
		                |
		                |ОБЪЕДИНИТЬ ВСЕ
		                |
		                |ВЫБРАТЬ
		                |	ПеремещениеТоваровТовары.Ссылка,
		                |	ПеремещениеТоваровТовары.Ссылка.Дата,
		                |	ПеремещениеТоваровТовары.Номенклатура,
		                |	ВЫБОР
		                |		КОГДА ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
		                |			ТОГДА ПеремещениеТоваровТовары.КоличествоПлан - ПеремещениеТоваровТовары.Количество
		                |		ИНАЧЕ 0
		                |	КОНЕЦ,
		                |	ПеремещениеТоваровТовары.СтрокаПрихода,
		                |	""Перемещение"",
		                |	ПеремещениеТоваровТовары.СтрокаПрихода = &ПустаяСтрокаПрихода,
		                |	ВЫБОР
		                |		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.СкладVMI
		                |			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
		                |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
		                |	КОНЕЦ,
		                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
		                |	ПеремещениеТоваровТовары.Качество,
		                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
		                |	ЗНАЧЕНИЕ(Справочник.Качество.Недостача)
		                |ИЗ
		                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		                |ГДЕ
		                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		                |	И ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ОтгрузкаТопЛог)
		                |	И ВЫБОР
		                |			КОГДА ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
		                |				ТОГДА ПеремещениеТоваровТовары.КоличествоПлан - ПеремещениеТоваровТовары.Количество
		                |			ИНАЧЕ 0
		                |		КОНЕЦ > 0 %УсловиеПоНоменклатуре%";
		Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
		Запрос.УстановитьПараметр("ПустаяСтрокаПрихода", Справочники.ИдентификаторыСтрокПриходов.ПустаяСсылка());
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеПоНоменклатуре%", " И ПеремещениеТоваровТовары.Номенклатура");
		Если ТипЗнч(вхФильтр) = Тип("Структура") и вхФильтр.Свойство("Номенклатура") Тогда 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеПоНоменклатуре%", " И ПеремещениеТоваровТовары.Номенклатура = &Номенклатура");
			Запрос.УстановитьПараметр("Номенклатура", вхФильтр.Номенклатура);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеПоНоменклатуре%", "");
		КонецЕсли;

	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		                |	ПеремещениеТоваровТовары.Ссылка,
		                |	ПеремещениеТоваровТовары.НомерСтроки,
		                |	ПеремещениеТоваровТовары.Поступление,
		                |	ПеремещениеТоваровТовары.Номенклатура,
		                |	ПеремещениеТоваровТовары.ЕдиницаИзмерения,
		                |	ПеремещениеТоваровТовары.Коэффициент,
		                |	ПеремещениеТоваровТовары.Количество,
		                |	ПеремещениеТоваровТовары.КоличествоНеПринято,
		                |	ПеремещениеТоваровТовары.Качество,
		                |	ПеремещениеТоваровТовары.СтрокаПрихода,
		                |	ПеремещениеТоваровТовары.СтрокаЗаявки,
		                |	ПеремещениеТоваровТовары.КоличествоПлан,
		                |	ПеремещениеТоваровТовары.Организация
		                |ПОМЕСТИТЬ Товары
		                |ИЗ
		                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		                |ГДЕ
		                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		                |;
		                |
		                |////////////////////////////////////////////////////////////////////////////////
		                |ВЫБРАТЬ
		                |	ПеремещениеТоваровТовары.Ссылка,
		                |	ПеремещениеТоваровТовары.Ссылка.Дата,
		                |	ПеремещениеТоваровТовары.Номенклатура,
		                |	ПеремещениеТоваровТовары.Количество КАК Количество,
		                |	ПеремещениеТоваровТовары.СтрокаПрихода,
		                |	""Перемещение"" КАК ВидСписания,
		                |	ПеремещениеТоваровТовары.СтрокаПрихода = &ПустаяСтрокаПрихода КАК ПустаяСтрокаПрихода,
		                |	ВЫБОР
		                |		КОГДА ПеремещениеТоваровТовары.Поступление = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		                |				ИЛИ НЕ ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ПриРазмещенииИгнорироватьСтатусПартии
		                |			ТОГДА ВЫБОР
		                |					КОГДА ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.СкладVMI
		                |						ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
		                |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
		                |				КОНЕЦ
		                |		ИНАЧЕ ВЫБОР
		                |				КОГДА ПеремещениеТоваровТовары.Поступление.ВидОперацииПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.ОтветХранение)
		                |					ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
		                |				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
		                |			КОНЕЦ
		                |	КОНЕЦ КАК СтатусПартии,
		                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
		                |	ПеремещениеТоваровТовары.Качество,
		                |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель КАК СкладПеремещения,
		                |	ПеремещениеТоваровТовары.Качество КАК КачествоПеремещения,
		                |	ВЫБОР
		                |		КОГДА ПеремещениеТоваровТовары.Поступление = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		                |				ИЛИ НЕ ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ПриРазмещенииИгнорироватьСтатусПартии
		                |			ТОГДА ВЫБОР
		                |					КОГДА ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.СкладVMI
		                |						ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
		                |					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
		                |				КОНЕЦ
		                |		ИНАЧЕ ВЫБОР
		                |				КОГДА ПеремещениеТоваровТовары.Поступление.ВидОперацииПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.ОтветХранение)
		                |					ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.ПринятыйНаОтветХранение)
		                |				ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыПартии.Собственный)
		                |			КОНЕЦ
		                |	КОНЕЦ КАК СтатусПартииПеремещения,
		                |	(ПеремещениеТоваровТовары.Поступление = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		                |		ИЛИ НЕ ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ПриРазмещенииИгнорироватьСтатусПартии)
		                |		И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.СкладVMI
		                |		И НЕ ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.СкладVMI КАК ОприходоватьПоVMI,
		                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ПриРазмещенииИгнорироватьСтатусПартии КАК ИгнорироватьСтатусПартии,
		                |	ВЫБОР
		                |		КОГДА ПеремещениеТоваровТовары.Организация = &ПустаяОрганизация
		                |			ТОГДА ПеремещениеТоваровТовары.Ссылка.Организация
		                |		ИНАЧЕ ПеремещениеТоваровТовары.Организация
		                |	КОНЕЦ КАК Организация,
		                |	((ПеремещениеТоваровТовары.Поступление = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		                |			ИЛИ НЕ ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ПриРазмещенииИгнорироватьСтатусПартии)
		                |			И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.СкладVMI
		                |		ИЛИ ПеремещениеТоваровТовары.Поступление <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		                |			И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ПриРазмещенииИгнорироватьСтатусПартии
		                |			И ПеремещениеТоваровТовары.Поступление.ВидОперацииПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.ОтветХранение))
		                |		И (НЕ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная, ИСТИНА)
		                |			И ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) <> &ПустаяЗаявка) КАК УчитыватьПоставщика,
		                |	ПеремещениеТоваровТовары.СтрокаЗаявки.Поставщик КАК Поставщик,
						//Валиахметов 08.04.2019 Для задачи  http://jira.part-kom.ru/browse/XX-2279
						|	ВЫБОР
		                |		КОГДА ПеремещениеТоваровТовары.Поступление = ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		                |					И ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.СкладVMI
		                |					И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ПриРазмещенииИгнорироватьСтатусПартии
		                |				ИЛИ НЕ ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ПриРазмещенииИгнорироватьСтатусПартии
		                |					И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.СкладVMI
		                |				ИЛИ ПеремещениеТоваровТовары.Поступление <> ЗНАЧЕНИЕ(Документ.ПоступлениеТоваровУслуг.ПустаяСсылка)
		                |					И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ПриРазмещенииИгнорироватьСтатусПартии
		                |					И ПеремещениеТоваровТовары.Поступление.ВидОперацииПоступления = ЗНАЧЕНИЕ(Перечисление.ВидыПоступленияТоваров.ОтветХранение)
		                |			ТОГДА &ВидДоговора1
		                |		ИНАЧЕ &ВидДоговора2
		                |	КОНЕЦ КАК ВидДоговора,
		                |	ПеремещениеТоваровТовары.НомерСтроки КАК НомерСтрокиВДокументе,
		                |	ИСТИНА КАК ВнутреннееПеремещение,
						//	25.02.2019 Валиахметов XX-1920
						//Изменение алгоритма проведения перемещения
						|	ВЫБОР
		                |		КОГДА ПеремещениеТоваровТовары.Ссылка.Дата >= &ДатаДокументОснование
		                |				И ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.ТоварыВПути
		                |			ТОГДА ПеремещениеТоваровТовары.Ссылка
		                |		ИНАЧЕ НЕОПРЕДЕЛЕНО
		                |	КОНЕЦ КАК ДокументОснованиеПеремещения,
		                |	ВЫБОР
		                |		КОГДА ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ТоварыВПути
		                |				ИЛИ ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ЭтоСкладПриемкаТоплог
		                |			ТОГДА ПеремещениеТоваровТовары.Ссылка.ДокументОснование
		                |		ИНАЧЕ НЕОПРЕДЕЛЕНО
		                |	КОНЕЦ КАК ДокументОснование
						//	25.02.2019 Валиахметов XX-1920
						//Изменение алгоритма проведения перемещения
						|ИЗ
		                |	Товары КАК ПеремещениеТоваровТовары
		                |ГДЕ
		                |	(ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение)
		                |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог)
		                |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу)
						| 			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику))
		                |	И ПеремещениеТоваровТовары.Количество > 0";
		Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
		Запрос.УстановитьПараметр("ПустаяСтрокаПрихода", Справочники.ИдентификаторыСтрокПриходов.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПустаяОрганизация", Справочники.Организации.ПустаяСсылка());
		Запрос.УстановитьПараметр("ПустаяЗаявка", Документы.ЗаявкаПокупателя.ПустаяСсылка());
		Запрос.УстановитьПараметр("ВидДоговора1", Перечисления.ВидыДоговоровКонтрагентов.ОтветХранение);
		Запрос.УстановитьПараметр("ВидДоговора2", Перечисления.ВидыДоговоровКонтрагентов.ПустаяСсылка());
		Если ТипЗнч(вхФильтр) = Тип("Структура") и вхФильтр.Свойство("Номенклатура") Тогда 
			Запрос.Текст = Запрос.Текст + " И ПеремещениеТоваровТовары.Номенклатура = &Номенклатура";
			Запрос.УстановитьПараметр("Номенклатура", вхФильтр.Номенклатура);
		КонецЕсли;
		Запрос.УстановитьПараметр("ДатаДокументОснование", Константы.ДатаДокументОснованиеПартииТоваров.Получить());
		//Если таблица товаров передана в параметрах, то используем её
		Если ТипЗнч(Товары) = Тип("ТаблицаЗначений") Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Документ.ПеремещениеТоваров.Товары", "&Товары"); 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ
		                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка", ""); 
		КонецЕсли;
		Запрос.УстановитьПараметр("Товары", Товары);
		
		
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

Функция ТаблицаДляКонтроляОстатков(вхСсылкаНаДокумент) Экспорт 
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ТаблицаДляКонтроляОстатков";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ПеремещенияВыгружаютсяИз77 = глЗначениеПеременной("ПеремещенияВыгружаютсяИз77");	
	Если Не ПеремещенияВыгружаютсяИз77 Тогда 	

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Качество,
		               |	СУММА(ПеремещениеТоваровТовары.КоличествоПлан) КАК Количество
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		               |	И (ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ОтгрузкаТопЛог)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение)
					   |            ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику))
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Качество";
		Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Качество,
		               |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		               |	И (ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.СвободноеПеремещение)
		               |			ИЛИ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику))
		               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Качество";
		Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура КонтрольОстатковТоваровВПути(вхСсылкаНаДокумент, вхОтказ) Экспорт
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_КонтрольОстатковТоваровВПути";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	
	Если глЗначениеПеременной("ПеремещенияВыгружаютсяИз77") Тогда 
		Возврат;
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "Дата,СтатусДокумента,ВидОперации");
	
	Если Реквизиты.Дата < ПараметрыСеанса.ДатаНачалаРаботыТовары ИЛИ Реквизиты.Дата < глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда
		Возврат;
	КонецЕсли;
	
	Если Реквизиты.ВидОперации <> Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог Тогда 
		Возврат;
	КонецЕсли;
	
	Если Реквизиты.СтатусДокумента <> Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	                |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
	                |	ПеремещениеТоваровТовары.Номенклатура,
	                |	ПеремещениеТоваровТовары.Качество,
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	                |	ПеремещениеТоваровТовары.Ссылка.ДокументОснование,
	                |	СУММА(ПеремещениеТоваровТовары.КоличествоПлан) КАК Количество
	                |ПОМЕСТИТЬ втТовары
	                |ИЗ
	                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                |ГДЕ
	                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПеремещениеТоваровТовары.Ссылка.ДокументОснование,
	                |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	                |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель,
	                |	ПеремещениеТоваровТовары.Номенклатура,
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	                |	ПеремещениеТоваровТовары.Качество
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	втТовары.СкладОтправитель,
	                |	втТовары.СкладПолучатель,
	                |	втТовары.Номенклатура,
	                |	втТовары.Качество,
	                |	втТовары.СтрокаЗаявки,
	                |	втТовары.ДокументОснование,
	                |	втТовары.Количество - ЕСТЬNULL(ТоварыВПутиОстатки.КоличествоОстаток, 0) КАК Количество
	                |ИЗ
	                |	втТовары КАК втТовары
	                |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВПути.Остатки(
	                |				&КонПериода,
	                |				(СкладОтправитель, СкладПолучатель, Номенклатура, Качество, СтрокаЗаявки, ДокументОснование) В
	                |					(ВЫБРАТЬ
	                |						втТовары.СкладОтправитель,
	                |						втТовары.СкладПолучатель,
	                |						втТовары.Номенклатура,
	                |						втТовары.Качество,
	                |						втТовары.СтрокаЗаявки,
	                |						втТовары.ДокументОснование
	                |					ИЗ
	                |						втТовары)) КАК ТоварыВПутиОстатки
	                |		ПО втТовары.СкладОтправитель = ТоварыВПутиОстатки.СкладОтправитель
	                |			И втТовары.СкладПолучатель = ТоварыВПутиОстатки.СкладПолучатель
	                |			И втТовары.Номенклатура = ТоварыВПутиОстатки.Номенклатура
	                |			И втТовары.Качество = ТоварыВПутиОстатки.Качество
	                |			И втТовары.СтрокаЗаявки = ТоварыВПутиОстатки.СтрокаЗаявки
	                |			И втТовары.ДокументОснование = ТоварыВПутиОстатки.ДокументОснование
	                |ГДЕ
	                |	втТовары.Количество - ЕСТЬNULL(ТоварыВПутиОстатки.КоличествоОстаток, 0) > 0";
					
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("КонПериода", вхСсылкаНаДокумент.МоментВремени());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			вхОтказ = Истина;
			Сообщить("[КонтрольОстатковТоваровПути]: по документу-основанию: " + Выборка.ДокументОснование + " не хватает остатка " + Выборка.Номенклатура + " с качеством " + Выборка.Качество + " в количестве " + Выборка.Количество);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ОбработкаПолученияПредставления";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	Если ЗначениеЗаполнено(Данные.ДокументОснование) И ТипЗнч(Данные.ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда 
		СтандартнаяОбработка = Ложь;
		Представление = "Перемещение товаров " + Данные.Номер + " от " + Данные.Дата + " (Размещение)";
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ОбработкаПолученияПолейПредставления";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ДокументОснование");
КонецПроцедуры

Функция ПолучитьЗаписиПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, Проведение) Экспорт 
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ПолучитьЗаписиПоследовательности";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	лМетаданныеПоследовательности = Неопределено;	
	Если (ТипЗнч(вхПоследовательность) = Тип("Строка")) тогда
		лМетаданныеПоследовательности = Метаданные.Последовательности.Найти(вхПоследовательность);
	ИначеЕсли (ТипЗнч(вхПоследовательность) = Тип("ОбъектМетаданных")) И Метаданные.Последовательности.Содержит(вхПоследовательность) тогда
		лМетаданныеПоследовательности = вхПоследовательность;
	КонецЕсли;
	
	Если (лМетаданныеПоследовательности = Неопределено) тогда
		ВызватьИсключение "[ПолучитьДанныеДляПоследовательности]: неправильный параметр номер 1.";
	КонецЕсли;
	
	лМетаданныеДокумента = вхСсылкаНаДокумент.Метаданные();
	Если НЕ лМетаданныеПоследовательности.Документы.Содержит(лМетаданныеДокумента) тогда
		ВызватьИсключение "[ПолучитьДанныеДляПоследовательности]: неправильный параметр номер 1.";
	КонецЕсли;
	
	Дата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата");
	лРезультат = ОбщегоНазначения.СоздатьСтруктуруПоследовательности(лМетаданныеПоследовательности);
	Если (лМетаданныеПоследовательности = Метаданные.Последовательности.ПартионныйУчет) тогда
		Если Проведение 
			И Дата >= ПараметрыСеанса.ДатаНачалаРаботыТовары 
			И Дата >= глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			               |	ПеремещениеТоваровТовары.Ссылка.Дата КАК Период,
			               |	ПеремещениеТоваровТовары.Ссылка КАК Регистратор,
			               |	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура
			               |ИЗ
			               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
			               |ГДЕ
			               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл 
				ЗаполнитьЗначенияСвойств(лРезультат.Добавить(), Выборка); 
			КонецЦикла;
		КонецЕсли;
		
		Результат = ПроведениеДокументовКлиентСервер.ПолучитьМоментыВремени(лМетаданныеПоследовательности, лРезультат);
		
	Иначе
		
		ВызватьИсключение "[ПолучитьЗаписиПоследовательности]: неправильный параметр номер 1.";
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхПараметры = Неопределено)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_НачатьКорректировкуГраницПоследовательности";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	РаботаСПоследовательностямиКлиентСервер.НачатьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхПараметры);	
КонецПроцедуры

Процедура ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхПараметры = Неопределено)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗакончитьКорректировкуГраницПоследовательности";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	РаботаСПоследовательностямиКлиентСервер.ЗакончитьКорректировкуГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхПараметры);	
КонецПроцедуры

Функция ПолучитьДанныеГраницПоследовательности(вхСсылкаНаДокумент, вхПоследовательность, вхФильтр = Неопределено) Экспорт
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ПолучитьДанныеГраницПоследовательности";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	Результат = Неопределено;
	лМетаданныеПоследовательности = Неопределено;
	Если (ТипЗнч(вхПоследовательность) = Тип("Строка")) тогда
		лМетаданныеПоследовательности = Метаданные.Последовательности.Найти(вхПоследовательность);
	ИначеЕсли (ТипЗнч(вхПоследовательность) = Тип("ОбъектМетаданных")) И Метаданные.Последовательности.Содержит(вхПоследовательность) тогда
		лМетаданныеПоследовательности = вхПоследовательность;
	КонецЕсли;
	
	Если (лМетаданныеПоследовательности = Неопределено) тогда
		ВызватьИсключение "[ПолучитьДанныеГраницПоследовательности]: неправильный параметр номер 2.";	
	КонецЕсли;
	
	Если (лМетаданныеПоследовательности = Метаданные.Последовательности.ПартионныйУчет) тогда
		Результат = ПроведениеДокументовКлиентСервер.ЗначенияДвиженийДокумента(вхСсылкаНаДокумент,
		Метаданные.РегистрыНакопления.ПартииТоваров, вхФильтр);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура КонтрольОстатков(вхСсылкаНаДокумент, вхОтказ, вхПараметры) Экспорт
	
	Перем ОтключитьКонтрольОстатков;
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_КонтрольОстатков";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
		
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "Дата") < глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда
		Возврат;
	КонецЕсли;
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(вхСсылкаНаДокумент, "СтатусДокумента,Дата");
	
	СтатусДокумента = Реквизиты.СтатусДокумента;
	ДатаДокумента = Реквизиты.Дата;
	

	Если Не (СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил) Тогда
		Возврат;
	КонецЕсли;
		
	Если ДатаДокумента < глЗначениеПеременной("ДатаЗапускаПервогоЭтапа") Тогда
		Возврат;
	КонецЕсли;

	Если ДатаДокумента < ПараметрыСеанса.ДатаНачалаРаботыТовары Тогда
		Возврат;
	КонецЕсли;
	
	ОперативноеПроведение = ПроведениеДокументовКлиентСервер.ОперативноеПроведение(вхПараметры);
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
	//               |	ПеремещениеТоваровТовары.Номенклатура,
	//               |	ПеремещениеТоваровТовары.Качество,
	//               |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	//               |	ВЫБОР
	//               |		КОГДА ПеремещениеТоваровТовары.КоличествоПлан >= ПеремещениеТоваровТовары.Количество
	//               |			ТОГДА ПеремещениеТоваровТовары.КоличествоПлан
	//               |		ИНАЧЕ ПеремещениеТоваровТовары.Количество
	//               |	КОНЕЦ КАК Количество
	//               |ИЗ
	//               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	//               |ГДЕ
	//               |	ПеремещениеТоваровТовары.Поступление = &ПустоеПоступление
	//               |	И ПеремещениеТоваровТовары.СтрокаЗаявки <> &ПустаяСтрокаЗаявки
	//               |	И ПеремещениеТоваровТовары.Ссылка = &Ссылка
	//               |	И НЕ ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная";
	//Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	//Запрос.УстановитьПараметр("ПустоеПоступление", Документы.ПоступлениеТоваровУслуг.ПустаяСсылка());
	//Запрос.УстановитьПараметр("ПустаяСтрокаЗаявки", Справочники.ИдентификаторыСтрокЗаявок.ПустаяСсылка());
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//Если РезультатЗапроса.Пустой() Тогда 
	//	Возврат;
	//КонецЕсли;
	
	Если ПроведениеДокументовКлиентСервер.ПрочитатьЗначение(вхПараметры, "ОтключитьКонтрольОстатков", ОтключитьКонтрольОстатков) Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
	|	ПеремещениеТоваровТовары.Качество,
	|	ПеремещениеТоваровТовары.СтрокаЗаявки,
	|	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	|	И ПеремещениеТоваровТовары.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	|	ПеремещениеТоваровТовары.Качество,
	|	ПеремещениеТоваровТовары.СтрокаЗаявки";
	
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	втТовары = РезультатЗапроса.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	втТовары.Склад КАК Склад,
	               |	втТовары.Номенклатура КАК Номенклатура,
	               |	втТовары.Качество КАК Качество,
	               |	втТовары.СтрокаЗаявки КАК СтрокаЗаявки,
	               |	втТовары.Количество КАК Количество
	               |ПОМЕСТИТЬ втТовары
	               |ИЗ
	               |	&втТовары КАК втТовары
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Склад,
	               |	Качество
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РезервыТоваровОстатки.Склад КАК Склад,
	               |	РезервыТоваровОстатки.Номенклатура КАК Номенклатура,
	               |	РезервыТоваровОстатки.Качество КАК Качество,
	               |	РезервыТоваровОстатки.КоличествоОстаток
	               |ПОМЕСТИТЬ втНашРезерв
	               |ИЗ
	               |	РегистрНакопления.РезервыТоваров.Остатки(
	               |			&КонПериода,
	               |			(Склад, Номенклатура, Качество, СтрокаЗаявки) В
	               |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |					втТовары.Склад,
	               |					втТовары.Номенклатура,
	               |					втТовары.Качество,
	               |					втТовары.СтрокаЗаявки
	               |				ИЗ
	               |					втТовары КАК втТовары)) КАК РезервыТоваровОстатки
	               |ГДЕ
	               |	РезервыТоваровОстатки.КоличествоОстаток > 0
	               |
	               |ДЛЯ ИЗМЕНЕНИЯ
	               |	РегистрНакопления.РезервыТоваров.Остатки
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Склад,
	               |	Качество
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РезервыТоваровОстатки.Склад КАК Склад,
	               |	РезервыТоваровОстатки.Номенклатура КАК Номенклатура,
	               |	РезервыТоваровОстатки.Качество КАК Качество,
	               |	РезервыТоваровОстатки.КоличествоОстаток
	               |ПОМЕСТИТЬ втРезерв
	               |ИЗ
	               |	РегистрНакопления.РезервыТоваров.Остатки(
	               |			&КонПериода,
	               |			(Склад, Номенклатура, Качество) В
	               |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |					втТовары.Склад,
	               |					втТовары.Номенклатура,
	               |					втТовары.Качество
	               |				ИЗ
	               |					втТовары КАК втТовары)) КАК РезервыТоваровОстатки
	               |ГДЕ
	               |	РезервыТоваровОстатки.КоличествоОстаток > 0
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Склад,
	               |	Качество
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТовары.Склад КАК Склад,
	               |	втТовары.Номенклатура КАК Номенклатура,
	               |	втТовары.Качество КАК Качество,
	               |	СУММА(втТовары.Количество) КАК Количество
	               |ПОМЕСТИТЬ втТоварыСвернутая
	               |ИЗ
	               |	втТовары КАК втТовары
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	втТовары.Склад,
	               |	втТовары.Номенклатура,
	               |	втТовары.Качество
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Склад,
	               |	Качество
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Склад КАК Склад,
	               |	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	               |	ТоварыНаСкладахОстатки.Качество КАК Качество,
	               |	ТоварыНаСкладахОстатки.КоличествоОстаток
	               |ПОМЕСТИТЬ втТоварыНаСкладах
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(
	               |			&КонПериода,
	               |			(Номенклатура, Склад, Качество) В
	               |				(ВЫБРАТЬ
	               |					втТоварыСвернутая.Номенклатура,
	               |					втТоварыСвернутая.Склад,
	               |					втТоварыСвернутая.Качество
	               |				ИЗ
	               |					втТоварыСвернутая)) КАК ТоварыНаСкладахОстатки
	               |ГДЕ
	               |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
	               |
	               |ДЛЯ ИЗМЕНЕНИЯ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Номенклатура,
	               |	Склад,
	               |	Качество
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втТоварыСвернутая.Склад,
	               |	втТоварыСвернутая.Номенклатура,
	               |	втТоварыСвернутая.Качество,
	               |	втТоварыСвернутая.Количество - ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(втРезерв.КоличествоОстаток, 0) - ЕСТЬNULL(втНашРезерв.КоличествоОстаток, 0) КАК Количество
	               |ИЗ
	               |	втТоварыСвернутая КАК втТоварыСвернутая
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втТоварыНаСкладах КАК ТоварыНаСкладахОстатки
	               |		ПО втТоварыСвернутая.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	               |			И втТоварыСвернутая.Склад = ТоварыНаСкладахОстатки.Склад
	               |			И втТоварыСвернутая.Качество = ТоварыНаСкладахОстатки.Качество
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втРезерв КАК втРезерв
	               |		ПО втТоварыСвернутая.Номенклатура = втРезерв.Номенклатура
	               |			И втТоварыСвернутая.Склад = втРезерв.Склад
	               |			И втТоварыСвернутая.Качество = втРезерв.Качество
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втНашРезерв КАК втНашРезерв
	               |		ПО втТоварыСвернутая.Номенклатура = втНашРезерв.Номенклатура
	               |			И втТоварыСвернутая.Склад = втНашРезерв.Склад
	               |			И втТоварыСвернутая.Качество = втНашРезерв.Качество
	               |ГДЕ
	               |	втТоварыСвернутая.Количество - ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) + ЕСТЬNULL(втРезерв.КоличествоОстаток, 0) - ЕСТЬNULL(втНашРезерв.КоличествоОстаток, 0) > 0";
					 
	
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	
	Запрос.УстановитьПараметр("КонПериода", ?(ОперативноеПроведение, Неопределено, вхСсылкаНаДокумент.МоментВремени()));
	
	Запрос.УстановитьПараметр("втТовары", втТовары);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Сообщение = "";
	Успешно = Истина;
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл 
			вхОтказ = Истина;
			Успешно = Ложь;
				//#PK83-720 Kalinin V.A. ( 2018-06-01 )
			Сообщение = Сообщение + "[КонтрольОстатков]: на складе " + Выборка.Склад + " не хватает остатка номенклатуры " +
			УправлениеЗапасами.ПредставлениеНоменклатуры(Выборка.Номенклатура,,ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Номенклатура,"Артикул")) + " с качеством " + Выборка.Качество + " в количестве " + Выборка.Количество + Символы.ПС;
			//Сообщение = Сообщение + "[КонтрольОстатков]: на складе " + Выборка.Склад + " не хватает остатка номенклатуры " + Выборка.Номенклатура + " с качеством " + Выборка.Качество + " в количестве " + Выборка.Количество + Символы.ПС;
		КонецЦикла;
	КонецЕсли;
	
	Если Не Успешно Тогда 
		#Если Клиент Тогда 
			Сообщить(Сообщение);
		#Иначе
			ВызватьИсключение Сообщение;
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗаблокироватьРегистрыТоварыНаСкладах(Знач вхСсылкаНаДокумент)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗаблокироватьРегистрыТоварыНаСкладах";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
	|	ПеремещениеТоваровТовары.Качество,
	|	ПеремещениеТоваровТовары.СтрокаЗаявки,
	|	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	|	И ПеремещениеТоваровТовары.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	|	ПеремещениеТоваровТовары.Качество,
	|	ПеремещениеТоваровТовары.СтрокаЗаявки";
	
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.РезервыТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Качество", "Качество");
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ТоварыНаСкладах");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Качество", "Качество");
	
	БлокировкаДанных.Заблокировать();

КонецПроцедуры

Процедура ЗаблокироватьРегистрРезервыНаСкладах(Знач вхСсылкаНаДокумент)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗаблокироватьРегистрРезервыНаСкладах";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
	|	ПеремещениеТоваровТовары.Качество,
	|	ПеремещениеТоваровТовары.СтрокаЗаявки,
	|	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	|	И ПеремещениеТоваровТовары.Количество > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель,
	|	ПеремещениеТоваровТовары.Качество,
	|	ПеремещениеТоваровТовары.СтрокаЗаявки";
	
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.РезервыТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Качество", "Качество");
	
	БлокировкаДанных.Заблокировать();

КонецПроцедуры

Процедура ЗаблокироватьРегистрПартииТоваров(Знач вхСсылкаНаДокумент)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗаблокироватьРегистрПартииТоваров";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
		
	БлокировкаДанных = Новый БлокировкаДанных;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка.СкладОтправитель КАК Склад,
	|	ПеремещениеТоваровТовары.Номенклатура,
	|	ПеремещениеТоваровТовары.Качество
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПеремещениеТоваровТовары.Номенклатура
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Результаты = Запрос.ВыполнитьПакет();
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ПартииТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Результаты.Получить(0);
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Склад", "Склад");
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Качество", "Качество");
	
	ЭлементБлокировки = БлокировкаДанных.Добавить("Последовательность.ПартионныйУчет");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Результаты.Получить(1);
	
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	
	БлокировкаДанных.Заблокировать();

КонецПроцедуры


Функция ПолучитьРеквизитыКонтроля(вхПараметр = Неопределено) Экспорт
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ПолучитьРеквизитыКонтроля";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	Результат = Новый Структура;
	Если (вхПараметр = Метаданные.ПланыОбмена.ОбменПартКом83_77) тогда
		Результат = ОбменДаннымиКлиентСервер.РеквизитыКонтроляПоДокументу(ПолучитьМетаданные(), ИсключаемыеРеквизитыКонтроляРегистрации());
	Иначе
		Результат.Вставить("Шапка", "Дата,Проведен");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИсключаемыеРеквизитыКонтроляРегистрации() Экспорт
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ИсключаемыеРеквизитыКонтроляРегистрации";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ИсключаемыеРеквизиты = ОбменДаннымиКлиентСервер.ИнициализироватьТаблицуИсключаемыхРеквизитовКонтроля();
	ОбменДаннымиКлиентСервер.ДобавитьВИсключаемыеРевизиты(ИсключаемыеРеквизиты, "Ссылка");
	
	Возврат ИсключаемыеРеквизиты;
	
КонецФункции

Функция ПолучитьЗначенияРеквизитовКонтроля(вхСсылкаНаОбъект, вхПараметр = Неопределено) Экспорт
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ПолучитьЗначенияРеквизитовКонтроля";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	Возврат	РаботаСПоследовательностямиКлиентСервер.ПолучитьЗначенияРеквизитовКонтроля(вхСсылкаНаОбъект, вхПараметр);
КонецФункции


//ВЫГРУЗКА ПРИ ОБМЕНЕ

Функция ВыгрузитьЭлементы(вхТаблицаСсылокНаОбъекты, вхПланОбмена) Экспорт
	
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ВыгрузитьЭлементы";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;
	///////////////////////////////////////////
	
	Результат = Новый Массив;
	
	лМетаданныеПланаОбмена = Неопределено;
	лТип = ТипЗнч(вхПланОбмена);
	Если (лТип = Тип("Строка")) тогда
		лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.Найти(вхПланОбмена);
	ИначеЕсли (лТип = Тип("ОбъектМетаданных")) И Метаданные.ПланыОбмена.Содержит(вхПланОбмена) тогда
		лМетаданныеПланаОбмена = вхПланОбмена;
	КонецЕсли;
	
	Если (лМетаданныеПланаОбмена = Неопределено) тогда
		ВызватьИсключение "[ВыгрузитьЭлементы]: неправильный параметр номер 2.";
	КонецЕсли;
	
	Если лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog Тогда 
		
		лМенеджерПланаОбмена = ПланыОбмена[лМетаданныеПланаОбмена.Имя];
		
		лЗапрос = Новый Запрос;
		лЗапрос.УстановитьПараметр("ТаблицаСсылок", вхТаблицаСсылокНаОбъекты);
		лЗапрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		лЗапрос.УстановитьПараметр("ПустаяЗаявка", Документы.ЗаявкаПокупателя.ПустаяСсылка());
		лЗапрос.УстановитьПараметр("ТипЦен", Константы.ТипЦен_дляСайта.Получить());
		лЗапрос.Текст = 
		"ВЫБРАТЬ
		|	Т.Ссылка
		|ПОМЕСТИТЬ Объекты
		|ИЗ
		|	&ТаблицаСсылок КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка КАК Ссылка,
		|	ПеремещениеТоваров.Ссылка.ВидОперации КАК ВидОперации,
		|	ПеремещениеТоваров.Номер,
		|	ПеремещениеТоваров.Дата,
		|	ПеремещениеТоваров.СкладОтправитель.ФизическийСклад КАК Склад,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваров.АктРассмотренияВозврата <> ЗНАЧЕНИЕ(Документ.АктРассмотренияВозврата.ПустаяСсылка)
		|				И ПеремещениеТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)
		|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог_Возвраты.ОсновнаяТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка))
		|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог.ОсновнаяТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка))
		|	КОНЕЦ КАК Контрагент,
		|	ПеремещениеТоваров.Организация КАК Организация,
		|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
		|	ПеремещениеТоваровТовары.Номенклатура.Наименование,
		|	ПеремещениеТоваровТовары.Номенклатура.Артикул,
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.IDSite, """") КАК SSID,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваровТовары.СтрокаЗаявки.ПрайсПоставщика.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК КроссСток,
		|	СУММА(ПеремещениеТоваровТовары.КоличествоПлан) КАК Количество,
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка.ТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка)) КАК Клиент,
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка.ТорговаяТочка.Наименование, """") КАК КлиентНаименование,
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка.Контрагент.ЮрФизЛицо.Порядок, 0) = 0 КАК ЭтоЮридическоеЛицо,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваров.АктРассмотренияВозврата <> ЗНАЧЕНИЕ(Документ.АктРассмотренияВозврата.ПустаяСсылка)
		|				И ПеремещениеТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)
		|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог_Возвраты.ОсновнаяТорговаяТочка.Город, ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка))
		|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог.ОсновнаяТорговаяТочка.Город, ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка))
		|	КОНЕЦ КАК Город,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваров.АктРассмотренияВозврата <> ЗНАЧЕНИЕ(Документ.АктРассмотренияВозврата.ПустаяСсылка)
		|				И ПеремещениеТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)
		|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог_Возвраты.ОсновнаяТорговаяТочка.Город.Наименование, """")
		|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог.ОсновнаяТорговаяТочка.Город.Наименование, """")
		|	КОНЕЦ КАК ГородНаименование,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваров.АктРассмотренияВозврата <> ЗНАЧЕНИЕ(Документ.АктРассмотренияВозврата.ПустаяСсылка)
		|				И ПеремещениеТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)
		|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог_Возвраты.ОсновнаяТорговаяТочка.МаршрутДоставки.Код, """")
		|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог.ОсновнаяТорговаяТочка.МаршрутДоставки.Код, """")
		|	КОНЕЦ КАК МаршрутДоставкиКод,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваров.АктРассмотренияВозврата <> ЗНАЧЕНИЕ(Документ.АктРассмотренияВозврата.ПустаяСсылка)
		|				И ПеремещениеТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)
		|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог_Возвраты.ОсновнаяТорговаяТочка.МаршрутДоставки.Наименование, """")
		|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог.ОсновнаяТорговаяТочка.МаршрутДоставки.Наименование, """")
		|	КОНЕЦ КАК МаршрутДоставкиНаименование,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваров.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА КОНЕЦПЕРИОДА(&ТекущаяДата, ГОД)
		|		ИНАЧЕ ПеремещениеТоваров.ДатаОтгрузки
		|	КОНЕЦ КАК ДатаОтгрузки,
		|	ПеремещениеТоваров.СкладПолучатель КАК СкладПолучатель,
		|	ПеремещениеТоваров.ВыгруженВТопЛог
		|ПОМЕСТИТЬ втЗаказНаОтгрузку
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|		ПО ПеремещениеТоваровТовары.Ссылка = ПеремещениеТоваров.Ссылка
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка В
		|			(ВЫБРАТЬ
		|				Объекты.Ссылка
		|			ИЗ
		|				Объекты)
		|	И ПеремещениеТоваровТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				Объекты.Ссылка
		|			ИЗ
		|				Объекты)
		|	И ПеремещениеТоваров.СкладОтправитель.ОбменСTopLog
		|	И ПеремещениеТоваровТовары.Ссылка.СкладОтправитель.ОбменСTopLog
		|	И НЕ ПеремещениеТоваров.флНеВыгружатьВТопЛог
		|	И НЕ ПеремещениеТоваровТовары.Ссылка.флНеВыгружатьВТопЛог
		|	И ПеремещениеТоваровТовары.КоличествоПлан > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка.Контрагент.ЮрФизЛицо.Порядок, 0) = 0,
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка.ТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка)),
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.IDSite, """"),
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка.ТорговаяТочка.Наименование, """"),
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваров.Ссылка,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваровТовары.СтрокаЗаявки.ПрайсПоставщика.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ,
		|	ПеремещениеТоваров.Ссылка.ВидОперации,
		|	ПеремещениеТоваров.Номер,
		|	ПеремещениеТоваров.Дата,
		|	ПеремещениеТоваров.СкладОтправитель.ФизическийСклад,
		|	ПеремещениеТоваров.Организация,
		|	ПеремещениеТоваровТовары.Номенклатура.Наименование,
		|	ПеремещениеТоваровТовары.Номенклатура.Артикул,
		|	ПеремещениеТоваров.СкладПолучатель,
		|	ПеремещениеТоваров.ВыгруженВТопЛог,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваров.АктРассмотренияВозврата <> ЗНАЧЕНИЕ(Документ.АктРассмотренияВозврата.ПустаяСсылка)
		|				И ПеремещениеТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)
		|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог_Возвраты.ОсновнаяТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка))
		|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог.ОсновнаяТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка))
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваров.АктРассмотренияВозврата <> ЗНАЧЕНИЕ(Документ.АктРассмотренияВозврата.ПустаяСсылка)
		|				И ПеремещениеТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)
		|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог_Возвраты.ОсновнаяТорговаяТочка.Город, ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка))
		|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог.ОсновнаяТорговаяТочка.Город, ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка))
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваров.АктРассмотренияВозврата <> ЗНАЧЕНИЕ(Документ.АктРассмотренияВозврата.ПустаяСсылка)
		|				И ПеремещениеТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)
		|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог_Возвраты.ОсновнаяТорговаяТочка.Город.Наименование, """")
		|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог.ОсновнаяТорговаяТочка.Город.Наименование, """")
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваров.АктРассмотренияВозврата <> ЗНАЧЕНИЕ(Документ.АктРассмотренияВозврата.ПустаяСсылка)
		|				И ПеремещениеТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)
		|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог_Возвраты.ОсновнаяТорговаяТочка.МаршрутДоставки.Код, """")
		|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог.ОсновнаяТорговаяТочка.МаршрутДоставки.Код, """")
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваров.АктРассмотренияВозврата <> ЗНАЧЕНИЕ(Документ.АктРассмотренияВозврата.ПустаяСсылка)
		|				И ПеремещениеТоваров.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.НаСкладВозвратаПоставщику)
		|			ТОГДА ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог_Возвраты.ОсновнаяТорговаяТочка.МаршрутДоставки.Наименование, """")
		|		ИНАЧЕ ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.КонтрагентТопЛог.ОсновнаяТорговаяТочка.МаршрутДоставки.Наименование, """")
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ПеремещениеТоваров.ДатаОтгрузки = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА КОНЕЦПЕРИОДА(&ТекущаяДата, ГОД)
		|		ИНАЧЕ ПеремещениеТоваров.ДатаОтгрузки
		|	КОНЕЦ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена
		|ПОМЕСТИТЬ втЦены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			ТипЦен = &ТипЦен
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						втЗаказНаОтгрузку.Номенклатура
		|					ИЗ
		|						втЗаказНаОтгрузку)) КАК ЦеныНоменклатурыСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втЗаказНаОтгрузку.Ссылка КАК Ссылка,
		|	втЗаказНаОтгрузку.ВидОперации КАК ВидОперации,
		|	втЗаказНаОтгрузку.Номер КАК Номер,
		|	втЗаказНаОтгрузку.Дата КАК Дата,
		|	втЗаказНаОтгрузку.Склад КАК Склад,
		|	втЗаказНаОтгрузку.Контрагент КАК Контрагент,
		|	втЗаказНаОтгрузку.Организация КАК Организация,
		|	втЗаказНаОтгрузку.Номенклатура,
		|	втЗаказНаОтгрузку.НоменклатураНаименование,
		|	втЗаказНаОтгрузку.НоменклатураАртикул,
		|	втЗаказНаОтгрузку.SSID,
		|	втЗаказНаОтгрузку.КроссСток,
		|	втЗаказНаОтгрузку.Количество,
		|	втЗаказНаОтгрузку.Клиент,
		|	втЗаказНаОтгрузку.КлиентНаименование,
		|	втЗаказНаОтгрузку.ЭтоЮридическоеЛицо,
		|	втЗаказНаОтгрузку.Город КАК Город,
		|	втЗаказНаОтгрузку.ГородНаименование КАК ГородНаименование,
		|	втЗаказНаОтгрузку.МаршрутДоставкиКод КАК МаршрутДоставкиКод,
		|	втЗаказНаОтгрузку.МаршрутДоставкиНаименование КАК МаршрутДоставкиНаименование,
		|	втЗаказНаОтгрузку.ДатаОтгрузки КАК ДатаОтгрузки,
		|	втЗаказНаОтгрузку.СкладПолучатель КАК СкладПолучатель,
		|	втЗаказНаОтгрузку.ВыгруженВТопЛог КАК ВыгруженВТопЛог,
		|	ЕСТЬNULL(втЦены.Цена, 0) * 1.1 КАК Цена
		|ИЗ
		|	втЗаказНаОтгрузку КАК втЗаказНаОтгрузку
		|		ЛЕВОЕ СОЕДИНЕНИЕ втЦены КАК втЦены
		|		ПО втЗаказНаОтгрузку.Номенклатура = втЦены.Номенклатура
		|ИТОГИ
		|	МАКСИМУМ(ВидОперации),
		|	МАКСИМУМ(Номер),
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(Склад),
		|	МАКСИМУМ(Контрагент),
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(Город),
		|	МАКСИМУМ(ГородНаименование),
		|	МАКСИМУМ(МаршрутДоставкиКод),
		|	МАКСИМУМ(МаршрутДоставкиНаименование),
		|	МАКСИМУМ(ДатаОтгрузки),
		|	МАКСИМУМ(СкладПолучатель),
		|	МАКСИМУМ(ВыгруженВТопЛог)
		|ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка КАК Ссылка,
		|	ПеремещениеТоваров.Номер,
		|	ПеремещениеТоваров.Дата,
		|	ПеремещениеТоваров.СкладПолучатель.ФизическийСклад КАК Склад,
		|	ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.ФизическийСклад.КонтрагентТопЛог.ОсновнаяТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка)) КАК Контрагент,
		|	ПеремещениеТоваров.Организация КАК Организация,
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ПеремещениеТоваровТовары.Номенклатура.Наименование,
		|	ПеремещениеТоваровТовары.Номенклатура.Артикул,
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.IDSite, """") КАК SSID,
		|	СУММА(ПеремещениеТоваровТовары.КоличествоПлан) КАК Количество,
		|	ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.ФизическийСклад.КонтрагентТопЛог.ОсновнаяТорговаяТочка.Город, ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка)) КАК Город,
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка.ТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка)) КАК Клиент,
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка КАК Виртуальная,
		|	ПеремещениеТоваров.ВыгруженВТопЛог
		|ИЗ
		|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|		ПО ПеремещениеТоваровТовары.Ссылка = ПеремещениеТоваров.Ссылка
		|ГДЕ
		|	ПеремещениеТоваров.Ссылка В
		|			(ВЫБРАТЬ
		|				Объекты.Ссылка
		|			ИЗ
		|				Объекты)
		|	И ПеремещениеТоваровТовары.Ссылка В
		|			(ВЫБРАТЬ
		|				Объекты.Ссылка
		|			ИЗ
		|				Объекты)
		|	И ПеремещениеТоваров.СкладПолучатель.ОбменСTopLog
		|	И ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.ОбменСTopLog
		|	И НЕ ПеремещениеТоваров.флНеВыгружатьВТопЛог
		|	И НЕ ПеремещениеТоваровТовары.Ссылка.флНеВыгружатьВТопЛог
		|	И ПеремещениеТоваровТовары.КоличествоПлан > 0
		|	И НЕ ПеремещениеТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу)
		|	И ПеремещениеТоваров.СкладОтправитель.ФизическийСклад <> ПеремещениеТоваров.СкладПолучатель.ФизическийСклад
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеТоваров.Ссылка,
		|	ПеремещениеТоваровТовары.Номенклатура,
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.IDSite, """"),
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка.ТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка)),
		|	ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка,
		|	ПеремещениеТоваров.Номер,
		|	ПеремещениеТоваров.Дата,
		|	ПеремещениеТоваров.СкладПолучатель.ФизическийСклад,
		|	ПеремещениеТоваров.Организация,
		|	ПеремещениеТоваровТовары.Номенклатура.Наименование,
		|	ПеремещениеТоваровТовары.Номенклатура.Артикул,
		|	ПеремещениеТоваров.ВыгруженВТопЛог,
		|	ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.ФизическийСклад.КонтрагентТопЛог.ОсновнаяТорговаяТочка, ЗНАЧЕНИЕ(Справочник.ТорговыеТочки.ПустаяСсылка)),
		|	ЕСТЬNULL(ПеремещениеТоваров.СкладПолучатель.ФизическийСклад.КонтрагентТопЛог.ОсновнаяТорговаяТочка.Город, ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка))
		|ИТОГИ ПО
		|	Ссылка";
		
		лРезультатыЗапроса = лЗапрос.ВыполнитьПакет();
		ИндексЗаказыНаОтгрузку = лРезультатыЗапроса.ВГраница() - 1;
		ИндексЗаказыНаПриемку = лРезультатыЗапроса.ВГраница();
		
		Если НЕ лРезультатыЗапроса[ИндексЗаказыНаОтгрузку].Пустой() Тогда
			лТипОбъектаXDTO = ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ЗаказНаОтгрузку");
			лВыборка = лРезультатыЗапроса[ИндексЗаказыНаОтгрузку].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
			
			Пока лВыборка.Следующий() Цикл
				ЗаполнитьСтрокиЗаявок(лВыборка.Ссылка);
				лОбъект = ФабрикаXDTO.Создать(лТипОбъектаXDTO);
				
				ЗаполнитьЗначенияСвойств(лОбъект, лВыборка, "Номер,Дата,ДатаОтгрузки");
				лОбъект.СуммаДокумента = 0;
				Если лВыборка.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу Тогда
					лОбъект.ВидДокумента = "ВозвратВПродажу";
				Иначе
					лОбъект.ВидДокумента = "ПеремещениеТоваров";
				КонецЕсли;
				лОбъект.Ссылка = XMLСтрока(лВыборка.Ссылка);
				лОбъект.СкладСсылка = XMLСтрока(лВыборка.Склад);
				лОбъект.КонтрагентСсылка = XMLСтрока(лВыборка.Контрагент);
				лОбъект.ОрганизацияСсылка = XMLСтрока(лВыборка.Организация);
				лОбъект.ТипДоставки = "";
				лОбъект.ДокументОснованиеСсылка = "";
				лОбъект.СкладПолучательСсылка = XMLСтрока(лВыборка.СкладПолучатель);
				лОбъект.МаршрутДоставкиКод = лВыборка.МаршрутДоставкиКод;
				
				ОбменДаннымиКлиентСервер.ДополнитьДаннымиПоПечати(лОбъект, лВыборка.Ссылка);
				
				лТовары = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ЗаказНаОтгрузку.Товары"));
				лТоварыСписок = лТовары.ПолучитьСписок("СтрокаТовары");
				
				ВыборкаПоТоварам = лВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПоТоварам.Следующий() Цикл
					НоваяСтрока = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), лТоварыСписок.ВладеющееСвойство.Тип.Имя)); 
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоТоварам, "НоменклатураНаименование,НоменклатураАртикул,SSID,КроссСток,Количество,КлиентНаименование,ЭтоЮридическоеЛицо");
					НоваяСтрока.НоменклатураСсылка = XMLСтрока(ВыборкаПоТоварам.Номенклатура);
					НоваяСтрока.КлиентСсылка = XMLСтрока(ВыборкаПоТоварам.Клиент);
					//НоваяСтрока.ГородСсылка = XMLСтрока(ВыборкаПоТоварам.Город);
					//НоваяСтрока.МаршрутДоставкиСсылка = XMLСтрока(ВыборкаПоТоварам.МаршрутДоставки);
					НоваяСтрока.Цена = Окр(ВыборкаПоТоварам.Цена, 2);
					НоваяСтрока.ГТД = "";
					НоваяСтрока.СтранаКод = "";
					НоваяСтрока.СтранаНаименование = "";
					лТоварыСписок.Добавить(НоваяСтрока);

				КонецЦикла;	
				
				лОбъект.Товары = лТовары;
				Результат.Добавить(лОбъект);
				//Семенов И.П. 11.02.2019 XX-1768(
				ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(лВыборка.Ссылка, лОбъект, УправлениеСвойствамиПовтИсп.ЗаказНаОтгрузку());
				//)Семенов И.П.
				// Помечаем объект как выгруженный
				Если Не лВыборка.ВыгруженВТопЛог Тогда 
					ДокОб = лВыборка.Ссылка.ПолучитьОбъект();
					ДокОб.ВыгруженВТопЛог = Истина;
					ДокОб.ДополнительныеСвойства.Вставить("НеРегистрироватьВОбменСТоплог");
					ДокОб.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Не лРезультатыЗапроса[ИндексЗаказыНаПриемку].Пустой() Тогда 
			
			лТипОбъектаXDTO = ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ЗаказНаПриемку");
			лВыборка = лРезультатыЗапроса[ИндексЗаказыНаПриемку].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ссылка");
			Пока лВыборка.Следующий() Цикл
				ЗаполнитьСтрокиЗаявок(лВыборка.Ссылка);
				лОбъект = ФабрикаXDTO.Создать(лТипОбъектаXDTO);
				
				ЗаполнитьЗначенияСвойств(лОбъект, лВыборка, "Номер,Дата");
				лОбъект.СуммаДокумента = 0;
				лОбъект.ВидДокумента = "ПеремещениеТоваров";
				лОбъект.Ссылка = XMLСтрока(лВыборка.Ссылка);
				лОбъект.СкладСсылка = XMLСтрока(лВыборка.Склад);
				лОбъект.КонтрагентСсылка = XMLСтрока(лВыборка.Контрагент);
				лОбъект.ОрганизацияСсылка = XMLСтрока(лВыборка.Организация);
				лОбъект.НомерВходящегоДокумента = "";
				лОбъект.ДатаВходящегоДокумента = Дата(1,1,1);
				
				лТовары = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), "Документы.ЗаказНаПриемку.Товары"));
				лТоварыСписок = лТовары.ПолучитьСписок("СтрокаТовары");
				
				ВыборкаПоТоварам = лВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				ТТПополнениеСклада = Неопределено;
				Пока ВыборкаПоТоварам.Следующий() Цикл
					НоваяСтрока = ФабрикаXDTO.Создать(ФабрикаXDTO.Тип(лМенеджерПланаОбмена.URIПространстваИмен(), лТоварыСписок.ВладеющееСвойство.Тип.Имя)); 
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПоТоварам, "НоменклатураНаименование,НоменклатураАртикул,SSID,Количество");
					
					НоваяСтрока.НоменклатураСсылка = XMLСтрока(ВыборкаПоТоварам.Номенклатура);
					Если  ВыборкаПоТоварам.Виртуальная Тогда 
						Если ТТПополнениеСклада = Неопределено Тогда 
							ТТПополнениеСклада = ОбщегоНазначения.ПолучитьТТПополнениеСклада(лВыборка.Ссылка);
						КонецЕсли;
						НоваяСтрока.КлиентСсылка = XMLСтрока(ТТПополнениеСклада);
					Иначе	
						НоваяСтрока.КлиентСсылка = XMLСтрока(ВыборкаПоТоварам.Клиент);
					КонецЕсли;
					НоваяСтрока.ГородСсылка = XMLСтрока(ВыборкаПоТоварам.Город);
					НоваяСтрока.Цена = 0;
					НоваяСтрока.СкладПолучательСсылка = XMLСтрока(Справочники.Склады.ПустаяСсылка());
					НоваяСтрока.ГТД = "";
					лТоварыСписок.Добавить(НоваяСтрока);

				КонецЦикла;	
				
				лОбъект.НомерВходящегоСФ = "";
				лОбъект.ДатаВходящегоСФ = Дата(1,1,1);
				лОбъект.Товары = лТовары;
				Результат.Добавить(лОбъект);
				//Семенов И.П. 11.02.2019 XX-1768(
				ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(лВыборка.Ссылка, лОбъект, УправлениеСвойствамиПовтИсп.ЗаказНаПриемку());
				//)Семенов И.П.
				// Помечаем объект как выгруженный
				Если Не лВыборка.ВыгруженВТопЛог Тогда 
					ДокОб = лВыборка.Ссылка.ПолучитьОбъект();
					ДокОб.ВыгруженВТопЛог = Истина;
					ДокОб.ДополнительныеСвойства.Вставить("НеРегистрироватьВОбменСТоплог");
					ДокОб.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗагрузитьЭлемент(ОбъектXDTO, вхОтправитель, Отказ, вхПараметры = Неопределено, СтруктураОтчета = Неопределено) Экспорт
	
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗагрузитьЭлемент";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////
		
	лМетаданныеПланаОбмена = Метаданные.НайтиПоТипу(ТипЗнч(вхОтправитель));
	Если (лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog
		Или лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog_РТУ) Тогда 
			НомерПотока = ?(лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_TopLog, 0, 1);
		Если ОбъектXDTO.Тип().Имя = "РезультатРазмещения" Тогда  
			Попытка
				РазмещениеСсылкаТопЛог = Новый УникальныйИдентификатор(ОбъектXDTO.РазмещениеСсылка);
				Заказы = ОбъектXDTO.Заказы.ПолучитьСписок("СтрокаЗаказы");
				
				ТаблицаСсылок = Новый ТаблицаЗначений;
				ТаблицаСсылок.Колонки.Добавить("Документ", Документы.ТипВсеСсылки());
				ТаблицаСсылок.Колонки.Добавить("Склад", Новый ОписаниеТипов("СправочникСсылка.Склады"));
				
				//Размещение по возвратам
				Документы.РазмещениеТоваров.ЗагрузитьЭлемент(ОбъектXDTO, вхОтправитель, Отказ, вхПараметры, СтруктураОтчета);
				
				Успешно = Истина;
				
				Для Каждого ЗаказНаПриемкуXDTO Из Заказы Цикл 
					Попытка
						ЗагрузитьРезультатРазмещения(РазмещениеСсылкаТопЛог, ЗаказНаПриемкуXDTO, ОбъектXDTO, ТаблицаСсылок, Успешно, вхПараметры, СтруктураОтчета);
						СтруктураОшибки = Новый Структура;
						СтруктураОшибки.Вставить("ОбъектXDTO", ОбъектXDTO.Тип().Имя);
						СтруктураОшибки.Вставить("GUID", ОбъектXDTO.РазмещениеСсылка);
						СтруктураОшибки.Вставить("GUIDДоп", ЗаказНаПриемкуXDTO.ЗаказСсылка);
						СтруктураОшибки.Вставить("ИмяОбъектаМетаданных", "ПеремещениеТоваров");
						ОбменДаннымиКлиентСервер.ОчиститьОшибкиПриОбменеСТопЛог(СтруктураОшибки);
					Исключение
						СтруктураОшибки = Новый Структура;
						СтруктураОшибки.Вставить("ОбъектXDTO", ОбъектXDTO.Тип().Имя);
						СтруктураОшибки.Вставить("GUID", ОбъектXDTO.РазмещениеСсылка);
						СтруктураОшибки.Вставить("GUIDДоп", ЗаказНаПриемкуXDTO.ЗаказСсылка);
						СтруктураОшибки.Вставить("ИмяОбъектаМетаданных", "ПеремещениеТоваров");
						СтруктураОшибки.Вставить("СообщениеОбОшибке", ОписаниеОшибки());
						СтруктураОшибки.Вставить("НомерСообщения", вхПараметры.НомерСообщения);
						СтруктураОшибки.Вставить("ДатаЗагрузкиСообщения", ТекущаяДата());
						СтруктураОшибки.Вставить("НомерПотока", НомерПотока);
						ОбменДаннымиКлиентСервер.ЗаписатьОшибкиПриОбменеСТопЛог(СтруктураОшибки);
						
						Запрос = Новый Запрос;
						Запрос.Текст = "ВЫБРАТЬ
						               |	ПеремещениеТоваров.Ссылка
						               |ИЗ
						               |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
						               |ГДЕ
						               |	ПеремещениеТоваров.РазмещениеСсылкаТопЛог = &РазмещениеСсылкаТопЛог
						               |	И ПеремещениеТоваров.ДокументОснование = &ДокументОснование";
						Запрос.УстановитьПараметр("РазмещениеСсылкаТопЛог", РазмещениеСсылкаТопЛог);
							
						Если ЗаказНаПриемкуXDTO.ЗаказВидДокумента = "ПоступлениеТоваровУслуг" Тогда 
							Если ЗначениеЗаполнено(ЗаказНаПриемкуXDTO.ЗаказСсылка) Тогда 
								ДокументОснование = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ЗаказНаПриемкуXDTO.ЗаказСсылка));
							Иначе
								ДокументОснование = Документы.ПоступлениеТоваровУслуг.НайтиПоНомеру(ОбщегоНазначения.ПреобразоватьНомер(ЗаказНаПриемкуXDTO.ЗаказНомер), ТекущаяДата());
							КонецЕсли;
						Иначе
							Если ЗначениеЗаполнено(ЗаказНаПриемкуXDTO.ЗаказСсылка) Тогда 
								ДокументОснование = Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ЗаказНаПриемкуXDTO.ЗаказСсылка));
							Иначе
								ДокументОснование = Документы.ПеремещениеТоваров.НайтиПоНомеру(ОбщегоНазначения.ПреобразоватьНомер(ЗаказНаПриемкуXDTO.ЗаказНомер), ТекущаяДата());
							КонецЕсли;
						КонецЕсли;

						Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
						Выборка = Запрос.Выполнить().Выбрать();
						Пока Выборка.Следующий() Цикл 
							РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(Выборка.Ссылка, вхПараметры.НомерСообщения, Истина, "Ошибка загрузки: "+ОписаниеОшибки(), , Ложь, НомерПотока); 
							#Если Сервер Тогда
								ОбменСТопЛогСервер.ОбработатьДействияНадОбъектом(вхПараметры, Выборка.Ссылка, ОписаниеОшибки(), "ЗагрузитьРезультатРазмещения");
							#КонецЕсли
						КонецЦикла;
						
					КонецПопытки;
				КонецЦикла;
				//Распроводим перемещения, не попавшие в сообщения
				Если Успешно Тогда 
					Запрос = Новый Запрос;
					Запрос.Текст =  "ВЫБРАТЬ
					                |	ТаблицаСсылок.Документ,
					                |	ТаблицаСсылок.Склад
					                |ПОМЕСТИТЬ ТаблицаСсылок
					                |ИЗ
					                |	&ТаблицаСсылок КАК ТаблицаСсылок
					                |;
					                |
					                |////////////////////////////////////////////////////////////////////////////////
					                |ВЫБРАТЬ
					                |	ПеремещениеТоваров.Ссылка,
					                |	ПеремещениеТоваров.Проведен
					                |ИЗ
					                |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
					                |		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаСсылок КАК ТаблицаСсылок
					                |		ПО ПеремещениеТоваров.ДокументОснование = ТаблицаСсылок.Документ
					                |			И ПеремещениеТоваров.СкладПолучатель = ТаблицаСсылок.Склад
					                |ГДЕ
					                |	НЕ ПеремещениеТоваров.ПометкаУдаления
					                |	И ПеремещениеТоваров.РазмещениеСсылкаТопЛог = &РазмещениеСсылкаТопЛог
					                |	И ТаблицаСсылок.Документ ЕСТЬ NULL";
					Запрос.УстановитьПараметр("РазмещениеСсылкаТопЛог", РазмещениеСсылкаТопЛог);
					Запрос.УстановитьПараметр("ТаблицаСсылок", ТаблицаСсылок);
					Выборка = Запрос.Выполнить().Выбрать();
					//Семенов И.П. 21.05.2019 XX-2503(
					Событие = Справочники.СобытияДляОтправкиЭлектронныхПисем.КонтрольРасформированияПеремещений;
					//)Семенов И.П.
					Пока Выборка.Следующий() Цикл 
						ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
						ДокОбъект.ПометкаУдаления = Истина;
						
						ДокОбъект.Комментарий = "помечено на удаление ТопЛогом";
						Если ДокОбъект.Проведен Тогда 
							ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
						Иначе
							ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
						КонецЕсли;
						//Семенов И.П. 21.05.2019 XX-2503(
						КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(Выборка.Ссылка, 
														Событие,
														"Документ "+ДокОбъект+" помечен на удаление по данным ТопЛога (Расформирован).",
														, 
														Истина);
						//)Семенов И.П.
					КонецЦикла;
				КонецЕсли;
				
			Исключение
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("ОбъектXDTO", ОбъектXDTO.Тип().Имя);
				СтруктураОшибки.Вставить("GUID", ОбъектXDTO.РазмещениеСсылка);
				СтруктураОшибки.Вставить("ИмяОбъектаМетаданных", "ПеремещениеТоваров");
				СтруктураОшибки.Вставить("СообщениеОбОшибке", ОписаниеОшибки());
				СтруктураОшибки.Вставить("НомерСообщения", вхПараметры.НомерСообщения);
				СтруктураОшибки.Вставить("ДатаЗагрузкиСообщения", ТекущаяДата());
				СтруктураОшибки.Вставить("НомерПотока", НомерПотока);
				ОбменДаннымиКлиентСервер.ЗаписатьОшибкиПриОбменеСТопЛог(СтруктураОшибки);
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ПеремещениеТоваров.Ссылка
				|ИЗ
				|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
				|ГДЕ
				|	ПеремещениеТоваров.РазмещениеСсылкаТопЛог = &УИДРазмещения
				|
				| Объединить все
				|
				|ВЫБРАТЬ
				|	РазмещениеТоваров.Ссылка
				|ИЗ
				|	Документ.РазмещениеТоваров КАК РазмещениеТоваров
				|ГДЕ
				|	РазмещениеТоваров.Ссылка = &РазмещениеТоваровСсылка";
				
				УИДРазмещения = Новый УникальныйИдентификатор(ОбъектXDTO.РазмещениеСсылка);
				Запрос.УстановитьПараметр("УИДРазмещения", УИДРазмещения);
				Запрос.УстановитьПараметр("РазмещениеТоваровСсылка", Документы.РазмещениеТоваров.ПолучитьСсылку(УИДРазмещения));
				
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл 
					РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(Выборка.Ссылка, вхПараметры.НомерСообщения, Истина, "Ошибка загрузки: "+ОписаниеОшибки(), , Ложь, НомерПотока); 
				КонецЦикла;
				РазмещениеТоваровСсылка = Документы.РазмещениеТоваров.ПолучитьСсылку(УИДРазмещения);
				//Семенов И.П. 12.02.2019 XX-1768(
				ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(РазмещениеТоваровСсылка, ОбъектXDTO,,Истина,ОписаниеОшибки());
				//)Семенов И.П.

				// 25.03.19 Строганов Роман > 
				ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, РазмещениеТоваровСсылка, Истина, Истина, ОписаниеОшибки());
				// 25.03.19 Строганов Роман <
			КонецПопытки;
		ИначеЕсли ОбъектXDTO.Тип().Имя = "РезультатСборки" Тогда  
			Попытка
				
				#Если Сервер Тогда
					ОбменСТопЛогСервер.ИницилизироватьДействияНадОбъектом(вхПараметры);
				#КонецЕсли

				ЗагрузитьРезультатСборки(ОбъектXDTO, вхПараметры, СтруктураОтчета);
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("ОбъектXDTO", ОбъектXDTO.Тип().Имя);
				СтруктураОшибки.Вставить("GUID", ОбъектXDTO.ЗаказСсылка);
				СтруктураОшибки.Вставить("ИмяОбъектаМетаданных", "ПеремещениеТоваров");
				ОбменДаннымиКлиентСервер.ОчиститьОшибкиПриОбменеСТопЛог(СтруктураОшибки);
			Исключение
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("ОбъектXDTO", ОбъектXDTO.Тип().Имя);
				СтруктураОшибки.Вставить("GUID", ОбъектXDTO.ЗаказСсылка);
				СтруктураОшибки.Вставить("ИмяОбъектаМетаданных", "ПеремещениеТоваров");
				СтруктураОшибки.Вставить("СообщениеОбОшибке", ОписаниеОшибки());
				СтруктураОшибки.Вставить("НомерСообщения", вхПараметры.НомерСообщения);
				СтруктураОшибки.Вставить("ДатаЗагрузкиСообщения", ТекущаяДата());
				СтруктураОшибки.Вставить("НомерПотока", НомерПотока);
				ОбменДаннымиКлиентСервер.ЗаписатьОшибкиПриОбменеСТопЛог(СтруктураОшибки);
				
				Если ЗначениеЗаполнено(ОбъектXDTO.ЗаказСсылка) Тогда 
					ДокСсылка = Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗаказСсылка));
				Иначе
					ДокСсылка = Документы.ПеремещениеТоваров.НайтиПоНомеру(ОбщегоНазначения.ПреобразоватьНомер(ОбъектXDTO.ЗаказНомер), ТекущаяДата());
				КонецЕсли;
				РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(ДокСсылка, вхПараметры.НомерСообщения, Истина, "Ошибка загрузки: "+ОписаниеОшибки(), , Ложь, НомерПотока); 
				//Семенов И.П. 12.02.2019 XX-1768(
				ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокСсылка, ОбъектXDTO,, Истина, ОписаниеОшибки()); 
				//)Семенов И.П.
				
				// 25.03.19 Строганов Роман > 
				ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокСсылка, Истина, Истина, ОписаниеОшибки());
				// 25.03.19 Строганов Роман <
				
				#Если Сервер Тогда
					ОбменСТопЛогСервер.ОбработатьДействияНадОбъектом(вхПараметры, ДокСсылка, ОписаниеОшибки(), "ЗагрузитьРезультатСборки");
				#КонецЕсли
				
			КонецПопытки;
		ИначеЕсли ОбъектXDTO.Тип().Имя = "РезультатПриемки" Тогда  	
			Попытка
				#Если Сервер Тогда
					ОбменСТопЛогСервер.ИницилизироватьДействияНадОбъектом(вхПараметры);
				#КонецЕсли
				
				ЗагрузитьРезультатПриемки(ОбъектXDTO, вхПараметры, СтруктураОтчета);
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("ОбъектXDTO", ОбъектXDTO.Тип().Имя);
				СтруктураОшибки.Вставить("GUID", ОбъектXDTO.ЗаказСсылка);
				СтруктураОшибки.Вставить("ИмяОбъектаМетаданных", "ПеремещениеТоваров");
				ОбменДаннымиКлиентСервер.ОчиститьОшибкиПриОбменеСТопЛог(СтруктураОшибки);
			Исключение
				СтруктураОшибки = Новый Структура;
				СтруктураОшибки.Вставить("ОбъектXDTO", ОбъектXDTO.Тип().Имя);
				СтруктураОшибки.Вставить("GUID", ОбъектXDTO.ЗаказСсылка);
				СтруктураОшибки.Вставить("ИмяОбъектаМетаданных", "ПеремещениеТоваров");
				СтруктураОшибки.Вставить("СообщениеОбОшибке", ОписаниеОшибки());
				СтруктураОшибки.Вставить("НомерСообщения", вхПараметры.НомерСообщения);
				СтруктураОшибки.Вставить("ДатаЗагрузкиСообщения", ТекущаяДата());
				СтруктураОшибки.Вставить("НомерПотока", НомерПотока);
				ОбменДаннымиКлиентСервер.ЗаписатьОшибкиПриОбменеСТопЛог(СтруктураОшибки);
				
				Если ЗначениеЗаполнено(ОбъектXDTO.ЗаказСсылка) Тогда 
					ДокСсылка = Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗаказСсылка));
				Иначе
					ДокСсылка = Документы.ПеремещениеТоваров.НайтиПоНомеру(ОбщегоНазначения.ПреобразоватьНомер(ОбъектXDTO.ЗаказНомер), ТекущаяДата());
				КонецЕсли;
				РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(ДокСсылка, вхПараметры.НомерСообщения, Истина, "Ошибка загрузки: "+ОписаниеОшибки(), , Ложь, НомерПотока);
				//Семенов И.П. 12.02.2019 XX-1768(
				ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокСсылка, ОбъектXDTO,, Истина, ОписаниеОшибки()); 
				//)Семенов И.П.
				
				// 25.03.19 Строганов Роман > 
				ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокСсылка, Истина, Истина, ОписаниеОшибки());
				// 25.03.19 Строганов Роман <
				
				#Если Сервер Тогда
					ОбменСТопЛогСервер.ОбработатьДействияНадОбъектом(вхПараметры, ДокСсылка, ОписаниеОшибки(), "ЗагрузитьРезультатПриемки");
				#КонецЕсли

			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьПоступление(вхСсылкаНаДокумент, Проведение = Истина)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ОбновитьПоступление";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	ДокументОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(вхСсылкаНаДокумент, "ДокументОснование");
	
	Если Не (ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")) Тогда 
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ОтложенноеИзменениеОбъектовТопЛог.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(ДокументОснование);
	НаборЗаписей.Отбор.ОбновитьОтказыВЗаявке.Установить(Ложь);
	НаборЗаписей.Добавить().Объект = ДокументОснование;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

//ЗАГРУЗКА ПРИ ОБМЕНЕ

Процедура ЗагрузитьРезультатРазмещения(РазмещениеСсылкаТопЛог, ЗаказНаПриемкуXDTO, ОбъектXDTO, ТаблицаСсылок, Успешно, вхПараметры, СтруктураОтчета = Неопределено)
	
	Перем ЭтоПоступление;
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗагрузитьРезультатРазмещения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
		
	//Результат размещения по возврату от покупателя не загружаем, такие размещения грузятся отдельными документами "Размещение твоаров"
	Если ЗаказНаПриемкуXDTO.ЗаказВидДокумента = "ВозвратТоваровОтПокупателя" Тогда
		Возврат;
	КонецЕсли;		
	
	Если ЗаказНаПриемкуXDTO.ЗаказВидДокумента = "ПоступлениеТоваровУслуг" Тогда 
		Если ЗначениеЗаполнено(ЗаказНаПриемкуXDTO.ЗаказСсылка) Тогда 
			ДокументОснование = Документы.ПоступлениеТоваровУслуг.ПолучитьСсылку(Новый УникальныйИдентификатор(ЗаказНаПриемкуXDTO.ЗаказСсылка));
		Иначе
			ДокументОснование = Документы.ПоступлениеТоваровУслуг.НайтиПоНомеру(ОбщегоНазначения.ПреобразоватьНомер(ЗаказНаПриемкуXDTO.ЗаказНомер), ТекущаяДата());
		КонецЕсли;
		ЭтоПоступление = Истина;
	Иначе
		Если ЗначениеЗаполнено(ЗаказНаПриемкуXDTO.ЗаказСсылка) Тогда 
			ДокументОснование = Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ЗаказНаПриемкуXDTO.ЗаказСсылка));
		Иначе
			ДокументОснование = Документы.ПеремещениеТоваров.НайтиПоНомеру(ОбщегоНазначения.ПреобразоватьНомер(ЗаказНаПриемкуXDTO.ЗаказНомер), ТекущаяДата());
		КонецЕсли;
		ЭтоПоступление = Ложь;
	КонецЕсли;
	
	//ТаблицаСсылок.Добавить(ДокументОснование);
	
	Если ОбменДаннымиКлиентСервер.ЭтоБитаяСсылка(ДокументОснование) Тогда 
		//Семенов И.П. 11.02.2019 XX-1768(
		ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокументОснование, ЗаказНаПриемкуXDTO,,Истина,"Загрузка результата размещения. Не найдено " + ?(ЭтоПоступление,"поступление товаров и услуг", "перемещение товаров") + " с guid = " + ЗаказНаПриемкуXDTO.ЗаказСсылка + " и номером = " + ЗаказНаПриемкуXDTO.ЗаказНомер);
		//)Семенов И.П.
		ВызватьИсключение "Загрузка результата размещения. Не найдено " + ?(ЭтоПоступление,"поступление товаров и услуг", "перемещение товаров") + " с guid = " + ЗаказНаПриемкуXDTO.ЗаказСсылка + " и номером = " + ЗаказНаПриемкуXDTO.ЗаказНомер;
	КонецЕсли;
	
	Если Не ЭтоПоступление Тогда
		СкладПолучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "СкладПолучатель");
		ОбменСTopLog = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладПолучатель, "ОбменСTopLog");
		Если ОбменСTopLog Тогда 
			Возврат; //Это заказ на приемку, такие размещения не грузим
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоПоступление Тогда 	
		ЗагрузитьРезультатРазмещенияПТУ(ДокументОснование, ЗаказНаПриемкуXDTO, ОбъектXDTO, РазмещениеСсылкаТопЛог, ТаблицаСсылок, Успешно, вхПараметры, СтруктураОтчета);
	Иначе
		ЗагрузитьРезультатРазмещенияПерем(ДокументОснование, ЗаказНаПриемкуXDTO, ОбъектXDTO, РазмещениеСсылкаТопЛог, ТаблицаСсылок, Успешно, вхПараметры, СтруктураОтчета);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьРезультатРазмещенияПТУ(ДокументОснование, ЗаказНаПриемкуXDTO, ОбъектXDTO, РазмещениеСсылкаТопЛог, ТаблицаСсылок, Успешно, вхПараметры, СтруктураОтчета = Неопределено)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗагрузитьРезультатРазмещенияПТУ";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗагрузитьРезультатРазмещенияПТУ";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////
	
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация,Склад,ВидОперацииПоступления,Дата,Склад.ФизическийСклад");
	Таблица = ЗаказНаПриемкуXDTO.Товары.ПолучитьСписок("СтрокаТовары");
	СоответствиеСкладов = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл 
		Если СоответствиеСкладов[СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка] = Неопределено Тогда 
			СкладПолучатель = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка));
			СоответствиеСкладов.Вставить(СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка, СкладПолучатель);
			Если Реквизиты.ВидОперацииПоступления = Перечисления.ВидыПоступленияТоваров.ОтветХранение Тогда 
				ЗапросСклад = Новый Запрос;
				ЗапросСклад.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				                    |	Склады.Ссылка
				                    |ИЗ
				                    |	Справочник.Склады КАК Склады
				                    |ГДЕ
				                    |	Склады.ФизическийСклад = &ФизическийСклад
				                    |	И Склады.СкладVMI";
				ЗапросСклад.УстановитьПараметр("ФизическийСклад", СкладПолучатель);
				ВыборкаСклад = ЗапросСклад.Выполнить().Выбрать();
				Если ВыборкаСклад.Следующий() Тогда 
					Если ВыборкаСклад.Ссылка <> Реквизиты.Склад Тогда 
						РассылкаСообщенийОбОшибках.ОтправитьЭлектронноеСообщениеБезСохранения(Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаОбменаСТопЛог, "Для размещения на ответ. хранение выгружен склад, отличающийся от склада в шапке ПТУ. GUID Размещения = " + РазмещениеСсылкаТопЛог + " ПТУ: " + ДокументОснование + " Будет подставлен склад из шапки документа." + "Выгрузка размещения из ТопЛог.");
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли  // Реквизиты.СкладФизическийСклад = Константы.СкладОсновной.Получить() И   
					   // XX-2445 Загрузка бонусных размещений Валиахметов А.А. 21.05.2019
					   // Бонусные и сувенирные склады теперь есть не только у ЦС 
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладПолучатель, "ФизическийСклад") = Реквизиты.СкладФизическийСклад Тогда 
					СоответствиеСкладов.Вставить(СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка, Реквизиты.Склад);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Реквизиты.ВидОперацииПоступления = Перечисления.ВидыПоступленияТоваров.ОтветХранение Тогда 
		СоответствиеСкладов.Очистить();
		СоответствиеСкладов.Вставить("", Реквизиты.Склад);
	КонецЕсли;
	
	Для Каждого КлючЗначение Из СоответствиеСкладов Цикл 
		
		//Семенов И.П. 12.02.2019 XX-1768(
		ОшибкаСформирована = Ложь;
		//)Семенов И.П.
		
		Попытка
			СкладПолучатель = КлючЗначение.Значение;
			РазмещениеЯчейкаСкладСсылка = КлючЗначение.Ключ;
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ПеремещениеТоваров.Ссылка
			|ИЗ
			|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
			|ГДЕ
			|	ПеремещениеТоваров.РазмещениеСсылкаТопЛог = &РазмещениеСсылкаТопЛог
			|	И ПеремещениеТоваров.ДокументОснование = &ДокументОснование
			|	И ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель";
			Запрос.УстановитьПараметр("РазмещениеСсылкаТопЛог", РазмещениеСсылкаТопЛог);
			Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
			Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			НеобходимаЗагрузка = Ложь;
			ТребуетсяОчисткаТЧ = Ложь;
			Дельта = Неопределено;
			
			Если Выборка.Количество() = 0 Тогда 
				ДокСсылка = Документы.ПеремещениеТоваров.ПустаяСсылка();
			ИначеЕсли Выборка.Количество() = 1 Тогда 
				Выборка.Следующий();
				ДокСсылка = Выборка.Ссылка;
			Иначе
				ВызватьИсключение "Найдено более одного документа перемещения с guid размещения = " + РазмещениеСсылкаТопЛог + " и документом-основанием: " + ДокументОснование + " и складом: " + СкладПолучатель;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ДокСсылка) Тогда 
				ДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();		
			Иначе
				ДокОбъект = ДокСсылка.ПолучитьОбъект();		
			КонецЕсли;
			
			ДокОбъект.РазмещениеСсылкаТопЛог = РазмещениеСсылкаТопЛог;
			ДокОбъект.ДокументОснование = ДокументОснование;
			ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог;
			ДокОбъект.ЗагруженИзТопЛог = Истина;
			
			ОстаткиПоРегистру = ОстаткиСтрокПрихода(ДокументОснование, ДокСсылка);
			
			РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокСсылка, "Проведен,СтатусДокумента,Дата");
			
			ТоварыДокумента = Новый ТаблицаЗначений;
			ТоварыДокумента.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
			ТоварыДокумента.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
			ТоварыДокумента.Колонки.Добавить("КоличествоПлан", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
			ТоварыДокумента.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации")); 
			
			Если РеквизитыДокумента.Проведен = Истина И РеквизитыДокумента.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ПеремещениеТоваровТовары.Номенклатура,
				|	ПеремещениеТоваровТовары.СтрокаЗаявки,
				|	СУММА(ПеремещениеТоваровТовары.КоличествоПлан) КАК КоличествоПлан,
				|	ПеремещениеТоваровТовары.Организация
				|ИЗ
				|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
				|ГДЕ
				|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ПеремещениеТоваровТовары.Номенклатура,
				|	ПеремещениеТоваровТовары.СтрокаЗаявки,
				|	ПеремещениеТоваровТовары.Организация";
				Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
				ТоварыДокумента = Запрос.Выполнить().Выгрузить();
			КонецЕсли;
			
			ТоварыXDTO = ЗаказНаПриемкуXDTO.Товары.ПолучитьСписок("СтрокаТовары");
			СоотвSSID = ОбменДаннымиКлиентСервер.СоответствиеСтрокЗаявокИSSID(ТоварыXDTO, ДокументОснование); 
			
			Товары = Новый ТаблицаЗначений;
			Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
			Товары.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
			Товары.Колонки.Добавить("КоличествоПлан", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
			
			ТоварыСПустымиSSID = Новый ТаблицаЗначений;
			ТоварыСПустымиSSID.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
			ТоварыСПустымиSSID.Колонки.Добавить("КоличествоПлан", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
			
			Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
				Если Не ПустаяСтрока(РазмещениеЯчейкаСкладСсылка) И РазмещениеЯчейкаСкладСсылка <> СтрокаТовары.РазмещениеЯчейкаСкладСсылка Тогда 
					Продолжить;
				КонецЕсли;
				
				СтрокаЗаявки = ОбменДаннымиКлиентСервер.НайтиСтрокуЗаявкиВСоответствии(СоотвSSID, СтрокаТовары.SSID);
				Если Не ЗначениеЗаполнено(СтрокаЗаявки) Тогда 
					НоваяСтрока = ТоварыСПустымиSSID.Добавить();
				Иначе	
					НоваяСтрока = Товары.Добавить();
					НоваяСтрока.СтрокаЗаявки = СтрокаЗаявки;
				КонецЕсли;
				
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.НоменклатураСсылка));
				НоваяСтрока.КоличествоПлан = СтрокаТовары.КоличествоРазмещено;
			КонецЦикла;
			
			РазмещенныеТовары = Новый ТаблицаЗначений;
			РазмещенныеТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
			РазмещенныеТовары.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
			РазмещенныеТовары.Колонки.Добавить("КоличествоПлан", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
			РазмещенныеТовары.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации")); 
			
			Отбор = Новый Структура("Номенклатура,СтрокаЗаявки"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Товары, ТоварыДокумента, РазмещенныеТовары, "КоличествоПлан");
			ОчиститьТаблицуСНулевымКол(Товары, "КоличествоПлан");
			ОчиститьТаблицуСНулевымКол(ТоварыДокумента, "КоличествоПлан");
			
			Отбор = Новый Структура("Номенклатура"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Товары, ТоварыДокумента, РазмещенныеТовары, "КоличествоПлан");
			ОчиститьТаблицуСНулевымКол(Товары, "КоличествоПлан");
			ОчиститьТаблицуСНулевымКол(ТоварыДокумента, "КоличествоПлан");
			
			Отбор = Новый Структура("Номенклатура"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, ТоварыСПустымиSSID, ТоварыДокумента, РазмещенныеТовары, "КоличествоПлан");
			ОчиститьТаблицуСНулевымКол(ТоварыСПустымиSSID, "КоличествоПлан");
			ОчиститьТаблицуСНулевымКол(ТоварыДокумента, "КоличествоПлан");
			
			Отбор = Новый Структура("Номенклатура,СтрокаЗаявки"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Товары, ОстаткиПоРегистру, РазмещенныеТовары, "КоличествоПлан");
			ОчиститьТаблицуСНулевымКол(Товары, "КоличествоПлан");
			ОчиститьТаблицуСНулевымКол(ОстаткиПоРегистру, "КоличествоПлан");
			
			Отбор = Новый Структура("Номенклатура"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, ТоварыСПустымиSSID, ОстаткиПоРегистру, РазмещенныеТовары, "КоличествоПлан");
			ОчиститьТаблицуСНулевымКол(ТоварыСПустымиSSID, "КоличествоПлан");
			ОчиститьТаблицуСНулевымКол(ОстаткиПоРегистру, "КоличествоПлан");
			
			Отбор = Новый Структура("Номенклатура"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Товары, ОстаткиПоРегистру, РазмещенныеТовары, "КоличествоПлан");
			
			ОчиститьТаблицуСНулевымКол(Товары, "КоличествоПлан");
			ОчиститьТаблицуСНулевымКол(ОстаткиПоРегистру, "КоличествоПлан");
			
			Если Не (Товары.Количество() = 0 И ТоварыСПустымиSSID.Количество() = 0) Тогда 
				ТекстПисьма = "";
				Для Каждого СтрокаТЧ Из Товары Цикл 
					ТекстПисьма = ТекстПисьма + СтрокаТЧ.Номенклатура + "(" + СтрокаТЧ.Номенклатура.Код + ")" + " IDSIte: " + СтрокаТЧ.СтрокаЗаявки.IDSite + Символы.ПС;
				КонецЦикла;
				Для Каждого СтрокаТЧ Из ТоварыСПустымиSSID Цикл 
					ТекстПисьма = ТекстПисьма + СтрокаТЧ.Номенклатура + "(" + СтрокаТЧ.Номенклатура.Код + ")" + Символы.ПС;
				КонецЦикла;
				
				// НП 14.05.2019 Горохов П.Е. http://jira.part-kom.ru/browse/XX-2329
				
				КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(
				ДокОбъект.Ссылка,
				Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаОбменаСТопЛог,
				"Размещено больше чем в ПТУ. " + ?(ДокОбъект.ЭтоНовый(), "GUID Размещения = "+РазмещениеСсылкаТопЛог, "Документ размещение:" + ДокОбъект.Ссылка) + " ПТУ: " + ДокументОснование,
				,
				Истина,
				ТекстПисьма,
				"Документ.ПеремещениеТоваров.МодульМенеджера.ЗагрузитьРезультатРазмещенияПТУ()");
				//РассылкаСообщенийОбОшибках.ОтправитьЭлектронноеСообщениеБезСохранения(Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаОбменаСТопЛог,ТекстПисьма,
				//"Размещено больше чем в ПТУ. GUID Размещения = " + РазмещениеСсылкаТопЛог + " ПТУ: " + ДокументОснование);
				
				// КП 14.05.2019 Горохов П.Е. http://jira.part-kom.ru/browse/XX-2329

				
				//Закомментировал пока, чтобы коррекные строки грузились
				//ВызватьИсключение "ТопЛог выгрузил ";
			КонецЕсли;
			
			ДокОбъект.Товары.Очистить();
			Для Каждого СтрокаТовары Из РазмещенныеТовары Цикл 
				НоваяСтрока = ДокОбъект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары);
				НоваяСтрока.Количество = НоваяСтрока.КоличествоПлан;
				НоваяСтрока.ЕдиницаИзмерения =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ЕдиницаХраненияОстатков");
				НоваяСтрока.Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.ЕдиницаИзмерения, "Коэффициент");
				НоваяСтрока.Качество = Справочники.Качество.Новый;
			КонецЦикла;
			
			СкладПриемки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизиты.Склад, "СкладПриемки");
			Если Не ЗначениеЗаполнено(СкладПриемки) Тогда 
				СкладПриемки = Реквизиты.Склад;
			КонецЕсли;
			ДокОбъект.Организация = Реквизиты.Организация;
			
			ДокОбъект.СкладОтправитель = СкладПриемки;
			
			Если Реквизиты.ВидОперацииПоступления = Перечисления.ВидыПоступленияТоваров.ОтветХранение Тогда 
				ДокОбъект.СкладПолучатель = Реквизиты.Склад;
			Иначе
				ДокОбъект.СкладПолучатель = СкладПолучатель;
			КонецЕсли;
			
			ДокОбъект.ФилиалОтправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.СкладОтправитель, "Филиал");
			ДокОбъект.ФилиалПолучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.СкладПолучатель, "Филиал");
			
			ДокОбъект.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил;
			ДокОбъект.ПометкаУдаления = Ложь;
			ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольОстатков");
			
			Если ДокОбъект.ЭтоНовый() 
				//Валиахметов http://jira.part-kom.ru/browse/XX-2747  02.07.2019 Сделал аналогично отложенному проведению, которое проводит тек. датой
				Или Не ДокОбъект.Проведен Тогда 
				//Конец Валиахметов http://jira.part-kom.ru/browse/XX-2747  02.07.2019
				ДокОбъект.Дата = ТекущаяДата();
				ДокОбъект.ДополнительныеСвойства.Вставить("ОперативноеПроведение", Истина);
			ИначеЕсли НЕ РеквизитыДокумента.Проведен И РеквизитыДокумента.Дата <= Реквизиты.Дата Тогда 
				ДокОбъект.Дата = Реквизиты.Дата + 1; 
			КонецЕсли;
			
			//Если Не ДокОбъект.ЭтоНовый() Тогда 
			//	ДокОбъект.ДополнительныеСвойства.Вставить("НеПерепроводитьПартии", Истина);
			//КонецЕсли;
			
			НоваяСтрока = ТаблицаСсылок.Добавить();
			НоваяСтрока.Документ = ДокОбъект.ДокументОснование;
			НоваяСтрока.Склад = ДокОбъект.СкладПолучатель;
			
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "СтатусДокумента") = Справочники.СтатусыДокументов.ПоступлениеТоваровПринят Тогда 
				Попытка
					//НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
					#Если Сервер Тогда 
						ОбменСТопЛогСервер.ИницилизироватьДействияНадОбъектом(вхПараметры);
						ОбменСТопЛогСервер.УстановитьПризнакНаличияПроведения(вхПараметры);
					#КонецЕсли
					Если Не ЗаписатьРазмещение(ДокОбъект, РежимЗаписиДокумента.Проведение) Тогда 
						Возврат;
					КонецЕсли;
					
					#Если Сервер Тогда 
						ОбменСТопЛогСервер.УстановитьПризнакУспешногоПроведения(вхПараметры);
					#КонецЕсли
					
					//ЗафиксироватьТранзакцию();
					НомерСообщения = ?(вхПараметры = Неопределено, 0, вхПараметры.НомерСообщения);
					НомерПотока = ?(вхПараметры = Неопределено, 0, вхПараметры.НомерПотока);
					РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(ДокОбъект.Ссылка, НомерСообщения, , , , Ложь, НомерПотока); 
					//Семенов И.П. 11.02.2019 XX-1768(
					ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокОбъект.Ссылка, ЗаказНаПриемкуXDTO);
					//)Семенов И.П.
					
					// 25.03.19 Строганов Роман > 
					ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокОбъект.Ссылка, Истина, Ложь);
					// 25.03.19 Строганов Роман <

				Исключение				
					//ОтменитьТранзакцию();
					
					ОписаниеОшибки = ОписаниеОшибки();
					
					//Семенов И.П. 11.02.2019 XX-1768(
					ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокОбъект.Ссылка, ЗаказНаПриемкуXDTO,,Истина,ОписаниеОшибки);
					ОшибкаСформирована = Истина;
					//)Семенов И.П.
					
					// 25.03.19 Строганов Роман > 
					ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокОбъект.Ссылка, Истина, Истина, ОписаниеОшибки);
					// 25.03.19 Строганов Роман <
					
					Если Не ЗаписатьРазмещение(ДокОбъект, РежимЗаписиДокумента.Запись) Тогда 
						Возврат;
					КонецЕсли;
					
					#Если Сервер Тогда 
						ОбменСТопЛогСервер.ОбработатьДействияНадОбъектом(вхПараметры, ДокОбъект.Ссылка, ОписаниеОшибки, "ЗагрузитьРезультатРазмещенияПТУ");
					#КонецЕсли
					
					Набор = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
					Набор.Отбор.СсылкаНаДокумент.Установить(ДокОбъект.Ссылка);
					
					Стр = Набор.Добавить();
					Стр.СсылкаНаДокумент = ДокОбъект.Ссылка;
					Набор.Записать(Истина);
					
					
					ВызватьИсключение ОписаниеОшибки;
				КонецПопытки;
			Иначе 
				Попытка
					Если Не ЗаписатьРазмещение(ДокОбъект, РежимЗаписиДокумента.Запись) Тогда 
						Возврат;
					КонецЕсли;
					
					//Семенов И.П. 11.02.2019 XX-1768(
					ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокОбъект.Ссылка, ЗаказНаПриемкуXDTO);
					//)Семенов И.П.
					
					// 25.03.19 Строганов Роман > 
					ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокОбъект.Ссылка, Истина, Ложь);
					// 25.03.19 Строганов Роман <
					
					НомерСообщения = ?(вхПараметры = Неопределено, 0, вхПараметры.НомерСообщения);
					НомерПотока = ?(вхПараметры = Неопределено, 0, вхПараметры.НомерПотока);
					РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(ДокОбъект.Ссылка, НомерСообщения, , , , Ложь, НомерПотока); 
					
					Набор = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
					Набор.Отбор.СсылкаНаДокумент.Установить(ДокОбъект.Ссылка);
					
					Стр = Набор.Добавить();
					Стр.СсылкаНаДокумент = ДокОбъект.Ссылка;
					Набор.Записать(Истина);
					
					//ЗафиксироватьТранзакцию();
				Исключение
					//Семенов И.П. 11.02.2019 XX-1768(
					ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокОбъект.Ссылка, ЗаказНаПриемкуXDTO,,Истина,ОписаниеОшибки());
					ОшибкаСформирована = Истина;
					//)Семенов И.П.
					
					// 25.03.19 Строганов Роман > 
					ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокОбъект.Ссылка, Истина, Истина, ОписаниеОшибки);
					// 25.03.19 Строганов Роман <

					ВызватьИсключение ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;
	
		
		//ЗафиксироватьТранзакцию();
	Исключение
		//ОтменитьТранзакцию();
		//Семенов И.П. 12.02.2019 XX-1768(
		Если НЕ ОшибкаСформирована Тогда 
			ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокументОснование, ЗаказНаПриемкуXDTO,,Истина,ОписаниеОшибки());
			
			// 25.03.19 Строганов Роман > 
			ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокументОснование, Истина, Истина, ОписаниеОшибки());
			// 25.03.19 Строганов Роман <
		КонецЕсли;
		//)Семенов И.П.
		Успешно = Ложь;
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
КонецЦикла;
		
КонецПроцедуры

Функция ЗаписатьРазмещение(ДокОбъект, РежимЗаписи)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗаписатьРазмещение";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
		
	Если ДокОбъект.Товары.Количество() > 0 Тогда 
		ДокОбъект.Записать(РежимЗаписи);
	ИначеЕсли Не ДокОбъект.ЭтоНовый() Тогда 
		ДокОбъект.ПометкаУдаления = Истина;
		Если ДокОбъект.Проведен Тогда 
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Иначе
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;	
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗагрузитьРезультатРазмещенияПерем(ДокументОснование, ЗаказНаПриемкуXDTO, ОбъектXDTO, РазмещениеСсылкаТопЛог, ТаблицаСсылок, Успешно, вхПараметры, СтруктураОтчета = Неопределено)
	
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗагрузитьРезультатРазмещенияПерем";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////
	
	Таблица = ЗаказНаПриемкуXDTO.Товары.ПолучитьСписок("СтрокаТовары");
	СоответствиеСкладов = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл 
		Если СоответствиеСкладов[СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка] = Неопределено Тогда 
			СкладПолучатель = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка));
			СоответствиеСкладов.Вставить(СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка, СкладПолучатель);
		КонецЕсли;
	КонецЦикла;
	
	РеквизитыОснования 			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "СкладОтправитель.Возвраты, ВидОперации, АктРассмотренияВозврата");
	ВозвратВПродажу 			= РеквизитыОснования.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ВозвратВПродажу;
	Если ВозвратВПродажу Тогда
		Возврат;
	КонецЕсли;
	
	РазмещениеВЗонуВозвратов 	= Ложь;
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		РазмещениеВЗонуВозвратов = РеквизитыОснования.СкладОтправительВозвраты 
										И НЕ ВозвратВПродажу;
	КонецЕсли;	
	
	Для Каждого КлючЗначение Из СоответствиеСкладов Цикл 
		
		//Семенов И.П. 12.02.2019 XX-1768(
		ОшибкаСформирована = Ложь;
		//)Семенов И.П.
		
		//НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		Попытка
			СкладПолучатель = ?(РазмещениеВЗонуВозвратов, КлючЗначение.Значение.СкладВозвратов, КлючЗначение.Значение); 
			РазмещениеЯчейкаСкладСсылка = КлючЗначение.Ключ;
			
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ПеремещениеТоваров.Ссылка
				|ИЗ
				|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
				|ГДЕ
				|	ПеремещениеТоваров.РазмещениеСсылкаТопЛог = &РазмещениеСсылкаТопЛог
				|	И ПеремещениеТоваров.ДокументОснование = &ДокументОснование
				|	И ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель";
				Запрос.УстановитьПараметр("РазмещениеСсылкаТопЛог", РазмещениеСсылкаТопЛог);
				Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
				Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
				
				Выборка = Запрос.Выполнить().Выбрать();
				
				НеобходимаЗагрузка = Ложь;
				ТребуетсяОчисткаТЧ = Ложь;
				Дельта = Неопределено;
				
				Если Выборка.Количество() = 0 Тогда 
					ДокСсылка = Документы.ПеремещениеТоваров.ПустаяСсылка();
				ИначеЕсли Выборка.Количество() = 1 Тогда 
					Выборка.Следующий();
					ДокСсылка = Выборка.Ссылка;
				Иначе
					ВызватьИсключение "Найдено более одного документа перемещения с guid размещения = " + РазмещениеСсылкаТопЛог + " и документом-основанием: " + ДокументОснование + " и складом: " + СкладПолучатель;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(ДокСсылка) Тогда 
					ДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();		
				Иначе
					ДокОбъект = ДокСсылка.ПолучитьОбъект();		
				КонецЕсли;
			
			ДокОбъект.РазмещениеСсылкаТопЛог = РазмещениеСсылкаТопЛог;
			ДокОбъект.ДокументОснование = ДокументОснование;
			ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог;
			ДокОбъект.ЗагруженИзТопЛог = Истина;
			
			СтруктураТаблиц = ОстаткиСтрокПриходаДляПеремещения(ДокументОснование, ДокСсылка);
			ОстаткиСтрокПрихода = СтруктураТаблиц.ОстаткиСтрокПрихода;
			ОстаткиСтрокПриходаПоСтрокамЗаявок = СтруктураТаблиц.ОстаткиСтрокПриходаПоСтрокамЗаявок;
			
			РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокСсылка, "Проведен,СтатусДокумента,Дата");
			
			ТоварыДокумента = Новый ТаблицаЗначений;
			ТоварыДокумента.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
			ТоварыДокумента.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
			ТоварыДокумента.Колонки.Добавить("СтрокаПрихода", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокПриходов"));
			ТоварыДокумента.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
			ТоварыДокумента.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации")); 
			
			Если РеквизитыДокумента.Проведен = Истина И РеквизитыДокумента.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил Тогда 
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ПеремещениеТоваровТовары.Номенклатура,
				|	ПеремещениеТоваровТовары.СтрокаЗаявки,
				|	ПеремещениеТоваровТовары.СтрокаПрихода,
				|	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество,
				|	ПеремещениеТоваровТовары.Организация
				|ИЗ
				|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
				|ГДЕ
				|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
				|
				|СГРУППИРОВАТЬ ПО
				|	ПеремещениеТоваровТовары.Номенклатура,
				|	ПеремещениеТоваровТовары.СтрокаЗаявки,
				|	ПеремещениеТоваровТовары.СтрокаПрихода,
				|	ПеремещениеТоваровТовары.Организация";
				Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
				ТоварыДокумента = Запрос.Выполнить().Выгрузить();
			КонецЕсли;
			
			ТоварыXDTO = ЗаказНаПриемкуXDTO.Товары.ПолучитьСписок("СтрокаТовары");
			СоотвSSID = ОбменДаннымиКлиентСервер.СоответствиеСтрокЗаявокИSSID(ТоварыXDTO, ДокументОснование); 
			
			Товары = Новый ТаблицаЗначений;
			Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
			Товары.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
			Товары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
			
			ТоварыСПустымиSSID = Новый ТаблицаЗначений;
			ТоварыСПустымиSSID.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
			ТоварыСПустымиSSID.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
			
			Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
				Если Не ПустаяСтрока(РазмещениеЯчейкаСкладСсылка) И РазмещениеЯчейкаСкладСсылка <> СтрокаТовары.РазмещениеЯчейкаСкладСсылка Тогда 
					Продолжить;
				КонецЕсли;
				
				СтрокаЗаявки = ОбменДаннымиКлиентСервер.НайтиСтрокуЗаявкиВСоответствии(СоотвSSID, СтрокаТовары.SSID);
				Если Не ЗначениеЗаполнено(СтрокаЗаявки) Тогда 
					НоваяСтрока = ТоварыСПустымиSSID.Добавить();
				Иначе	
					НоваяСтрока = Товары.Добавить();
					НоваяСтрока.СтрокаЗаявки = СтрокаЗаявки;
				КонецЕсли;
				
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.НоменклатураСсылка));
				НоваяСтрока.Количество = СтрокаТовары.КоличествоРазмещено;
			КонецЦикла;
			
			РазмещенныеТовары = Новый ТаблицаЗначений;
			РазмещенныеТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
			РазмещенныеТовары.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
			РазмещенныеТовары.Колонки.Добавить("СтрокаПрихода", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокПриходов"));
			РазмещенныеТовары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
			РазмещенныеТовары.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации")); 
			
			Отбор = Новый Структура("Номенклатура,СтрокаЗаявки"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Товары, ТоварыДокумента, РазмещенныеТовары, "Количество");
			
			Отбор = Новый Структура("Номенклатура"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Товары, ТоварыДокумента, РазмещенныеТовары, "Количество");
			
			Отбор = Новый Структура("Номенклатура"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, ТоварыСПустымиSSID, ТоварыДокумента, РазмещенныеТовары, "Количество");
			
			//Добавлено
			КопияРазмещеныеТовары = РазмещенныеТовары.Скопировать();
			
			Отбор = Новый Структура("Номенклатура,СтрокаЗаявки,СтрокаПрихода"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, ОстаткиСтрокПриходаПоСтрокамЗаявок, КопияРазмещеныеТовары, , "Количество");
			
			Отбор = Новый Структура("Номенклатура,СтрокаЗаявки"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, ОстаткиСтрокПриходаПоСтрокамЗаявок, КопияРазмещеныеТовары, , "Количество");
			
			Отбор = Новый Структура("Номенклатура"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, ОстаткиСтрокПрихода, КопияРазмещеныеТовары, , "Количество");
			
			//Конец добавлено
			
			Отбор = Новый Структура("Номенклатура,СтрокаЗаявки"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Товары, ОстаткиСтрокПриходаПоСтрокамЗаявок, РазмещенныеТовары, "Количество");
			
			Отбор = Новый Структура("Номенклатура,СтрокаЗаявки"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Товары, ОстаткиСтрокПриходаПоСтрокамЗаявок, РазмещенныеТовары, "Количество");
			
			Отбор = Новый Структура("Номенклатура"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, ТоварыСПустымиSSID, ОстаткиСтрокПриходаПоСтрокамЗаявок, РазмещенныеТовары, "Количество");
			
			Отбор = Новый Структура("Номенклатура"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Товары, ОстаткиСтрокПрихода, РазмещенныеТовары, "Количество");
			
			Отбор = Новый Структура("Номенклатура"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, ТоварыСПустымиSSID, ОстаткиСтрокПрихода, РазмещенныеТовары, "Количество");
			
			Отбор = Новый Структура("Номенклатура"); 
			ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Товары, ОстаткиСтрокПриходаПоСтрокамЗаявок, РазмещенныеТовары, "Количество");
			
			ОчиститьТаблицуСНулевымКол(Товары, "Количество");
			ОчиститьТаблицуСНулевымКол(ТоварыСПустымиSSID, "Количество");
			ОчиститьТаблицуСНулевымКол(ОстаткиСтрокПрихода, "Количество");
			ОчиститьТаблицуСНулевымКол(ОстаткиСтрокПриходаПоСтрокамЗаявок, "Количество");
			
			ПревышаетДокументОснование = Ложь;
			Если Не (Товары.Количество() = 0 И ТоварыСПустымиSSID.Количество() = 0) Тогда 
				ТекстПисьма = "";
				Для Каждого СтрокаТЧ Из Товары Цикл 
					ТекстПисьма = ТекстПисьма + СтрокаТЧ.Номенклатура + "(" + СтрокаТЧ.Номенклатура.Код + ")" + " IDSIte: " + СтрокаТЧ.СтрокаЗаявки.IDSite + Символы.ПС;
				КонецЦикла;
				Для Каждого СтрокаТЧ Из ТоварыСПустымиSSID Цикл 
					ТекстПисьма = ТекстПисьма + СтрокаТЧ.Номенклатура + "(" + СтрокаТЧ.Номенклатура.Код + ")" + Символы.ПС;
				КонецЦикла;
				
				// НП 23.04.2019 Горохов П.Е. http://jira.part-kom.ru/browse/XX-2329
				
				КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(
				ДокОбъект.Ссылка,
				Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаОбменаСТопЛог,
				"Размещено больше чем в ПТУ. " + ?(ДокОбъект.ЭтоНовый(), "GUID Размещения = "+РазмещениеСсылкаТопЛог, "Документ размещение:" + ДокОбъект.Ссылка) + " Перемещение исходящее: " + ДокументОснование,
				,
				Истина,
				ТекстПисьма,
				"Документ.ПеремещениеТоваров.МодульМенеджера.ЗагрузитьРезультатРазмещенияПерем()");
				//РассылкаСообщенийОбОшибках.ОтправитьЭлектронноеСообщениеБезСохранения(Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаОбменаСТопЛог,ТекстПисьма,
				//"Размещено больше чем в ПТУ. GUID Размещения = " + РазмещениеСсылкаТопЛог + " Перемещение исходящее: " + ДокументОснование);
				
				// КП 23.04.2019 Горохов П.Е. http://jira.part-kom.ru/browse/XX-2329
				
				//Закомментировал пока, чтобы коррекные строки грузились
				//ВызватьИсключение "ТопЛог выгрузил ";
				ПревышаетДокументОснование = Истина;
			КонецЕсли;
			
			ДокОбъект.Товары.Очистить();
			Для Каждого СтрокаТовары Из РазмещенныеТовары Цикл 
				НоваяСтрока = ДокОбъект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТовары,, "СтрокаПрихода");
				НоваяСтрока.КоличествоПлан = НоваяСтрока.Количество;
				НоваяСтрока.ЕдиницаИзмерения =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ЕдиницаХраненияОстатков");
				НоваяСтрока.Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.ЕдиницаИзмерения, "Коэффициент");
				НоваяСтрока.Качество = Справочники.Качество.Новый;
			КонецЦикла;
			
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация,СкладПолучатель,Дата");
			ДокОбъект.Организация = Реквизиты.Организация;
			ДокОбъект.СкладОтправитель = Реквизиты.СкладПолучатель;
			ДокОбъект.СкладПолучатель = СкладПолучатель;
			
			ДокОбъект.ФилиалОтправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.СкладОтправитель, "Филиал");
			ДокОбъект.ФилиалПолучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.СкладПолучатель, "Филиал");
			
			ДокОбъект.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил;
			ДокОбъект.ПометкаУдаления = Ложь;
			ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольОстатков");
			
			ДокОбъект.АктРассмотренияВозврата = РеквизитыОснования.АктРассмотренияВозврата;
			
			Если ДокОбъект.ЭтоНовый() 
				//Валиахметов http://jira.part-kom.ru/browse/XX-2747  02.07.2019 Сделал аналогично отложенному проведению, которое проводит тек. датой
				Или Не ДокОбъект.Проведен Тогда 
				//Конец Валиахметов http://jira.part-kom.ru/browse/XX-2747  02.07.2019
				ДокОбъект.Дата = ТекущаяДата();
				ДокОбъект.ДополнительныеСвойства.Вставить("ОперативноеПроведение", Истина);
			ИначеЕсли НЕ РеквизитыДокумента.Проведен И РеквизитыДокумента.Дата <= Реквизиты.Дата Тогда 
	        	ДокОбъект.Дата = Реквизиты.Дата + 1;
			КонецЕсли;
			
			//Если Не ДокОбъект.ЭтоНовый() Тогда 
			//	ДокОбъект.ДополнительныеСвойства.Вставить("НеПерепроводитьПартии", Истина);
			//КонецЕсли;
			
			НоваяСтрока = ТаблицаСсылок.Добавить();
			НоваяСтрока.Документ = ДокОбъект.ДокументОснование;
			НоваяСтрока.Склад = ДокОбъект.СкладПолучатель;
			
			Если Не ПревышаетДокументОснование И (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ОбновленИзТопЛог") = Истина Или 
				ПроведениеДокументовКлиентСервер.ИсходящееПеремещениеРазрешеноРазмещениеБезСборки(ДокументОснование)) Тогда 
				Попытка
					
					#Если Сервер Тогда 
						ОбменСТопЛогСервер.ИницилизироватьДействияНадОбъектом(вхПараметры);
						ОбменСТопЛогСервер.УстановитьПризнакНаличияПроведения(вхПараметры);
					#КонецЕсли

					Если Не ЗаписатьРазмещение(ДокОбъект, РежимЗаписиДокумента.Проведение) Тогда 
						Возврат;
					КонецЕсли;
					
					#Если Сервер Тогда 
						ОбменСТопЛогСервер.УстановитьПризнакУспешногоПроведения(вхПараметры);
					#КонецЕсли
					
					//Семенов И.П. 11.02.2019 XX-1768(
					ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокОбъект.Ссылка, ЗаказНаПриемкуXDTO);
					//)Семенов И.П.
					
					// 25.03.19 Строганов Роман > 
					ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокОбъект.Ссылка, Истина, Ложь);
					// 25.03.19 Строганов Роман <

					НомерСообщения = ?(вхПараметры = Неопределено, 0, вхПараметры.НомерСообщения);
					НомерПотока = ?(вхПараметры = Неопределено, 0, вхПараметры.НомерПотока);
					РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(ДокОбъект.Ссылка, НомерСообщения, , , , Ложь, НомерПотока); 
				Исключение				
					ОписаниеОшибки = ОписаниеОшибки();
					
					Если Не ЗаписатьРазмещение(ДокОбъект, РежимЗаписиДокумента.Запись) Тогда 
						Возврат;
					КонецЕсли;
					
					//Семенов И.П. 11.02.2019 XX-1768(
					ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокОбъект.Ссылка, ЗаказНаПриемкуXDTO,,Истина,ОписаниеОшибки);
					ОшибкаСформирована = Истина;
					//)Семенов И.П.
					
					// 25.03.19 Строганов Роман > 
					ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокОбъект.Ссылка, Истина, Истина, ОписаниеОшибки);
					// 25.03.19 Строганов Роман <
					
					#Если Сервер Тогда 
						ОбменСТопЛогСервер.ОбработатьДействияНадОбъектом(вхПараметры);
					#КонецЕсли
					
					Набор = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
					Набор.Отбор.СсылкаНаДокумент.Установить(ДокОбъект.Ссылка);
					
					Стр = Набор.Добавить();
					Стр.СсылкаНаДокумент = ДокОбъект.Ссылка;
					Набор.Записать(Истина);
					
					ВызватьИсключение ОписаниеОшибки;
				КонецПопытки;
			Иначе 
				Попытка
					
					Если Не ЗаписатьРазмещение(ДокОбъект, РежимЗаписиДокумента.Запись) Тогда 
						Возврат;
					КонецЕсли;
					
					//Семенов И.П. 11.02.2019 XX-1768(
					ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокОбъект.Ссылка, ЗаказНаПриемкуXDTO);
					//)Семенов И.П.
					
					// 25.03.19 Строганов Роман > 
					ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокОбъект.Ссылка, Истина, Ложь);
					// 25.03.19 Строганов Роман <

					Набор = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
					Набор.Отбор.СсылкаНаДокумент.Установить(ДокОбъект.Ссылка);
					НомерСообщения = ?(вхПараметры = Неопределено, 0, вхПараметры.НомерСообщения);
					НомерПотока = ?(вхПараметры = Неопределено, 0, вхПараметры.НомерПотока);
					РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(ДокОбъект.Ссылка, НомерСообщения, , , , Ложь, НомерПотока); 
					Стр = Набор.Добавить();
					Стр.СсылкаНаДокумент = ДокОбъект.Ссылка;
					Набор.Записать(Истина);
				Исключение
					//Семенов И.П. 11.02.2019 XX-1768(
					ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокОбъект.Ссылка, ЗаказНаПриемкуXDTO,,Истина,ОписаниеОшибки());
					ОшибкаСформирована = Истина;
					//)Семенов И.П
					
					// 25.03.19 Строганов Роман > 
					ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокОбъект.Ссылка, Истина, Истина, ОписаниеОшибки());
					// 25.03.19 Строганов Роман <
					ВызватьИсключение ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;
	
		
		//ЗафиксироватьТранзакцию();
	Исключение
		//ОтменитьТранзакцию();
		//Семенов И.П. 12.02.2019 XX-1768(
		Если НЕ ОшибкаСформирована Тогда 
			ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокументОснование, ЗаказНаПриемкуXDTO,,Истина,ОписаниеОшибки());	
			
			// 25.03.19 Строганов Роман > 
			ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокументОснование, Истина, Истина, ОписаниеОшибки());
			// 25.03.19 Строганов Роман <
		КонецЕсли;
		//)Семенов И.П.
		Успешно = Ложь;
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
КонецЦикла;
		
КонецПроцедуры

Процедура ОчиститьТаблицуСНулевымКол(Таблица, ИмяКолонки = "Количество") 
	
	Перем КоличествоСтрок, СтрокаТЧ, Шаг;
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ОчиститьТаблицуСНулевымКол";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	
	КоличествоСтрок = Таблица.Количество();
	Для Шаг = 0 По КоличествоСтрок - 1 Цикл 
		СтрокаТЧ = Таблица.Получить(КоличествоСтрок - Шаг - 1);
		Если СтрокаТЧ[ИмяКолонки] = 0 Тогда
			Таблица.Удалить(СтрокаТЧ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ОстаткиСтрокПрихода(ДокументОснование, ДокСсылка)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ОстаткиСтрокПрихода";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
		
		Запрос.Текст = "ВЫБРАТЬ
						|	ПеремещениеТоваровТовары.Номенклатура,
						|	ПеремещениеТоваровТовары.СтрокаПрихода КАК СтрокаПрихода,
						|	ПеремещениеТоваровТовары.СтрокаЗаявки КАК СтрокаЗаявки,
						|	СУММА(ПеремещениеТоваровТовары.КоличествоПлан) КАК КоличествоПлан
						|ПОМЕСТИТЬ втРазмещено
						|ИЗ
						|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
						|ГДЕ
						|	ПеремещениеТоваровТовары.Ссылка.ДокументОснование = &ДокументОснование
						|	И НЕ ПеремещениеТоваровТовары.Ссылка.ПометкаУдаления
						|	И ПеремещениеТоваровТовары.Ссылка <> &Ссылка
						|	И ПеремещениеТоваровТовары.Ссылка.Проведен
						|
						|СГРУППИРОВАТЬ ПО
						|	ПеремещениеТоваровТовары.СтрокаПрихода,
						|	ПеремещениеТоваровТовары.СтрокаЗаявки,
						|	ПеремещениеТоваровТовары.Номенклатура
						|
						|ИНДЕКСИРОВАТЬ ПО
						|	СтрокаПрихода,
						|	СтрокаЗаявки
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.СтрокаПрихода КАК СтрокаПрихода,
						|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.СтрокаЗаявки КАК СтрокаЗаявки,
						|	СУММА(ПоступлениеТоваровУслугРазмещениеСтрокПрихода.Количество) КАК Количество,
						|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.Номенклатура
						|ПОМЕСТИТЬ втРазмПоступ
						|ИЗ
						|	Документ.ПоступлениеТоваровУслуг.РазмещениеСтрокПрихода КАК ПоступлениеТоваровУслугРазмещениеСтрокПрихода
						|ГДЕ
						|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.Ссылка = &ДокументОснование
						|
						|СГРУППИРОВАТЬ ПО
						|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.СтрокаПрихода,
						|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.СтрокаЗаявки,
						|	ПоступлениеТоваровУслугРазмещениеСтрокПрихода.Номенклатура
						|
						|ИНДЕКСИРОВАТЬ ПО
						|	СтрокаПрихода,
						|	СтрокаЗаявки
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ПоступлениеТоваровУслугПричиныОтказов.СтрокаПрихода КАК СтрокаПрихода,
						|	ПоступлениеТоваровУслугПричиныОтказов.СтрокаЗаявки КАК СтрокаЗаявки,
						|	СУММА(ПоступлениеТоваровУслугПричиныОтказов.Количество) КАК Количество
						|ПОМЕСТИТЬ втОтказы
						|ИЗ
						|	Документ.ПоступлениеТоваровУслуг.ПричиныОтказов КАК ПоступлениеТоваровУслугПричиныОтказов
						|ГДЕ
						|	ПоступлениеТоваровУслугПричиныОтказов.Ссылка = &ДокументОснование
						|
						|СГРУППИРОВАТЬ ПО
						|	ПоступлениеТоваровУслугПричиныОтказов.СтрокаПрихода,
						|	ПоступлениеТоваровУслугПричиныОтказов.СтрокаЗаявки
						|
						|ИНДЕКСИРОВАТЬ ПО
						|	СтрокаПрихода,
						|	СтрокаЗаявки
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						//Валиахметов XX-2251 Загрузка Размещения Топлог 03.04.2019
						|	ВложенныйЗапрос.Номенклатура,
						//Конец Валиахметов XX-2251 Загрузка Размещения Топлог 03.04.2019
						|	втРазмПоступ.СтрокаПрихода,
						|	втРазмПоступ.СтрокаЗаявки,
						|	втРазмПоступ.Количество - ЕСТЬNULL(втОтказы.Количество, 0) КАК КоличествоПлан
						|ИЗ
						|	втРазмПоступ КАК втРазмПоступ
						|		ЛЕВОЕ СОЕДИНЕНИЕ втОтказы КАК втОтказы
						|		ПО втРазмПоступ.СтрокаПрихода = втОтказы.СтрокаПрихода
						|			И втРазмПоступ.СтрокаЗаявки = втОтказы.СтрокаЗаявки
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
						|			ПоступлениеТоваровУслугТовары.СтрокаПрихода КАК СтрокаПрихода,
						|			МАКСИМУМ(ПоступлениеТоваровУслугТовары.Номенклатура) КАК Номенклатура
						|		ИЗ
						|			Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
						|		ГДЕ
						|			ПоступлениеТоваровУслугТовары.Ссылка = &ДокументОснование
						|		
						|		СГРУППИРОВАТЬ ПО
						|			ПоступлениеТоваровУслугТовары.СтрокаПрихода) КАК ВложенныйЗапрос
						|		ПО втРазмПоступ.СтрокаПрихода = ВложенныйЗапрос.СтрокаПрихода
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	втРазмещено.Номенклатура,
						|	втРазмещено.СтрокаПрихода,
						|	втРазмещено.СтрокаЗаявки,
						|	втРазмещено.КоличествоПлан
						|ИЗ
						|	втРазмещено КАК втРазмещено";
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ОстаткиСтрокПрихода = Результаты[3].Выгрузить();
	Размещено = Результаты[4].Выгрузить();
	
	ВыходнаяТаблица = Новый ТаблицаЗначений;
	ВыходнаяТаблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	ВыходнаяТаблица.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
	ВыходнаяТаблица.Колонки.Добавить("СтрокаПрихода", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокПриходов"));
	ВыходнаяТаблица.Колонки.Добавить("КоличествоПлан", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	Отбор = Новый Структура("Номенклатура,СтрокаЗаявки,СтрокаПрихода");
	ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Размещено, ОстаткиСтрокПрихода, ВыходнаяТаблица, "КоличествоПлан");
	
	Отбор = Новый Структура("Номенклатура,СтрокаЗаявки");
	ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Размещено, ОстаткиСтрокПрихода, ВыходнаяТаблица, "КоличествоПлан");
	
	Отбор = Новый Структура("Номенклатура");
	ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор, Размещено, ОстаткиСтрокПрихода, ВыходнаяТаблица, "КоличествоПлан");
		
	Возврат ОстаткиСтрокПрихода;
	
КонецФункции

Функция ОстаткиСтрокПриходаДляПеремещения(ДокументОснование, ДокСсылка)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ОстаткиСтрокПриходаДляПеремещения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Организация,
		               |	ПеремещениеТоваровТовары.СтрокаПрихода,
		               |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
		               |ПОМЕСТИТЬ втМинус
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка.ДокументОснование = &ДокументОснование
		               |	И (ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная, ИСТИНА)
		               |			ИЛИ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка)
		               |	И ПеремещениеТоваровТовары.Ссылка <> &Ссылка
		               |	И ПеремещениеТоваровТовары.Ссылка.Проведен
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Организация,
		               |	ПеремещениеТоваровТовары.СтрокаПрихода
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Организация,
		               |	ПеремещениеТоваровТовары.СтрокаПрихода,
		               |	ПеремещениеТоваровТовары.СтрокаЗаявки,
		               |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
		               |ПОМЕСТИТЬ втМинусПоСтрокамЗаявок
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка.ДокументОснование = &ДокументОснование
		               |	И НЕ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная, ИСТИНА)
		               |	И НЕ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка
		               |	И ПеремещениеТоваровТовары.Ссылка <> &Ссылка
		               |	И ПеремещениеТоваровТовары.Ссылка.Проведен
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Организация,
		               |	ПеремещениеТоваровТовары.СтрокаПрихода,
		               |	ПеремещениеТоваровТовары.СтрокаЗаявки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Организация,
		               |	ПеремещениеТоваровТовары.СтрокаПрихода,
		               |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
		               |ПОМЕСТИТЬ втПлюс
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &ДокументОснование
		               |	И (ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная, ИСТИНА)
		               |			ИЛИ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Организация,
		               |	ПеремещениеТоваровТовары.СтрокаПрихода
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Организация,
		               |	ПеремещениеТоваровТовары.СтрокаПрихода,
		               |	ПеремещениеТоваровТовары.СтрокаЗаявки,
		               |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество
		               |ПОМЕСТИТЬ втПлюсПоСтрокамЗаявок
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &ДокументОснование
		               |	И НЕ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная, ИСТИНА)
		               |	И НЕ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ПеремещениеТоваровТовары.Номенклатура,
		               |	ПеремещениеТоваровТовары.Организация,
		               |	ПеремещениеТоваровТовары.СтрокаПрихода,
		               |	ПеремещениеТоваровТовары.СтрокаЗаявки
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	втПлюс.Номенклатура,
		               |	втПлюс.Организация,
		               |	втПлюс.СтрокаПрихода,
		               |	втПлюс.Количество КАК Количество
		               |ИЗ
		               |	втПлюс КАК втПлюс
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	втМинус.Номенклатура,
		               |	втМинус.Организация,
		               |	втМинус.СтрокаПрихода,
		               |	втМинус.Количество
		               |ИЗ
		               |	втМинус КАК втМинус
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	втПлюсПоСтрокамЗаявок.Номенклатура,
		               |	втПлюсПоСтрокамЗаявок.Организация,
		               |	втПлюсПоСтрокамЗаявок.СтрокаЗаявки,
		               |	втПлюсПоСтрокамЗаявок.СтрокаПрихода,
		               |	втПлюсПоСтрокамЗаявок.Количество КАК Количество
		               |ИЗ
		               |	втПлюсПоСтрокамЗаявок КАК втПлюсПоСтрокамЗаявок
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	втМинусПоСтрокамЗаявок.Номенклатура,
		               |	втМинусПоСтрокамЗаявок.Организация,
		               |	втМинусПоСтрокамЗаявок.СтрокаПрихода,
		               |	втМинусПоСтрокамЗаявок.СтрокаЗаявки,
		               |	втМинусПоСтрокамЗаявок.Количество
		               |ИЗ
		               |	втМинусПоСтрокамЗаявок КАК втМинусПоСтрокамЗаявок";
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("ПустаяЗаявка", Документы.ЗаявкаПокупателя.ПустаяСсылка());	
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ОстаткиСтрокПрихода = Результаты[4].Выгрузить();
	Размещено = Результаты[5].Выгрузить();
	
	ВыходнаяТаблица = Новый ТаблицаЗначений;
	ВыходнаяТаблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	ВыходнаяТаблица.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации")); 
	ВыходнаяТаблица.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
	ВыходнаяТаблица.Колонки.Добавить("СтрокаПрихода", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокПриходов"));
	ВыходнаяТаблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	Отбор = Новый Структура("Номенклатура,Организация,СтрокаПрихода");
	ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор,Размещено, ОстаткиСтрокПрихода, ВыходнаяТаблица, "Количество");
	
	Отбор = Новый Структура("Номенклатура,Организация");
	ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор,Размещено, ОстаткиСтрокПрихода, ВыходнаяТаблица, "Количество");
	
	Отбор = Новый Структура("Номенклатура");
	ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор,Размещено, ОстаткиСтрокПрихода, ВыходнаяТаблица, "Количество");
	
	ОстаткиСтрокПриходаПоСтрокамЗаявок = Результаты[6].Выгрузить();
	РазмещеноСтрокамЗаявок = Результаты[7].Выгрузить();
	
	ВыходнаяТаблица2 = Новый ТаблицаЗначений;
	ВыходнаяТаблица2.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	ВыходнаяТаблица2.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации")); 
	ВыходнаяТаблица2.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
	ВыходнаяТаблица2.Колонки.Добавить("СтрокаПрихода", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокПриходов"));
	ВыходнаяТаблица2.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	Отбор = Новый Структура("Номенклатура,Организация,СтрокаЗаявки,СтрокаПрихода");
	ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор,РазмещеноСтрокамЗаявок, ОстаткиСтрокПриходаПоСтрокамЗаявок, ВыходнаяТаблица2, "Количество");
	
	Отбор = Новый Структура("Номенклатура,Организация,СтрокаЗаявки");
	ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор,РазмещеноСтрокамЗаявок, ОстаткиСтрокПриходаПоСтрокамЗаявок, ВыходнаяТаблица2, "Количество");
	
	Отбор = Новый Структура("Номенклатура,СтрокаЗаявки");
	ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор,РазмещеноСтрокамЗаявок, ОстаткиСтрокПриходаПоСтрокамЗаявок, ВыходнаяТаблица2, "Количество");
	
	Отбор = Новый Структура("Номенклатура");
	ОбщегоНазначения.РаспределитьТаблицу1ПоТаблице2(Отбор,РазмещеноСтрокамЗаявок, ОстаткиСтрокПриходаПоСтрокамЗаявок, ВыходнаяТаблица2, "Количество");
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ОстаткиСтрокПрихода", ОстаткиСтрокПрихода);
	СтруктураТаблиц.Вставить("ОстаткиСтрокПриходаПоСтрокамЗаявок", ОстаткиСтрокПриходаПоСтрокамЗаявок);
	
	Возврат СтруктураТаблиц;
	
КонецФункции

Процедура ОтложенноеПроведениеРазмещений() Экспорт 
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ОтложенноеПроведениеРазмещений";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОтложенноеПроведениеДокументовИзТопЛог.СсылкаНаДокумент
	               |ИЗ
	               |	РегистрСведений.ОтложенноеПроведениеДокументовИзТопЛог КАК ОтложенноеПроведениеДокументовИзТопЛог
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОтложенноеПроведениеДокументовИзТопЛог.СсылкаНаДокумент.МоментВремени";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Автоматический);
		Попытка
			ДокОбъект = Выборка.СсылкаНаДокумент.ПолучитьОбъект();
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
			лНаборЗаписей = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
			лНаборЗаписей.Отбор.СсылкаНаДокумент.Установить(Выборка.СсылкаНаДокумент);
			лНаборЗаписей.Записать(Истина);				
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

Процедура ЗарегистрироватьВОбменСТопЛог(вхОбъект) Экспорт 
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗарегистрироватьВОбменСТопЛог";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	
	Строки = вхОбъект.Товары.НайтиСтроки(Новый Структура("СтрокаЗаявки", Справочники.ИдентификаторыСтрокЗаявок.ПустаяСсылка()));
	Если Строки.Количество() > 0 Тогда 
		Для Каждого СтрокаТЧ Из Строки Цикл 
			СтрокаТЧ.СтрокаЗаявки = ОбщегоНазначенияКлиентСервер.ВиртуальнаяСтрокаЗаявки();
		КонецЦикла;
		#Если Клиент Тогда
		Сообщить("Созданы виртуальные строки заявок");
		#КонецЕсли
	КонецЕсли;
	
	вхОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Узел = ОбменДаннымиКлиентСервер.ПолучитьИсходящийУзелОбмена(Метаданные.ПланыОбмена.ОбменПартКом83_TopLog, 3);
	
	Если ЗначениеЗаполнено(Узел) Тогда 
		ПланыОбмена.ЗарегистрироватьИзменения(Узел, вхОбъект.Ссылка);
		#Если Клиент Тогда
		Сообщить("Документ зарегистрирован в обмене с Топ Лог");
		#КонецЕсли
	Иначе
		#Если Клиент Тогда
		Сообщить("Не найден узел обмена для выгрузки в Топ Лог");
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗагрузитьРезультатСборки(ОбъектXDTO, вхПараметры, СтруктураОтчета = Неопределено)
	
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗагрузитьРезультатСборки";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////
	
	Если ЗначениеЗаполнено(ОбъектXDTO.ЗаказСсылка) Тогда 
		ДокСсылка = Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗаказСсылка));
		
		Если ОбменДаннымиКлиентСервер.ЭтоБитаяСсылка(ДокСсылка) Тогда 
			ВызватьИсключение "Не найдено перемещение товаров с guid = " + ОбъектXDTO.ЗаказСсылка;
		КонецЕсли;
	Иначе
		ДокСсылка = Документы.ПеремещениеТоваров.НайтиПоНомеру(ОбщегоНазначения.ПреобразоватьНомер(ОбъектXDTO.ЗаказНомер), ТекущаяДата());
		Если Не ЗначениеЗаполнено(ДокСсылка) Тогда 
			ВызватьИсключение "Не найдено перемещение товаров с номером = " + ОбъектXDTO.ЗаказНомер;
		КонецЕсли;
	КонецЕсли;
	
	РазрешитьПревышениеКоличестваПлан = ПроведениеДокументовКлиентСервер.РазрешитьПревышениеКоличестваПлан();
	БылоПревышениеКоличестваПлан = Ложь;
	
	ТоварыXDTO = ОбъектXDTO.Товары.ПолучитьСписок("СтрокаТовары");
	
	МассивSSID = Новый Массив;
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
		Если ЗначениеЗаполнено(СтрокаТовары.SSID) Тогда 
			МассивSSID.Добавить(СтрокаТовары.SSID);  
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки КАК СтрокаЗаявки,
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки.IDSite КАК SSID,
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная КАК Виртуальная,
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка КАК Заявка,
	                |	СУММА(ПеремещениеТоваровТовары.КоличествоПлан) КАК КоличествоПлан
	                |ИЗ
	                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                |ГДЕ
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки.IDSite В(&МассивSSID)
	                |	И ПеремещениеТоваровТовары.Ссылка = &Ссылка
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки.IDSite,
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная,
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка";
	Запрос.УстановитьПараметр("МассивSSID", МассивSSID);
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	ТаблицаSSIDВДокументе = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ИдентификаторыСтрокЗаявок.Ссылка КАК СтрокаЗаявки,
	                |	ИдентификаторыСтрокЗаявок.IDSite КАК SSID,
	                |	ИдентификаторыСтрокЗаявок.Виртуальная КАК Виртуальная,
	                |	ИдентификаторыСтрокЗаявок.Заявка КАК Заявка
	                |ИЗ
	                |	Справочник.ИдентификаторыСтрокЗаявок КАК ИдентификаторыСтрокЗаявок
	                |ГДЕ
	                |	ИдентификаторыСтрокЗаявок.IDSite В(&МассивSSID)";
	Запрос.УстановитьПараметр("МассивSSID", МассивSSID);
	
	СоотвSSID = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Структура = Новый Структура("СтрокаЗаявки,Виртуальная,Заявка");
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
		СоотвSSID.Вставить(Выборка.SSID, Структура);	
	КонецЦикла;
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	//Товары.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
	Товары.Колонки.Добавить("Факт", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	//Товары.Колонки.Добавить("Качество", Новый ОписаниеТипов("СправочникСсылка.Качество"));
	
	ТоварыПоСтрокамЗаявок = Новый ТаблицаЗначений;
	ТоварыПоСтрокамЗаявок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	ТоварыПоСтрокамЗаявок.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
	ТоварыПоСтрокамЗаявок.Колонки.Добавить("Факт", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
		Строки = ТаблицаSSIDВДокументе.НайтиСтроки(Новый Структура("SSID", СтрокаТовары.SSID));
		Если Строки.Количество() = 0 Тогда 
			РеквизитыSSID = СоотвSSID[СтрокаТовары.SSID];
			Если ЗначениеЗаполнено(СтрокаТовары.SSID) И Не ЗначениеЗаполнено(РеквизитыSSID) Тогда 
				ВызватьИсключение "Не найдена строка заявки с IDSite = " + СтрокаТовары.SSID;
			КонецЕсли;
			ЗагрузитьРезультатСборкиФрагмент(РеквизитыSSID, СтрокаТовары, Товары, ТоварыПоСтрокамЗаявок, СтрокаТовары.Факт);
		Иначе
			КоличествоРаспределить = СтрокаТовары.Факт;
			Индекс = 0;
			Пока КоличествоРаспределить > 0 И Индекс < Строки.Количество() Цикл 
				СтрокаТаблицаSSIDВДокументе = Строки.Получить(Индекс);
				СписываемоеКоличество = Мин(КоличествоРаспределить, СтрокаТаблицаSSIDВДокументе.КоличествоПлан);
				Если СписываемоеКоличество > 0 Тогда 
					РеквизитыSSID = СтрокаТаблицаSSIDВДокументе;	
					ЗагрузитьРезультатСборкиФрагмент(РеквизитыSSID, СтрокаТовары, Товары, ТоварыПоСтрокамЗаявок, СписываемоеКоличество);
				КонецЕсли;
				КоличествоРаспределить = КоличествоРаспределить - СписываемоеКоличество;
				СтрокаТаблицаSSIDВДокументе.КоличествоПлан = СтрокаТаблицаSSIDВДокументе.КоличествоПлан - СписываемоеКоличество;
				Индекс = Индекс + 1;
			КонецЦикла;
			Если КоличествоРаспределить > 0 Тогда 
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.НоменклатураСсылка));
				НоваяСтрока.Факт = КоличествоРаспределить;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТоварыПоСтрокамЗаявок.Свернуть("Номенклатура,СтрокаЗаявки", "Факт");
	Товары.Свернуть("Номенклатура", "Факт");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПеремещениеТоваровТовары.Номенклатура,
	                |	ПеремещениеТоваровТовары.Количество КАК Факт
	                |ИЗ
	                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                |ГДЕ
	                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	                |	И ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная, ИСТИНА
	                |				ИЛИ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ПеремещениеТоваровТовары.Номенклатура,
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	                |	ПеремещениеТоваровТовары.Количество КАК Факт
	                |ИЗ
	                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                |ГДЕ
	                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	                |	И НЕ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная, ИСТИНА)
	                |	И НЕ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка";
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПустаяЗаявка", Документы.ЗаявкаПокупателя.ПустаяСсылка());
	Результаты = Запрос.ВыполнитьПакет();
	
	//ТоварыДокумента = Результаты[0].Выгрузить();
	//ТоварыДокументаПоСтрокамЗаявок = Результаты[1].Выгрузить();
	
	ТоварыДокумента = Новый ТаблицаЗначений;
	ТоварыДокумента.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТоварыДокумента.Колонки.Добавить("Факт", ОбщегоНазначения.ОписаниеТипаЧисло(15,3, ДопустимыйЗнак.Любой));

	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Результаты[0].Выгрузить(), ТоварыДокумента);
	
	ТоварыДокументаПоСтрокамЗаявок = Новый ТаблицаЗначений;
	ТоварыДокументаПоСтрокамЗаявок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТоварыДокументаПоСтрокамЗаявок.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
	ТоварыДокументаПоСтрокамЗаявок.Колонки.Добавить("Факт", ОбщегоНазначения.ОписаниеТипаЧисло(15,3, ДопустимыйЗнак.Любой));

	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(Результаты[1].Выгрузить(), ТоварыДокументаПоСтрокамЗаявок);

	Дельта = Неопределено;
	Дельта2 = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПеремещениеТоваров.Ссылка
	               |ИЗ
	               |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |ГДЕ
	               |	НЕ ПеремещениеТоваров.ПометкаУдаления
	               |	И ПеремещениеТоваров.Проведен
	               |	И ПеремещениеТоваров.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.ПеремещениеТоваровПоступил)
	               |	И ПеремещениеТоваров.Ссылка = &Ссылка
	               |	И ПеремещениеТоваров.ОбновленИзТопЛог";
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка); 			   
	РезультатЗапроса = Запрос.Выполнить();
	НужноМенятьШапку = РезультатЗапроса.Пустой();
	НужноМенятьТЧ =  Не РаботаСПоследовательностямиКлиентСервер.ТаблицыИдентичныНовое(ТоварыДокумента, Товары, Дельта, "Факт");
	НужноМенятьТЧ2 =  Не РаботаСПоследовательностямиКлиентСервер.ТаблицыИдентичныНовое(ТоварыДокументаПоСтрокамЗаявок, ТоварыПоСтрокамЗаявок, Дельта2, "Факт");
	Если НужноМенятьШапку Или НужноМенятьТЧ Или НужноМенятьТЧ2 Тогда
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		Для Каждого СтрокаДельты Из Дельта2 Цикл
			Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура,СтрокаЗаявки", СтрокаДельты.Номенклатура, СтрокаДельты.СтрокаЗаявки));
			
			Если Строки.Количество() = 0 И РазрешитьПревышениеКоличестваПлан  Тогда
				НоваяСтрока = ДокОбъект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДельты); 
				НоваяСтрока.ЕдиницаИзмерения 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ЕдиницаХраненияОстатков");
				НоваяСтрока.Коэффициент			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.ЕдиницаИзмерения, "Коэффициент");
				НоваяСтрока.Качество 			= Справочники.Качество.Новый;
				НоваяСтрока.Количество			= 0;
				НоваяСтрока.КоличествоПлан		= СтрокаДельты.Факт;
				НоваяСтрока.Организация			= ОрганизацияОстаткаПартий(НоваяСтрока.Номенклатура, ДокОбъект.СкладОтправитель, ДокОбъект.Дата);
				
				Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура,СтрокаЗаявки", СтрокаДельты.Номенклатура, СтрокаДельты.СтрокаЗаявки));
				БылоПревышениеКоличестваПлан = Истина;
			КонецЕсли;
			
			Если Строки.Количество() = 0 Тогда
				ВызватьИсключение "Не найдена строка с номенклатурой " + СтрокаДельты.Номенклатура +  " и строкой заявки " + СтрокаДельты.СтрокаЗаявки;	
			КонецЕсли;
			
			Если СтрокаДельты.Факт > 0 Тогда 
				КоличествоДобавить = СтрокаДельты.Факт;
				
				Индекс = 0;
				Пока КоличествоДобавить > 0 и Индекс < Строки.Количество() Цикл 
					СтрокаТЧ = Строки.Получить(Индекс);
					МожноДобавить = Макс(0,СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество);
					
					ДобавляемоеКоличество = Мин(МожноДобавить, КоличествоДобавить);
					СтрокаТЧ.Количество = СтрокаТЧ.Количество + ДобавляемоеКоличество;
					СтрокаТЧ.КоличествоНеПринято = СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество;
					
					КоличествоДобавить = КоличествоДобавить - ДобавляемоеКоличество;
					Индекс = Индекс + 1;
				КонецЦикла;
				Если КоличествоДобавить > 0 Тогда
					Если РазрешитьПревышениеКоличестваПлан Тогда
						СтрокаТЧ.Количество = СтрокаТЧ.Количество + КоличествоДобавить; //Если факт превышает план, добавим остаток в последнюю строку 
						СтрокаТЧ.КоличествоНеПринято = СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество;
						БылоПревышениеКоличестваПлан = Истина;
					Иначе
						ВызватьИсключение "По номенклатуре " + СтрокаДельты.Номенклатуры + " факт превышает план";
					КонецЕсли;
				КонецЕсли;
			Иначе
				КоличествоУбрать = - СтрокаДельты.Факт;
				Индекс = 0;
				Пока КоличествоУбрать > 0 и Индекс < Строки.Количество() Цикл
					СтрокаТЧ = Строки.Получить(Индекс);
					МожноУбрать = СтрокаТЧ.Количество;
					УбираемоеКоличество = Мин(МожноУбрать, КоличествоУбрать);
					СтрокаТЧ.Количество = СтрокаТЧ.Количество - УбираемоеКоличество;
					
					КоличествоУбрать = КоличествоУбрать - УбираемоеКоличество;
					Индекс = Индекс + 1;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаДельты Из Дельта Цикл
						
			Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаДельты.Номенклатура));
			КоличествоСтрок = Строки.Количество();
			
			Для Шаг = 0 По КоличествоСтрок - 1 Цикл 
				СтрокаТЧ = Строки.Получить(КоличествоСтрок - 1 - Шаг);
				Если ЗначениеЗаполнено(СтрокаТЧ.СтрокаЗаявки) Тогда 
					Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.СтрокаЗаявки, "Виртуальная,Заявка");
					Если Не Реквизиты.Виртуальная И ЗначениеЗаполнено(Реквизиты.Заявка) Тогда 
						Строки.Удалить(Строки.Найти(СтрокаТЧ));
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Если Строки.Количество() = 0 И РазрешитьПревышениеКоличестваПлан  Тогда
				НоваяСтрока = ДокОбъект.Товары.Добавить();
				НоваяСтрока.Номенклатура		= СтрокаДельты.Номенклатура; 
				НоваяСтрока.СтрокаЗаявки 		= ОбщегоНазначенияКлиентСервер.ВиртуальнаяСтрокаЗаявки();
				НоваяСтрока.ЕдиницаИзмерения 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ЕдиницаХраненияОстатков");
				НоваяСтрока.Коэффициент			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.ЕдиницаИзмерения, "Коэффициент");
				НоваяСтрока.Качество 			= Справочники.Качество.Новый;
				НоваяСтрока.Количество			= 0;
				НоваяСтрока.КоличествоПлан		= СтрокаДельты.Факт;
				НоваяСтрока.Организация			= ОрганизацияОстаткаПартий(НоваяСтрока.Номенклатура, ДокОбъект.СкладОтправитель, ДокОбъект.Дата);
				
				Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаДельты.Номенклатура));
				БылоПревышениеКоличестваПлан = Истина;
			КонецЕсли;

			
			Если Строки.Количество() = 0 Тогда 
				ВызватьИсключение "Не найдена строка с номенклатурой " + СтрокаДельты.Номенклатура;	
			КонецЕсли;
			
			Если СтрокаДельты.Факт > 0 Тогда 
				КоличествоДобавить = СтрокаДельты.Факт;
				
				Индекс = 0;
				Пока КоличествоДобавить > 0 и Индекс < Строки.Количество() Цикл 
					СтрокаТЧ = Строки.Получить(Индекс);
					МожноДобавить = Макс(0,СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество);
					
					ДобавляемоеКоличество = Мин(МожноДобавить, КоличествоДобавить);
					СтрокаТЧ.Количество = СтрокаТЧ.Количество + ДобавляемоеКоличество;
					СтрокаТЧ.КоличествоНеПринято = СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество;
					
					КоличествоДобавить = КоличествоДобавить - ДобавляемоеКоличество;
					Индекс = Индекс + 1;
				КонецЦикла;
				Если КоличествоДобавить > 0 Тогда
					Если РазрешитьПревышениеКоличестваПлан Тогда
						СтрокаТЧ.Количество = СтрокаТЧ.Количество + КоличествоДобавить; //Если факт превышает план, добавим остаток в последнюю строку
						СтрокаТЧ.КоличествоНеПринято = СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество;
						БылоПревышениеКоличестваПлан = Истина;
					Иначе
						ВызватьИсключение "По номенклатуре " + СтрокаДельты.Номенклатура + " факт превышает план";
					КонецЕсли;
				КонецЕсли;
			Иначе
				КоличествоУбрать = - СтрокаДельты.Факт;
				Индекс = 0;
				Пока КоличествоУбрать > 0 и Индекс < Строки.Количество() Цикл
					СтрокаТЧ = Строки.Получить(Индекс);
					МожноУбрать = СтрокаТЧ.Количество;
					УбираемоеКоличество = Мин(МожноУбрать, КоличествоУбрать);
					СтрокаТЧ.Количество = СтрокаТЧ.Количество - УбираемоеКоличество;
					
					КоличествоУбрать = КоличествоУбрать - УбираемоеКоличество;
					Индекс = Индекс + 1;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ДокОбъект.ПометкаУдаления = Ложь;
		ДокОбъект.ОбновленИзТопЛог = Истина;
		ДокОбъект.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил;
		ДокОбъект.ДополнительныеСвойства.Вставить("ОтключитьКонтрольОстатков");
		
		Если БылоПревышениеКоличестваПлан Тогда
			ТекстКомментарий = "/Превышение количества план при загрузке из Топлог/";
			Если СтрНайти(ДокОбъект.Комментарий, ТекстКомментарий) = 0 Тогда
				ДокОбъект.Комментарий = ДокОбъект.Комментарий + " " + ТекстКомментарий;
			КонецЕсли;
			//ДокОбъект.ДополнительныеСвойства.Вставить("НеПерепроводитьПартии", Ложь);
		Иначе
			//ДокОбъект.ДополнительныеСвойства.Вставить("НеПерепроводитьПартии", Истина);
		КонецЕсли;
		
		Если //РазрешитьПревышениеКоличестваПлан 
			БылоПревышениеКоличестваПлан  Тогда
			ЗаполнитьОрганизацииТЧТоварыПоПартиям(ДокОбъект); // в разработке
		КонецЕсли;
		//НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		//Попытка
		#Если Сервер Тогда 
			ОбменСТопЛогСервер.УстановитьПризнакНаличияПроведения(вхПараметры);
		#КонецЕсли
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		#Если Сервер Тогда 
			ОбменСТопЛогСервер.УстановитьПризнакУспешногоПроведения(вхПараметры);
		#КонецЕсли
		
		//Если ДокОбъект.ДополнительныеСвойства.НеПерепроводитьПартии И ДокОбъект.Дата >= Константы.ДатаДокументОснованиеПартииТоваров.Получить() И ДокОбъект.СкладПолучатель.ТоварыВПути Тогда 
			//	Набор = РегистрыНакопления.ПартииТоваров.СоздатьНаборЗаписей();
			//	Набор.Отбор.Регистратор.Установить(ДокОбъект.Ссылка);
			//	Набор.Прочитать();
			//	Для Каждого Запись Из Набор Цикл 
			//		Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход Тогда 
			//			Запись.ДокументОснование = ДокОбъект.Ссылка;
			//		КонецЕсли;
			//	КонецЦикла;
			//КонецЕсли;
			//ЗафиксироватьТранзакцию();
		//Исключение
		//	ОтменитьТранзакцию();
		//	ВызватьИсключение ОписаниеОшибки();
		//КонецПопытки;
		//Семенов И.П. 12.02.2019 XX-1768(
		ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокОбъект.Ссылка, ОбъектXDTO);
		//)Семенов И.П.
		
		// 25.03.19 Строганов Роман > 
		ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокОбъект.Ссылка, Истина, Ложь);
		// 25.03.19 Строганов Роман <

		НомерСообщения = ?(вхПараметры = Неопределено, 0, вхПараметры.НомерСообщения);
		НомерПотока = ?(вхПараметры = Неопределено, 0, вхПараметры.НомерПотока);
		РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(ДокОбъект.Ссылка, НомерСообщения, , , , Ложь, НомерПотока); 
	Иначе
		// 25.03.19 Строганов Роман > 
		ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокСсылка, Истина, Ложь);
		// 25.03.19 Строганов Роман <
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьРезультатСборкиФрагмент(РеквизитыSSID, СтрокаТовары, Товары, ТоварыПоСтрокамЗаявок, Факт)
	
	Перем НоваяСтрока;
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗагрузитьРезультатСборкиФрагмент";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	
	Если Не ЗначениеЗаполнено(СтрокаТовары.SSID) Или РеквизитыSSID.Виртуальная Или Не ЗначениеЗаполнено(РеквизитыSSID.Заявка) Тогда 
		НоваяСтрока = Товары.Добавить();
	Иначе
		НоваяСтрока = ТоварыПоСтрокамЗаявок.Добавить();
		НоваяСтрока.СтрокаЗаявки = РеквизитыSSID.СтрокаЗаявки;
	КонецЕсли;
	
	НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.НоменклатураСсылка));
	НоваяСтрока.Факт = Факт;
КонецПроцедуры

Процедура ЗагрузитьРезультатПриемки(ОбъектXDTO, вхПараметры, СтруктураОтчета = Неопределено)
	
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗагрузитьРезультатПриемки";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////
		
	Если ЗначениеЗаполнено(ОбъектXDTO.ЗаказСсылка) Тогда 
		ДокСсылка = Документы.ПеремещениеТоваров.ПолучитьСсылку(Новый УникальныйИдентификатор(ОбъектXDTO.ЗаказСсылка));
		Если ОбменДаннымиКлиентСервер.ЭтоБитаяСсылка(ДокСсылка) Тогда 
			ВызватьИсключение "Не найдено перемещение товаров с guid = " + ОбъектXDTO.ЗаказСсылка;
		КонецЕсли;
	Иначе
		ДокСсылка = Документы.ПеремещениеТоваров.НайтиПоНомеру(ОбщегоНазначения.ПреобразоватьНомер(ОбъектXDTO.ЗаказНомер), ТекущаяДата());
		Если Не ЗначениеЗаполнено(ДокСсылка) Тогда 
			ВызватьИсключение "Не найдено перемещение товаров с номером = " + ОбъектXDTO.ЗаказНомер;
		КонецЕсли;
	КонецЕсли;
	
	РазрешитьПревышениеКоличестваПлан = ПроведениеДокументовКлиентСервер.РазрешитьПревышениеКоличестваПлан();
	БылоПревышениеКоличестваПлан = Ложь;
	
	СкладОтправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокСсылка, "СкладОтправитель");
	ОбменСTopLog = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СкладОтправитель, "ОбменСTopLog");
	Если ОбменСTopLog Тогда 
		Возврат; //Это заказ на отгрузку, грузим только размещения
	КонецЕсли;
	
	ТоварыXDTO = ОбъектXDTO.Товары.ПолучитьСписок("СтрокаТовары");
	
	МассивSSID = Новый Массив;
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
		Если ЗначениеЗаполнено(СтрокаТовары.SSID) Тогда 
			МассивSSID.Добавить(СтрокаТовары.SSID);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ИдентификаторыСтрокЗаявок.Ссылка КАК СтрокаЗаявки,
	                |	ИдентификаторыСтрокЗаявок.IDSite КАК SSID,
	                |	ИдентификаторыСтрокЗаявок.Виртуальная КАК Виртуальная,
	                |	ИдентификаторыСтрокЗаявок.Заявка КАК Заявка
	                |ИЗ
	                |	Справочник.ИдентификаторыСтрокЗаявок КАК ИдентификаторыСтрокЗаявок
	                |ГДЕ
	                |	ИдентификаторыСтрокЗаявок.IDSite В(&МассивSSID)";
	Запрос.УстановитьПараметр("МассивSSID", МассивSSID);
	
	СоотвSSID = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Структура = Новый Структура("СтрокаЗаявки,Виртуальная,Заявка");
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
		СоотвSSID.Вставить(Выборка.SSID, Структура);	
	КонецЦикла;
	

	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	Товары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	ТоварыПоСтрокамЗаявок = Новый ТаблицаЗначений;
	ТоварыПоСтрокамЗаявок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	ТоварыПоСтрокамЗаявок.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
	ТоварыПоСтрокамЗаявок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
		
		Если СтрокаТовары.ЭтоБрак Тогда 
			Продолжить;
		КонецЕсли;
		
		РеквизитыSSID = СоотвSSID[СтрокаТовары.SSID];
		
		Если ЗначениеЗаполнено(СтрокаТовары.SSID) И Не ЗначениеЗаполнено(РеквизитыSSID) Тогда 
			ВызватьИсключение "Не найдена строка заявки с IDSite = " + СтрокаТовары.SSID;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТовары.SSID) Или РеквизитыSSID.Виртуальная Или Не ЗначениеЗаполнено(РеквизитыSSID.Заявка) Тогда 
			НоваяСтрока = Товары.Добавить();
		Иначе
			НоваяСтрока = ТоварыПоСтрокамЗаявок.Добавить();
			НоваяСтрока.СтрокаЗаявки = РеквизитыSSID.СтрокаЗаявки;
		КонецЕсли;
				
		НоваяСтрока.Количество = СтрокаТовары.КоличествоПринято;
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.НоменклатураСсылка));
		
	КонецЦикла;
	
	Товары.Свернуть("Номенклатура", "Количество");
	ТоварыПоСтрокамЗаявок.Свернуть("Номенклатура,СтрокаЗаявки", "Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПеремещениеТоваровТовары.Номенклатура,
	                |	ПеремещениеТоваровТовары.Количество
	                |ИЗ
	                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                |ГДЕ
	                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	                |	И ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная, ИСТИНА
	                |				ИЛИ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка)
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ПеремещениеТоваровТовары.Номенклатура,
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	                |	ПеремещениеТоваровТовары.Количество
	                |ИЗ
	                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                |ГДЕ
	                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	                |	И НЕ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная, ИСТИНА)
	                |	И НЕ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка";
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПустаяЗаявка", Документы.ЗаявкаПокупателя.ПустаяСсылка());
	Результаты = Запрос.ВыполнитьПакет();
	
	ТоварыДокумента = Результаты[0].Выгрузить();
	ТоварыДокументаПоСтрокамЗаявок = Результаты[1].Выгрузить();
	
	Дельта = Неопределено;
	Дельта2 = Неопределено;
	
	НужноМенятьТЧ = Не РаботаСПоследовательностямиКлиентСервер.ТаблицыИдентичныНовое(ТоварыДокумента, Товары, Дельта, "Количество");
	НужноМенятьТЧ2 = Не РаботаСПоследовательностямиКлиентСервер.ТаблицыИдентичныНовое(ТоварыДокументаПоСтрокамЗаявок, ТоварыПоСтрокамЗаявок, Дельта2, "Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПеремещениеТоваров.Ссылка
	                |ИЗ
	                |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	                |ГДЕ
	                |	ПеремещениеТоваров.Ссылка = &Ссылка
	                |	И ПеремещениеТоваров.Проведен
	                |	И ПеремещениеТоваров.СтатусДокумента = &СтатусДокумента
	                |	И НЕ ПеремещениеТоваров.ПометкаУдаления
	                |	И ПеремещениеТоваров.ОбновленИзТопЛог";
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("СтатусДокумента", Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил);
	
	НужноМенятьШапку = Запрос.Выполнить().Пустой();
	
	Если НужноМенятьШапку Или НужноМенятьТЧ Или НужноМенятьТЧ2 Тогда 
		ДокОбъект = ДокСсылка.ПолучитьОбъект();
		Для Каждого СтрокаДельты Из Дельта2 Цикл 
			Если СтрокаДельты.Количество > 0 Тогда 
				КоличествоРаспределить = СтрокаДельты.Количество;
				Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура,СтрокаЗаявки", СтрокаДельты.Номенклатура, СтрокаДельты.СтрокаЗаявки));
				Индекс = 0;
				Пока КоличествоРаспределить > 0 И Индекс < Строки.Количество() Цикл 
					СтрокаТЧ = Строки.Получить(Индекс);
					МожноРаспределить = Мин(КоличествоРаспределить, Макс(СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество,0));
					
					СтрокаТЧ.Количество = СтрокаТЧ.Количество + МожноРаспределить;
					СтрокаТЧ.КоличествоНеПринято = СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество;
					
					КоличествоРаспределить = КоличествоРаспределить - МожноРаспределить;
					
					Индекс = Индекс + 1; 
				КонецЦикла;
				
				Если КоличествоРаспределить > 0 Тогда
					Если РазрешитьПревышениеКоличестваПлан Тогда
						СтрокаТЧ.Количество = СтрокаТЧ.Количество + КоличествоРаспределить;
						СтрокаТЧ.КоличествоНеПринято = СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество;
						БылоПревышениеКоличестваПлан = Истина;
					Иначе
						ВызватьИсключение "По номенклатуре " + СтрокаДельты.Номенклатуры + " факт превышает план";
					КонецЕсли;
				КонецЕсли;
			Иначе
				КоличествоУбрать = - СтрокаДельты.Количество;
				Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура,СтрокаЗаявки", СтрокаДельты.Номенклатура, СтрокаДельты.СтрокаЗаявки));
				Индекс = 0;
				Пока КоличествоУбрать > 0 И Индекс < Строки.Количество() Цикл
					СтрокаТЧ = Строки.Получить(Индекс);
					МожноУбрать = Мин(КоличествоУбрать, СтрокаТЧ.Количество);
					
					СтрокаТЧ.Количество = СтрокаТЧ.Количество - МожноУбрать;
					СтрокаТЧ.КоличествоНеПринято = СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество;
					
					КоличествоУбрать = КоличествоУбрать - МожноУбрать;
					
					Индекс = Индекс + 1; 
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаДельты Из Дельта Цикл 
			Если СтрокаДельты.Количество > 0 Тогда 
				КоличествоРаспределить = СтрокаДельты.Количество;
				Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаДельты.Номенклатура));
				Индекс = 0;
				Пока КоличествоРаспределить > 0 И Индекс < Строки.Количество() Цикл 
					СтрокаТЧ = Строки.Получить(Индекс);
					МожноРаспределить = Мин(КоличествоРаспределить, Макс(СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество,0));
					
					СтрокаТЧ.Количество = СтрокаТЧ.Количество + МожноРаспределить;
					СтрокаТЧ.КоличествоНеПринято = СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество;
					
					КоличествоРаспределить = КоличествоРаспределить - МожноРаспределить;
					
					Индекс = Индекс + 1; 
				КонецЦикла;
				
				Если КоличествоРаспределить > 0 Тогда
					Если РазрешитьПревышениеКоличестваПлан Тогда
						СтрокаТЧ.Количество = СтрокаТЧ.Количество + КоличествоРаспределить;
						СтрокаТЧ.КоличествоНеПринято = СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество;
						БылоПревышениеКоличестваПлан = Истина;
					Иначе
						ВызватьИсключение "По номенклатуре " + СтрокаДельты.Номенклатуры + " факт превышает план";
					КонецЕсли;
				КонецЕсли;
			Иначе
				КоличествоУбрать = - СтрокаДельты.Количество;
				Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаДельты.Номенклатура));
				Индекс = 0;
				Пока КоличествоУбрать > 0 И Индекс < Строки.Количество() Цикл
					СтрокаТЧ = Строки.Получить(Индекс);
					МожноУбрать = Мин(КоличествоУбрать, СтрокаТЧ.Количество);
					
					СтрокаТЧ.Количество = СтрокаТЧ.Количество - МожноУбрать;
					СтрокаТЧ.КоличествоНеПринято = СтрокаТЧ.КоличествоПлан - СтрокаТЧ.Количество;
					
					КоличествоУбрать = КоличествоУбрать - МожноУбрать;
					
					Индекс = Индекс + 1; 
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ДокОбъект.ПометкаУдаления = Ложь;
		ДокОбъект.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил;
		ДокОбъект.ОбновленИзТопЛог = Истина;
		
		Если БылоПревышениеКоличестваПлан Тогда
			ТекстКомментарий = "/Превышение количества план при загрузке из Топлог/";
			Если СтрНайти(ДокОбъект.Комментарий, ТекстКомментарий) = 0 Тогда
				ДокОбъект.Комментарий = ДокОбъект.Комментарий + " " + ТекстКомментарий;
			КонецЕсли;
		КонецЕсли;
		
		#Если Сервер Тогда 
			ОбменСТопЛогСервер.УстановитьПризнакНаличияПроведения(вхПараметры);
		#КонецЕсли
		
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		#Если Сервер Тогда 
			ОбменСТопЛогСервер.УстановитьПризнакУспешногоПроведения(вхПараметры);
		#КонецЕсли
		
		НомерСообщения = ?(вхПараметры = Неопределено, 0, вхПараметры.НомерСообщения);
		НомерПотока = ?(вхПараметры = Неопределено, 0, вхПараметры.НомерПотока);
		РегистрыСведений.ИсторияОбменаСТопЛогПоОбъектам.Добавить(ДокОбъект.Ссылка, НомерСообщения, , , , Ложь, НомерПотока);
		//Семенов И.П. 12.02.2019 XX-1768(
		ОбменДаннымиКлиентСервер.ДобавитьСтрокуИсторииПоОбъекту(ДокОбъект.Ссылка, ОбъектXDTO);
		//)Семенов И.П.
		
		// 25.03.19 Строганов Роман > 
		ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокОбъект.Ссылка, Истина, Ложь);
		// 25.03.19 Строганов Роман <
	Иначе
		// 25.03.19 Строганов Роман > 
		ОбменДаннымиКлиентСервер.ЗафиксироватьРезультатВСтруктуреОтчета(СтруктураОтчета, ДокСсылка, Истина, Ложь);
		// 25.03.19 Строганов Роман <
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьСтрокиЗаявок(вхСсылкаНаДокумент) Экспорт 
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗаполнитьСтрокиЗаявок";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПеремещениеТоваровТовары.НомерСтроки
	               |ИЗ
	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	               |ГДЕ
	               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	               |	И ПеремещениеТоваровТовары.СтрокаЗаявки = &ПустаяСтрокаЗаявки";
	Запрос.УстановитьПараметр("Ссылка", вхСсылкаНаДокумент);
	Запрос.УстановитьПараметр("ПустаяСтрокаЗаявки", Справочники.ИдентификаторыСтрокЗаявок.ПустаяСсылка());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ДокОбъект = вхСсылкаНаДокумент.ПолучитьОбъект();
	Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("СтрокаЗаявки", Справочники.ИдентификаторыСтрокЗаявок.ПустаяСсылка()));
	
	Для Каждого СтрокаТЧ Из Строки Цикл 
		СтрокаТЧ.СтрокаЗаявки =  ОбщегоНазначенияКлиентСервер.ВиртуальнаяСтрокаЗаявки();
	КонецЦикла;
	
	ДокОбъект.Записать();
	
КонецПроцедуры

Функция ОрганизацияОстаткаПартий(Номенклатура, Склад, ДатаОстатков)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ОрганизацияОстаткаПартий";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ОрганизацияОстаткаПартий = Справочники.Организации.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартииТоваровОстатки.Номенклатура,
		|	ПартииТоваровОстатки.Склад,
		|	ПартииТоваровОстатки.Организация
		|ИЗ
		|	РегистрНакопления.ПартииТоваров.Остатки(
		|			&ДатаОстатков,
		|			Номенклатура = &Номенклатура
		|				И Склад = &Склад) КАК ПартииТоваровОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПартииТоваровОстатки.КоличествоОстаток УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ОрганизацияОстаткаПартий = Выборка.Организация;	
	КонецЕсли;
	
	Возврат ОрганизацияОстаткаПартий;
	
КонецФункции

// Процедура - Заполнить организации ТЧТовары по партиям
//
// Параметры:
//  ДокОбъект		 - ДокументОбъект.ПеремещениеТоваров	 -  Редактируемый документ
//  УдалятьСтроки	 - Булево	 -  Если Истина то удаляются строки, по которым нет остатков партий
//
Процедура ЗаполнитьОрганизацииТЧТоварыПоПартиям(ДокОбъект, УдалятьСтроки = Ложь) Экспорт
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗаполнитьОрганизацииТЧТоварыПоПартиям";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	
	вхОтказ = Ложь;
	вхФильтр = Неопределено;
	
	ТЧТовары = ДокОбъект.Товары.Выгрузить();
	ТЧТовары.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ПеремещениеТоваров"));
	ТЧТовары.ЗаполнитьЗначения(ДокОбъект.Ссылка, "Ссылка");
	вхПараметры = Новый Структура;
	вхПараметры.Вставить("Товары", ТЧТовары);

	Товары = ТаблицыДляРасчетаСписанияПоПартиям(ДокОбъект.Ссылка,,вхПараметры);
	
	//Подставим количество из ТЧ объекта
	Для каждого СтрокаТЧОбъекта ИЗ ДокОбъект.Товары Цикл
		СтрокиТовары = Товары.НайтиСтроки(Новый Структура("Номенклатура, НомерСтрокиВДокументе", СтрокаТЧОбъекта.Номенклатура, СтрокаТЧОбъекта.НомерСтроки));
		
		Для каждого СтрокаТовары Из СтрокиТовары Цикл
			СтрокаТовары.Количество = СтрокаТЧОбъекта.Количество;
		КонецЦикла;
	КонецЦикла;
	
	//Получим таблицу списанных партий
	ПараметрыСписания = Новый Структура;
	ПараметрыСписания.Вставить("Товары", Товары);
	ПараметрыСписания.Вставить("ВызыватьИсключение", Ложь);
	ПараметрыСписания.Вставить("СписыватьТолькоПоСвоейОрганизации", Ложь);
	
	//Разрешим перемещать товары всех организаций
	ОрганизацииДляЗакупки = Новый ТаблицаЗначений;
	ОрганизацииДляЗакупки.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ОрганизацииДляЗакупки.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"	, Новый КвалификаторыЧисла(10, 2)));
	СобственныеОрганизации = Справочники.ПолитикиМФП.СобственныеОрганизации(ДокОбъект.Дата);
	Для каждого СобственнаяОрганизация Из СобственныеОрганизации Цикл
		  НоваяСтрока = ОрганизацииДляЗакупки.Добавить();
		  НоваяСтрока.Организация 	= СобственнаяОрганизация;
		  НоваяСтрока.Приоритет 	= ?(НоваяСтрока.Организация = ДокОбъект.Организация, 0, 1);
	КонецЦикла;
	//	
	НайденныеСтроки = ОрганизацииДляЗакупки.НайтиСтроки(Новый структура("Организация", ДокОбъект.Организация)); 
	Если НайденныеСтроки.Количество() = 0 Тогда
		НоваяСтрока = ОрганизацииДляЗакупки.Добавить();
		НоваяСтрока.Организация = ДокОбъект.Организация;
		НоваяСтрока.Приоритет 	= 0;
	КонецЕсли;
	ПараметрыСписания.Вставить("ОрганизацииДляЗакупки", ОрганизацииДляЗакупки);
	
	ВозврСтруктураТаблиц = ПроведениеДокументовКлиентСервер.ПогашениеПартийТоваровНовое(ДокОбъект.Ссылка, вхОтказ, Ложь, вхФильтр, ПараметрыСписания);
	ПартииТоваров = ВозврСтруктураТаблиц.ПартииТоваров.Скопировать(Новый Структура("ВидДвижения", ВидДвиженияНакопления.Расход));
	ПартииТоваров.Свернуть("Номенклатура, Организация", "Количество");
	
	//Распределим по организациям количество в ТЧ
	
	ТаблицаРаспределения = ДокОбъект.Товары.Выгрузить();
	ТаблицаНовая = ТаблицаРаспределения.СкопироватьКолонки();
	
	Для каждого СтрокаРаспределения Из ТаблицаРаспределения Цикл
		
		ОстаткиОрганизаций = ПартииТоваров.НайтиСтроки(Новый Структура("Номенклатура", СтрокаРаспределения.Номенклатура));
		
		Распределить 		= СтрокаРаспределения.Количество;
		РаспределитьПлан 	= СтрокаРаспределения.КоличествоПлан;
		
		Если ОстаткиОрганизаций.Количество() > 0 Тогда
			
			НоваяСтрока = Неопределено;

			Для Каждого СтрокаОстатков Из ОстаткиОрганизаций Цикл
				
				Распределено = Мин(СтрокаОстатков.Количество, Распределить);
				РаспределеноПлан = Мин(СтрокаОстатков.Количество, РаспределитьПлан);
				
				Если Распределено <= 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока =  ТаблицаНовая.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения);
				НоваяСтрока.Количество = Распределено;
				НоваяСтрока.КоличествоПлан =  РаспределеноПлан;
				НоваяСтрока.Организация = СтрокаОстатков.Организация;
				НоваяСтрока.КоличествоНеПринято = НоваяСтрока.КоличествоПлан - НоваяСтрока.Количество;
				
				СтрокаОстатков.Количество = СтрокаОстатков.Количество - Распределено;
				
				Распределить = Распределить - Распределено;
				РаспределитьПлан = РаспределитьПлан - РаспределеноПлан;
				
			КонецЦикла;
			
			//Нераспределенное кидаем на поледнюю строку
			Если НоваяСтрока <> Неопределено И Не УдалятьСтроки Тогда
				НоваяСтрока.Количество 				= НоваяСтрока.Количество + Распределить;
				НоваяСтрока.КоличествоПлан 			= НоваяСтрока.КоличествоПлан + РаспределитьПлан;
				НоваяСтрока.КоличествоНеПринято 	= НоваяСтрока.КоличествоПлан - НоваяСтрока.Количество;
			КонецЕсли;
		ИначеЕсли Не УдалятьСтроки Тогда 
			//Остатков нет, оставляем строку
			НоваяСтрока =  ТаблицаНовая.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения,,);
			
		КонецЕсли;
		
	КонецЦикла;
	
	//Свернем
	ТаблицаНовая.Свернуть("Поступление, Номенклатура, ЕдиницаИзмерения, Коэффициент, Качество, СтрокаПрихода, СтрокаЗаявки, Организация", "Количество, КоличествоНеПринято, КоличествоПлан");
	
	ДокОбъект.Товары.Загрузить(ТаблицаНовая);
	
КонецПроцедуры

#Область НеИспользуется
Процедура ЗагрузитьРезультатРазмещенияФрагмент1(Знач ДокументОснование, Знач ЗаказНаПриемкуXDTO, Знач ОбъектXDTO, Знач РазмещениеСсылкаТопЛог, ТаблицаСсылок)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗагрузитьРезультатРазмещенияФрагмент1";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "ВидОперацииПоступления,Склад");
	Таблица = ЗаказНаПриемкуXDTO.Товары.ПолучитьСписок("СтрокаТовары");
	СоответствиеСкладов = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл 
		Если СоответствиеСкладов[СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка] = Неопределено Тогда 
			СкладПолучатель = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка));
			СоответствиеСкладов.Вставить(СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка, СкладПолучатель);
			Если Реквизиты.ВидОперацииПоступления = Перечисления.ВидыПоступленияТоваров.ОтветХранение Тогда 
				ЗапросСклад = Новый Запрос;
				ЗапросСклад.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				                    |	Склады.Ссылка
				                    |ИЗ
				                    |	Справочник.Склады КАК Склады
				                    |ГДЕ
				                    |	Склады.ФизическийСклад = &ФизическийСклад
				                    |	И Склады.СкладVMI";
				ЗапросСклад.УстановитьПараметр("ФизическийСклад", СкладПолучатель);
				ВыборкаСклад = ЗапросСклад.Выполнить().Выбрать();
				Если ВыборкаСклад.Следующий() Тогда 
					Если ВыборкаСклад.Ссылка <> СкладПолучатель Тогда 
						РассылкаСообщенийОбОшибках.ОтправитьЭлектронноеСообщениеБезСохранения(Справочники.СобытияДляОтправкиЭлектронныхПисем.ОшибкаОбменаСТопЛог, "Для размещения на ответ. хранение выгружен склад, отличающийся от склада в шапке ПТУ. GUID Размещения = " + РазмещениеСсылкаТопЛог + " ПТУ: " + ДокументОснование + " Будет подставлен склад из шапки документа." + "Выгрузка размещения из ТопЛог.");
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Реквизиты.ВидОперацииПоступления = Перечисления.ВидыПоступленияТоваров.ОтветХранение Тогда 
		СоответствиеСкладов.Очистить();
		СоответствиеСкладов.Вставить("", Реквизиты.Склад);
	КонецЕсли;
	
	Для Каждого КлючЗначение Из СоответствиеСкладов Цикл 
		
		СкладПолучатель = КлючЗначение.Значение;
		РазмещениеЯчейкаСкладСсылка = КлючЗначение.Ключ;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПеремещениеТоваров.Ссылка
		               |ИЗ
		               |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		               |ГДЕ
		               |	ПеремещениеТоваров.РазмещениеСсылкаТопЛог = &РазмещениеСсылкаТопЛог
		               |	И ПеремещениеТоваров.ДокументОснование = &ДокументОснование
		               |	И ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель";
		Запрос.УстановитьПараметр("РазмещениеСсылкаТопЛог", РазмещениеСсылкаТопЛог);
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		НеобходимаЗагрузка = Ложь;
		ТребуетсяОчисткаТЧ = Ложь;
		Дельта = Неопределено;
		
		Если Выборка.Количество() = 0 Тогда 
			ДокСсылка = Документы.ПеремещениеТоваров.ПустаяСсылка();
			Дельта = ПолучитьТребуемуюТаблицу(ЗаказНаПриемкуXDTO, РазмещениеЯчейкаСкладСсылка);
			НеобходимаЗагрузка = Истина;
		ИначеЕсли Выборка.Количество() = 1 Тогда 
			Выборка.Следующий();
			ДокСсылка = Выборка.Ссылка;
			НеобходимаЗагрузка = НеобходимоЗагружатьПеремещениеИзТопЛог(ДокСсылка, ДокументОснование, ЗаказНаПриемкуXDTO, ОбъектXDTO, Дельта, ТребуетсяОчисткаТЧ, РазмещениеЯчейкаСкладСсылка);
		Иначе
			ВызватьИсключение "Найдено более одного документа перемещения с guid размещения = " + РазмещениеСсылкаТопЛог + " и документом-основанием: " + ДокументОснование + " и складом: " + СкладПолучатель;
		КонецЕсли;
		
		Если НеобходимаЗагрузка Тогда
			
			ТаблицаРаспределить = Дельта.СкопироватьКолонки(); 
			ТаблицаУбрать = Дельта.СкопироватьКолонки();
			Для Каждого СтрокаТЧ Из Дельта Цикл 
				Если СтрокаТЧ.КоличествоПлан < 0 Тогда
					НоваяСтрока = ТаблицаУбрать.Добавить(); 
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
					НоваяСтрока.КоличествоПлан = - СтрокаТЧ.КоличествоПлан;
				Иначе
					ЗаполнитьЗначенияСвойств(ТаблицаРаспределить.Добавить(), СтрокаТЧ);
				КонецЕсли;
			КонецЦикла;
			
			Успешно = Истина;
			ДокОбъект = ОбработатьРазмещение(ДокСсылка, ДокументОснование, ОбъектXDTO, РазмещениеСсылкаТопЛог, ТаблицаРаспределить, ТаблицаУбрать, ТребуетсяОчисткаТЧ, Успешно, РазмещениеЯчейкаСкладСсылка);
			Если Успешно Тогда 
				
				НоваяСтрока = ТаблицаСсылок.Добавить();
				НоваяСтрока.Документ = ДокОбъект.ДокументОснование;
				НоваяСтрока.Склад = ДокОбъект.СкладПолучатель;
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "СтатусДокумента") = Справочники.СтатусыДокументов.ПоступлениеТоваровПринят Тогда 
					Попытка
						ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Исключение				
						ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
						
						Набор = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
						Набор.Отбор.СсылкаНаДокумент.Установить(ДокОбъект.Ссылка);
						
						Стр = Набор.Добавить();
						Стр.СсылкаНаДокумент = ДокОбъект.Ссылка;
						Набор.Записать(Истина);
						
						ВызватьИсключение ОписаниеОшибки();
					КонецПопытки;
				Иначе 
					Попытка
						ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
						
						Набор = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
						Набор.Отбор.СсылкаНаДокумент.Установить(ДокОбъект.Ссылка);
						
						Стр = Набор.Добавить();
						Стр.СсылкаНаДокумент = ДокОбъект.Ссылка;
						Набор.Записать(Истина);
					Исключение
						ВызватьИсключение ОписаниеОшибки();
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьРезультатРазмещенияФрагмент2(Знач ДокументОснование, Знач ЗаказНаПриемкуXDTO, Знач ОбъектXDTO, Знач РазмещениеСсылкаТопЛог, ТаблицаСсылок)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ЗагрузитьРезультатРазмещенияФрагмент2";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	//////////////////////////////////////////////////////////////////////////
	
	Таблица = ЗаказНаПриемкуXDTO.Товары.ПолучитьСписок("СтрокаТовары");
	СоответствиеСкладов = Новый Соответствие;
	
	Для Каждого СтрокаТаблицы Из Таблица Цикл 
		Если СоответствиеСкладов[СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка] = Неопределено Тогда 
			СкладПолучатель = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка));
			СоответствиеСкладов.Вставить(СтрокаТаблицы.РазмещениеЯчейкаСкладСсылка, СкладПолучатель);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого КлючЗначение Из СоответствиеСкладов Цикл 	
		СкладПолучатель = КлючЗначение.Значение;
		РазмещениеЯчейкаСкладСсылка = КлючЗначение.Ключ;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ПеремещениеТоваров.Ссылка
		|ИЗ
		|	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
		|ГДЕ
		|	ПеремещениеТоваров.РазмещениеСсылкаТопЛог = &РазмещениеСсылкаТопЛог
		|	И ПеремещениеТоваров.ДокументОснование = &ДокументОснование";
		Запрос.УстановитьПараметр("РазмещениеСсылкаТопЛог", РазмещениеСсылкаТопЛог);
		Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
		Выборка = Запрос.Выполнить().Выбрать();
		
		НеобходимаЗагрузка = Ложь;
		ТребуетсяОчисткаТЧ = Ложь;
		Дельта = Неопределено;
		Дельта2 = Неопределено;
		
		Если Выборка.Количество() = 0 Тогда 
			ДокСсылка = Документы.ПеремещениеТоваров.ПустаяСсылка();
			СтруктураТребТаблиц = ПолучитьТребуемыеТаблицыДляПеремещения(ЗаказНаПриемкуXDTO, РазмещениеЯчейкаСкладСсылка);
			Дельта = СтруктураТребТаблиц.Товары;
			Дельта2 = СтруктураТребТаблиц.ТоварыПоСтрокамЗаявок;
			НеобходимаЗагрузка = Истина;
		ИначеЕсли Выборка.Количество() = 1 Тогда 
			Выборка.Следующий();
			ДокСсылка = Выборка.Ссылка;
			НеобходимаЗагрузка = НеобходимоЗагружатьПеремещениеИзТопЛог2(ДокСсылка, ДокументОснование, ЗаказНаПриемкуXDTO, ОбъектXDTO, Дельта, Дельта2, ТребуетсяОчисткаТЧ, РазмещениеЯчейкаСкладСсылка);
		Иначе
			ВызватьИсключение "Найдено более одного документа перемещения с guid размещения = " + РазмещениеСсылкаТопЛог + " и документом-основанием: " + ДокументОснование;
		КонецЕсли;
		
		Если НеобходимаЗагрузка Тогда
			
			Успешно = Истина;
			ДокОбъект = ОбработатьРазмещениеДляПеремещения(ДокСсылка, ДокументОснование, ОбъектXDTO, РазмещениеСсылкаТопЛог, Дельта, Дельта2, ТребуетсяОчисткаТЧ, Успешно, РазмещениеЯчейкаСкладСсылка);
			Если Успешно Тогда 
				
				НоваяСтрока = ТаблицаСсылок.Добавить();
				НоваяСтрока.Документ = ДокОбъект.ДокументОснование;
				НоваяСтрока.Склад = ДокОбъект.СкладПолучатель;
				Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ОбновленИзТопЛог") = Истина Тогда 
					Попытка
						ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
					Исключение				
						ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
						
						Набор = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
						Набор.Отбор.СсылкаНаДокумент.Установить(ДокОбъект.Ссылка);
						
						Стр = Набор.Добавить();
						Стр.СсылкаНаДокумент = ДокОбъект.Ссылка;
						Набор.Записать(Истина);
						
						ВызватьИсключение ОписаниеОшибки();
					КонецПопытки;
				Иначе
					Попытка
						ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
						
						Набор = РегистрыСведений.ОтложенноеПроведениеДокументовИзТопЛог.СоздатьНаборЗаписей();
						Набор.Отбор.СсылкаНаДокумент.Установить(ДокОбъект.Ссылка);
						
						Стр = Набор.Добавить();
						Стр.СсылкаНаДокумент = ДокОбъект.Ссылка;
						Набор.Записать(Истина);
					Исключение
						ВызватьИсключение ОписаниеОшибки();
					КонецПопытки;
				КонецЕсли;
			Иначе
				ВызватьИсключение ОписаниеОшибки();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ОбработатьРазмещение(Знач ДокСсылка, Знач ДокументОснование, Знач ОбъектXDTO, Знач РазмещениеСсылкаТопЛог, Знач ТаблицаРаспределить, Знач ТаблицаУбрать, Знач ТребуетсяОчисткаТЧ, Успешно, Знач РазмещениеЯчейкаСкладСсылка)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ОбработатьРазмещение";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	Попытка
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		Если ЗначениеЗаполнено(ДокСсылка) Тогда 
			ДокОбъект = ДокСсылка.ПолучитьОбъект();
		Иначе
			ДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
		КонецЕсли;
		
		ДокОбъект.РазмещениеСсылкаТопЛог = РазмещениеСсылкаТопЛог;
		ДокОбъект.ДокументОснование = ДокументОснование;
		ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог;
		ДокОбъект.ЗагруженИзТопЛог = Истина;
		
		Если ТребуетсяОчисткаТЧ Тогда 
			ДокОбъект.Товары.Очистить();
		КонецЕсли;
		
		ОстаткиПоРегистру = ОстаткиСтрокПрихода(ДокументОснование, 
		//ТаблицаРаспределить, 
		Неопределено);
		Для Каждого СтрокаТЧ Из ТаблицаУбрать Цикл 
			УбратьКоличествоПлан = СтрокаТЧ.КоличествоПлан;
			
			СтрокиТовары = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура,СтрокаЗаявки", СтрокаТЧ.Номенклатура, СтрокаТЧ.СтрокаЗаявки));
			Индекс = 0;
			Пока УбратьКоличествоПлан > 0 И Индекс < СтрокиТовары.Количество() Цикл 
				СтрокаТовары = СтрокиТовары.Получить(Индекс);
				Если СтрокаТовары.КоличествоПлан > 0 Тогда 
					СписываемоеКоличество = Мин(УбратьКоличествоПлан, СтрокаТовары.КоличествоПлан);
					
					СтрокаТовары.КоличествоПлан = СтрокаТовары.КоличествоПлан - СписываемоеКоличество;
					УбратьКоличествоПлан = УбратьКоличествоПлан - СписываемоеКоличество;
					
					Отбор = Новый Структура("Номенклатура,СтрокаПрихода,СтрокаЗаявки");
					ЗаполнитьЗначенияСвойств(Отбор, СтрокаТовары);
					
					СтрокиОстатков = ОстаткиПоРегистру.НайтиСтроки(Отбор);
					Если СтрокиОстатков.Количество() > 0 Тогда 
						СтрокаОст = СтрокиОстатков.Получить(0);
						СтрокаОст.КоличествоПлан = СтрокаОст.КоличествоПлан + СписываемоеКоличество;
					КонецЕсли;
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЦикла;
		Для Каждого СтрокаРаспределить Из ТаблицаРаспределить Цикл 
			Количество = СтрокаРаспределить.КоличествоПлан;
			//Если ЭтоПоступление Тогда 
			Строки = ОстаткиПоРегистру.НайтиСтроки(Новый Структура("Номенклатура, СтрокаЗаявки", СтрокаРаспределить.Номенклатура, СтрокаРаспределить.СтрокаЗаявки));
			//Иначе
			//	Строки = ОстаткиПоРегистру.НайтиСтроки(Новый Структура("Номенклатура", СтрокаРаспределить.Номенклатура));
			//КонецЕсли;
			
			Индекс = 0;
			Пока Количество > 0 И Индекс < Строки.Количество() Цикл 
				Строка = Строки.Получить(Индекс);
				Если Строка.КоличествоПлан > 0 Тогда 
					СписываемоеКоличество = Мин(Строка.КоличествоПлан, Количество);
					
					НоваяСтрока = ДокОбъект.Товары.Добавить();
					
					//Если ЭтоПоступление Тогда 
					НоваяСтрока.Поступление = ДокументОснование;
					//КонецЕсли;
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					НоваяСтрока.КоличествоПлан = СписываемоеКоличество;
					НоваяСтрока.Количество = СписываемоеКоличество;
					НоваяСтрока.ЕдиницаИзмерения =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ЕдиницаХраненияОстатков");
					НоваяСтрока.Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.ЕдиницаИзмерения, "Коэффициент");
					НоваяСтрока.Качество = Справочники.Качество.Новый;
					
					Строка.КоличествоПлан = Строка.КоличествоПлан - СписываемоеКоличество;
					Количество = Количество - СписываемоеКоличество;
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
			//Если Количество > 0 Тогда 
			//	//Остатки в регистре закончились. Возможно ТопЛог прислал не тут строку заявки
			//	Строки = ТаблицаУбрать.НайтиСтроки(Новый Структура("Номенклатура", СтрокаРаспределить.Номенклатура));
			//	Индекс = 0;
			//	Пока Количество > 0 И Индекс < Строки.Количество() Цикл 
			//		Строка = Строки.Получить(Индекс);
			//		Если Строка.КоличествоПлан > 0 Тогда 
			//			СписываемоеКоличество = Мин(Строка.КоличествоПлан, Количество);
			//			
			//			Строка.КоличествоПлан = Строка.КоличествоПлан - СписываемоеКоличество;
			//			Количество = Количество - СписываемоеКоличество; 
			//		КонецЕсли;
			//		Индекс = Индекс + 1;	
			//	КонецЦикла;
			//КонецЕсли;
			Если Количество > 0 Тогда 
				//ТопЛог прислал не ту номенклатуру
				Попытка
					ВызватьИсключение "Из ТопЛога выгружены некорректные данные. Номенклатура: " + СтрокаРаспределить.Номенклатура.Артикул + "/" + СтрокаРаспределить.Номенклатура + 
					" Код номенклатуры: " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРаспределить.Номенклатура, "Код") + " IDSite = " + 
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРаспределить.СтрокаЗаявки, "IDSite"); 
				Исключение
					ВызватьИсключение "Из ТопЛога выгружены некорректные данные. Номенклатура: " + СтрокаРаспределить.Номенклатура + 
					" Код номенклатуры: " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРаспределить.Номенклатура, "Код") + " IDSite = " + 
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРаспределить.СтрокаЗаявки, "IDSite"); 
				КонецПопытки;	
			КонецЕсли;
		КонецЦикла;
		
		Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("КоличествоПлан", 0));
		КолвоСтр = Строки.Количество();
		Для Шаг = 0 По КолвоСтр - 1 Цикл 
			ДокОбъект.Товары.Удалить(КолвоСтр - шаг - 1);
		КонецЦикла;
		
		Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл 
			СтрокаТЧ.Количество = СтрокаТЧ.КоличествоПлан;
		КонецЦикла;
			
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация,Склад,ВидОперацииПоступления");
		СкладПриемки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизиты.Склад, "СкладПриемки");
		Если Не ЗначениеЗаполнено(СкладПриемки) Тогда 
			СкладПриемки = Реквизиты.Склад;
		КонецЕсли;
		ДокОбъект.Организация = Реквизиты.Организация;
		
		ДокОбъект.СкладОтправитель = СкладПриемки;
		
		Если Реквизиты.ВидОперацииПоступления = Перечисления.ВидыПоступленияТоваров.ОтветХранение Тогда 
			ДокОбъект.СкладПолучатель = Реквизиты.Склад;
		Иначе
			ДокОбъект.СкладПолучатель = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(РазмещениеЯчейкаСкладСсылка));
		КонецЕсли;
		
		ДокОбъект.ФилиалОтправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.СкладОтправитель, "Филиал");
		ДокОбъект.ФилиалПолучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.СкладПолучатель, "Филиал");
		
		ДокОбъект.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил;
		ДокОбъект.ПометкаУдаления = Ложь;
		
		Если ДокОбъект.ЭтоНовый() Тогда 
			ДокОбъект.Дата = ТекущаяДата();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();	
	Исключение
		ОтменитьТранзакцию();
		Успешно = Ложь;
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	Возврат ДокОбъект;

КонецФункции

Функция ОбработатьРазмещениеДляПеремещения(Знач ДокСсылка, Знач ДокументОснование, Знач ОбъектXDTO, Знач РазмещениеСсылкаТопЛог, Знач Дельта, Знач Дельта2, Знач ТребуетсяОчисткаТЧ, Успешно, Знач РазмещениеЯчейкаСкладСсылка)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ОбработатьРазмещениеДляПеремещения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	Попытка
		НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
		Если ЗначениеЗаполнено(ДокСсылка) Тогда 
			ДокОбъект = ДокСсылка.ПолучитьОбъект();
		Иначе
			ДокОбъект = Документы.ПеремещениеТоваров.СоздатьДокумент();
		КонецЕсли;
		
		ДокОбъект.РазмещениеСсылкаТопЛог = РазмещениеСсылкаТопЛог;
		ДокОбъект.ДокументОснование = ДокументОснование;
		ДокОбъект.ВидОперации = Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог;
		ДокОбъект.ЗагруженИзТопЛог = Истина;
		
		Если ТребуетсяОчисткаТЧ Тогда 
			ДокОбъект.Товары.Очистить();
		КонецЕсли;
		
		ТаблицаРаспределитьПоСтрокамЗаявок = Дельта2.СкопироватьКолонки(); 
		ТаблицаУбратьПоСтрокамЗаявок = Дельта2.СкопироватьКолонки();
		Для Каждого СтрокаТЧ Из Дельта2 Цикл 
			Если СтрокаТЧ.КоличествоПлан < 0 Тогда
				НоваяСтрока = ТаблицаУбратьПоСтрокамЗаявок.Добавить(); 
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.КоличествоПлан = - СтрокаТЧ.КоличествоПлан;
			Иначе
				ЗаполнитьЗначенияСвойств(ТаблицаРаспределитьПоСтрокамЗаявок.Добавить(), СтрокаТЧ);
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаРаспределить = Дельта.СкопироватьКолонки(); 
		ТаблицаУбрать = Дельта.СкопироватьКолонки();
		Для Каждого СтрокаТЧ Из Дельта Цикл 
			Если СтрокаТЧ.КоличествоПлан < 0 Тогда
				НоваяСтрока = ТаблицаУбрать.Добавить(); 
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
				НоваяСтрока.КоличествоПлан = - СтрокаТЧ.КоличествоПлан;
			Иначе
				ЗаполнитьЗначенияСвойств(ТаблицаРаспределить.Добавить(), СтрокаТЧ);
			КонецЕсли;
		КонецЦикла;
		
		СтруктураТаблиц = ОстаткиСтрокПриходаДляПеремещения(ДокументОснование, Неопределено);
		ОстаткиСтрокПрихода = СтруктураТаблиц.ОстаткиСтрокПрихода;
		ОстаткиСтрокПриходаПоСтрокамЗаявок = СтруктураТаблиц.ОстаткиСтрокПриходаПоСтрокамЗаявок;
		
		Для Каждого СтрокаТЧ Из ТаблицаУбратьПоСтрокамЗаявок Цикл 
			УбратьКоличествоПлан = СтрокаТЧ.КоличествоПлан;
			
			СтрокиТовары = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура,СтрокаЗаявки", СтрокаТЧ.Номенклатура, СтрокаТЧ.СтрокаЗаявки));
			Индекс = 0;
			Пока УбратьКоличествоПлан > 0 И Индекс < СтрокиТовары.Количество() Цикл 
				СтрокаТовары = СтрокиТовары.Получить(Индекс);
				Если СтрокаТовары.КоличествоПлан > 0 Тогда 
					СписываемоеКоличество = Мин(УбратьКоличествоПлан, СтрокаТовары.КоличествоПлан);
					
					СтрокаТовары.КоличествоПлан = СтрокаТовары.КоличествоПлан - СписываемоеКоличество;
					УбратьКоличествоПлан = УбратьКоличествоПлан - СписываемоеКоличество;
					
					Отбор = Новый Структура("Номенклатура,СтрокаПрихода,СтрокаЗаявки,Организация");
					ЗаполнитьЗначенияСвойств(Отбор, СтрокаТовары);
					
					СтрокиОстатков = ОстаткиСтрокПриходаПоСтрокамЗаявок.НайтиСтроки(Отбор);
					Если СтрокиОстатков.Количество() > 0 Тогда 
						СтрокаОст = СтрокиОстатков.Получить(0);
						СтрокаОст.КоличествоПлан = СтрокаОст.КоличествоПлан + СписываемоеКоличество;
					КонецЕсли;
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого СтрокаРаспределить Из ТаблицаРаспределитьПоСтрокамЗаявок Цикл 
			Количество = СтрокаРаспределить.КоличествоПлан;
			//Если ЭтоПоступление Тогда 
			Строки = ОстаткиСтрокПриходаПоСтрокамЗаявок.НайтиСтроки(Новый Структура("Номенклатура, СтрокаЗаявки", СтрокаРаспределить.Номенклатура, СтрокаРаспределить.СтрокаЗаявки));
			//Иначе
			//	Строки = ОстаткиПоРегистру.НайтиСтроки(Новый Структура("Номенклатура", СтрокаРаспределить.Номенклатура));
			//КонецЕсли;
			
			Индекс = 0;
			Пока Количество > 0 И Индекс < Строки.Количество() Цикл 
				Строка = Строки.Получить(Индекс);
				Если Строка.КоличествоПлан > 0 Тогда 
					СписываемоеКоличество = Мин(Строка.КоличествоПлан, Количество);
					
					НоваяСтрока = ДокОбъект.Товары.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					НоваяСтрока.КоличествоПлан = СписываемоеКоличество;
					НоваяСтрока.Количество = СписываемоеКоличество;
					НоваяСтрока.ЕдиницаИзмерения =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ЕдиницаХраненияОстатков");
					НоваяСтрока.Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.ЕдиницаИзмерения, "Коэффициент");
					НоваяСтрока.Качество = Справочники.Качество.Новый;
					
					Строка.КоличествоПлан = Строка.КоличествоПлан - СписываемоеКоличество;
					Количество = Количество - СписываемоеКоличество;
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
			//Если Количество > 0 Тогда 
			//	//Остатки в регистре закончились. Возможно ТопЛог прислал не тут строку заявки
			//	Строки = ТаблицаУбрать.НайтиСтроки(Новый Структура("Номенклатура", СтрокаРаспределить.Номенклатура));
			//	Индекс = 0;
			//	Пока Количество > 0 И Индекс < Строки.Количество() Цикл 
			//		Строка = Строки.Получить(Индекс);
			//		Если Строка.КоличествоПлан > 0 Тогда 
			//			СписываемоеКоличество = Мин(Строка.КоличествоПлан, Количество);
			//			
			//			Строка.КоличествоПлан = Строка.КоличествоПлан - СписываемоеКоличество;
			//			Количество = Количество - СписываемоеКоличество; 
			//		КонецЕсли;
			//		Индекс = Индекс + 1;	
			//	КонецЦикла;
			//КонецЕсли;
			Если Количество > 0 Тогда 
				//ТопЛог прислал не ту номенклатуру
				Попытка
					ВызватьИсключение "Из ТопЛога выгружены некорректные данные. Номенклатура: " + СтрокаРаспределить.Номенклатура.Артикул + "/" + СтрокаРаспределить.Номенклатура + 
					" Код номенклатуры: " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРаспределить.Номенклатура, "Код") + " IDSite = " + 
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРаспределить.СтрокаЗаявки, "IDSite"); 
				Исключение
					ВызватьИсключение "Из ТопЛога выгружены некорректные данные. Номенклатура: " + СтрокаРаспределить.Номенклатура + 
					" Код номенклатуры: " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРаспределить.Номенклатура, "Код") + " IDSite = " + 
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРаспределить.СтрокаЗаявки, "IDSite"); 
				КонецПопытки;	
			КонецЕсли;
		КонецЦикла;
		

		Для Каждого СтрокаТЧ Из ТаблицаУбрать Цикл 
			УбратьКоличествоПлан = СтрокаТЧ.КоличествоПлан;
			
			СтрокиТовары = ДокОбъект.Товары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТЧ.Номенклатура));
			КоличествоСтрок = СтрокиТовары.Количество();
			
			Для Шаг = 0 По КоличествоСтрок - 1 Цикл 
				СтрокаТЧ = Строки.Получить(КоличествоСтрок - 1 - Шаг);
				Если ЗначениеЗаполнено(СтрокаТЧ.СтрокаЗаявки) Тогда 
					Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.СтрокаЗаявки, "Виртуальная,Заявка");
					Если Не Реквизиты.Виртуальная И ЗначениеЗаполнено(Реквизиты.Заявка) Тогда 
						Строки.Удалить(Строки.Найти(СтрокаТЧ));
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			Индекс = 0;
			
			Пока УбратьКоличествоПлан > 0 И Индекс < СтрокиТовары.Количество() Цикл 
				СтрокаТовары = СтрокиТовары.Получить(Индекс);
				Если СтрокаТовары.КоличествоПлан > 0 Тогда 
					СписываемоеКоличество = Мин(УбратьКоличествоПлан, СтрокаТовары.КоличествоПлан);
					
					СтрокаТовары.КоличествоПлан = СтрокаТовары.КоличествоПлан - СписываемоеКоличество;
					УбратьКоличествоПлан = УбратьКоличествоПлан - СписываемоеКоличество;
					
					Отбор = Новый Структура("Номенклатура,СтрокаПрихода,Организация");
					ЗаполнитьЗначенияСвойств(Отбор, СтрокаТовары);
					
					СтрокиОстатков = ОстаткиСтрокПрихода.НайтиСтроки(Отбор);
					Если СтрокиОстатков.Количество() > 0 Тогда 
						СтрокаОст = СтрокиОстатков.Получить(0);
						СтрокаОст.КоличествоПлан = СтрокаОст.КоличествоПлан + СписываемоеКоличество;
					КонецЕсли;
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
		КонецЦикла;
		Для Каждого СтрокаРаспределить Из ТаблицаРаспределить Цикл 
			Количество = СтрокаРаспределить.КоличествоПлан;
			//Если ЭтоПоступление Тогда 
			Строки = ОстаткиСтрокПрихода.НайтиСтроки(Новый Структура("Номенклатура", СтрокаРаспределить.Номенклатура));
			//Иначе
			//	Строки = ОстаткиПоРегистру.НайтиСтроки(Новый Структура("Номенклатура", СтрокаРаспределить.Номенклатура));
			//КонецЕсли;
			
			Индекс = 0;
			Пока Количество > 0 И Индекс < Строки.Количество() Цикл 
				Строка = Строки.Получить(Индекс);
				Если Строка.КоличествоПлан > 0 Тогда 
					СписываемоеКоличество = Мин(Строка.КоличествоПлан, Количество);
					
					НоваяСтрока = ДокОбъект.Товары.Добавить();
					
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					НоваяСтрока.КоличествоПлан = СписываемоеКоличество;
					НоваяСтрока.Количество = СписываемоеКоличество;
					НоваяСтрока.ЕдиницаИзмерения =  ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ЕдиницаХраненияОстатков");
					НоваяСтрока.Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.ЕдиницаИзмерения, "Коэффициент");
					НоваяСтрока.Качество = Справочники.Качество.Новый;
					
					Строка.КоличествоПлан = Строка.КоличествоПлан - СписываемоеКоличество;
					Количество = Количество - СписываемоеКоличество;
				КонецЕсли;
				Индекс = Индекс + 1;
			КонецЦикла;
			//Если Количество > 0 Тогда 
			//	//Остатки в регистре закончились. Возможно ТопЛог прислал не тут строку заявки
			//	Строки = ТаблицаУбрать.НайтиСтроки(Новый Структура("Номенклатура", СтрокаРаспределить.Номенклатура));
			//	Индекс = 0;
			//	Пока Количество > 0 И Индекс < Строки.Количество() Цикл 
			//		Строка = Строки.Получить(Индекс);
			//		Если Строка.КоличествоПлан > 0 Тогда 
			//			СписываемоеКоличество = Мин(Строка.КоличествоПлан, Количество);
			//			
			//			Строка.КоличествоПлан = Строка.КоличествоПлан - СписываемоеКоличество;
			//			Количество = Количество - СписываемоеКоличество; 
			//		КонецЕсли;
			//		Индекс = Индекс + 1;	
			//	КонецЦикла;
			//КонецЕсли;
			Если Количество > 0 Тогда 
				//ТопЛог прислал не ту номенклатуру
				Попытка
					ВызватьИсключение "Из ТопЛога выгружены некорректные данные. Номенклатура: " + СтрокаРаспределить.Номенклатура.Артикул + "/" + СтрокаРаспределить.Номенклатура + 
					" Код номенклатуры: " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРаспределить.Номенклатура, "Код") + " IDSite = " + 
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРаспределить.СтрокаЗаявки, "IDSite"); 
				Исключение
					ВызватьИсключение "Из ТопЛога выгружены некорректные данные. Номенклатура: " + СтрокаРаспределить.Номенклатура + 
					" Код номенклатуры: " + ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРаспределить.Номенклатура, "Код") + " IDSite = " + 
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРаспределить.СтрокаЗаявки, "IDSite"); 
				КонецПопытки;	
			КонецЕсли;
		КонецЦикла;
		
		Строки = ДокОбъект.Товары.НайтиСтроки(Новый Структура("КоличествоПлан", 0));
		КолвоСтр = Строки.Количество();
		Для Шаг = 0 По КолвоСтр - 1 Цикл 
			ДокОбъект.Товары.Удалить(КолвоСтр - шаг - 1);
		КонецЦикла;
		
		Для Каждого СтрокаТЧ Из ДокОбъект.Товары Цикл 
			СтрокаТЧ.Количество = СтрокаТЧ.КоличествоПлан;
		КонецЦикла;
		Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация,СкладПолучатель");
		ДокОбъект.Организация = Реквизиты.Организация;
		ДокОбъект.СкладОтправитель = Реквизиты.СкладПолучатель;
		ДокОбъект.СкладПолучатель = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(РазмещениеЯчейкаСкладСсылка));
		
		ДокОбъект.ФилиалОтправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.СкладОтправитель, "Филиал");
		ДокОбъект.ФилиалПолучатель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокОбъект.СкладПолучатель, "Филиал");
		
		ДокОбъект.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил;
		ДокОбъект.ПометкаУдаления = Ложь;
		
		Если ДокОбъект.ЭтоНовый() Тогда 
			ДокОбъект.Дата = ТекущаяДата();
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();	
	Исключение
		Успешно = Ложь;
		ОтменитьТранзакцию();
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	Возврат ДокОбъект;

КонецФункции

Функция НеобходимоЗагружатьПеремещениеИзТопЛог(ДокСсылка, ДокументОснование, ЗаказНаПриемкуXDTO, ОбъектXDTO, Дельта, ТребуетсяОчисткаТЧ, РазмещениеЯчейкаСкладСсылка)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_НеобходимоЗагружатьПеремещениеИзТопЛог";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация,Склад,ВидОперацииПоступления");
	СкладОтправитель = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Реквизиты.Склад, "СкладПриемки");
	
	Если Не ЗначениеЗаполнено(СкладОтправитель) Тогда 
		СкладОтправитель = Реквизиты.Склад;
	КонецЕсли;
	
	Если Реквизиты.ВидОперацииПоступления = Перечисления.ВидыПоступленияТоваров.ОтветХранение Тогда 
		СкладПолучатель = Реквизиты.Склад;
	Иначе
		СкладПолучатель = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(РазмещениеЯчейкаСкладСсылка));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПеремещениеТоваров.Ссылка
	               |ИЗ
	               |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |ГДЕ
	               |	ПеремещениеТоваров.Ссылка = &Ссылка
	               |	И ПеремещениеТоваров.Проведен
	               |	И ПеремещениеТоваров.СкладОтправитель = &СкладОтправитель
	               |	И ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель
	               |	И ПеремещениеТоваров.СтатусДокумента = &СтатусДокумента
	               |	И ПеремещениеТоваров.Организация = &Организация
	               |	И ПеремещениеТоваров.ВидОперации = &ВидОперации
	               |	И ПеремещениеТоваров.ФилиалОтправитель = ВЫРАЗИТЬ(&СкладОтправитель КАК Справочник.Склады).Филиал
	               |	И ПеремещениеТоваров.ФилиалПолучатель = ВЫРАЗИТЬ(&СкладПолучатель КАК Справочник.Склады).Филиал
	               |	И ПеремещениеТоваров.ЗагруженИзТопЛог";
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	Запрос.УстановитьПараметр("СтатусДокумента", Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог);
	
	РезультатЗапроса = Запрос.Выполнить();
	НужноМенятьШапку = РезультатЗапроса.Пустой();
	
	Товары = ПолучитьТребуемуюТаблицу(ЗаказНаПриемкуXDTO, РазмещениеЯчейкаСкладСсылка);
	ТоварыДокумента = ПолучитьИсходнуюТаблицу(ДокСсылка, ТребуетсяОчисткаТЧ);
	
	Если ТребуетсяОчисткаТЧ Тогда 
		Дельта = Товары;
		Возврат Истина;
	КонецЕсли;
	
	НужноМенятьТЧ = Не РаботаСПоследовательностямиКлиентСервер.ТаблицыИдентичныНовое(ТоварыДокумента, Товары, Дельта, "КоличествоПлан");
	Если Не НужноМенятьТЧ Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПеремещениеТоваровТовары.НомерСтроки
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		               |	И ПеремещениеТоваровТовары.Количество <> ПеремещениеТоваровТовары.КоличествоПлан";
		Запрос.УстановитьПараметр("Ссылка",  ДокСсылка);
		НужноМенятьТЧ = Не Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	Возврат НужноМенятьШапку Или НужноМенятьТЧ;
	
КонецФункции

Функция НеобходимоЗагружатьПеремещениеИзТопЛог2(ДокСсылка, ДокументОснование, ЗаказНаПриемкуXDTO, ОбъектXDTO, Дельта, Дельта2, ТребуетсяОчисткаТЧ, РазмещениеЯчейкаСкладСсылка)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_НеобходимоЗагружатьПеремещениеИзТопЛог2";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация,СкладПолучатель");
	СкладОтправитель = Реквизиты.СкладПолучатель;
		
	СкладПолучатель = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(РазмещениеЯчейкаСкладСсылка));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПеремещениеТоваров.Ссылка
	               |ИЗ
	               |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	               |ГДЕ
	               |	ПеремещениеТоваров.Ссылка = &Ссылка
	               |	И ПеремещениеТоваров.Проведен
	               |	И ПеремещениеТоваров.СкладОтправитель = &СкладОтправитель
	               |	И ПеремещениеТоваров.СкладПолучатель = &СкладПолучатель
	               |	И ПеремещениеТоваров.СтатусДокумента = &СтатусДокумента
	               |	И ПеремещениеТоваров.Организация = &Организация
	               |	И ПеремещениеТоваров.ВидОперации = &ВидОперации
	               |	И ПеремещениеТоваров.ФилиалОтправитель = ВЫРАЗИТЬ(&СкладОтправитель КАК Справочник.Склады).Филиал
	               |	И ПеремещениеТоваров.ФилиалПолучатель = ВЫРАЗИТЬ(&СкладПолучатель КАК Справочник.Склады).Филиал
	               |	И ПеремещениеТоваров.ЗагруженИзТопЛог";
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("СкладОтправитель", СкладОтправитель);
	Запрос.УстановитьПараметр("СкладПолучатель", СкладПолучатель);
	Запрос.УстановитьПараметр("СтатусДокумента", Справочники.СтатусыДокументов.ПеремещениеТоваровПоступил);
	Запрос.УстановитьПараметр("Организация", Реквизиты.Организация);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПеремещенияТоваров.ПриемкаТопЛог);
	
	РезультатЗапроса = Запрос.Выполнить();
	НужноМенятьШапку = РезультатЗапроса.Пустой();
	
	СтруктураТребТаблиц = ПолучитьТребуемыеТаблицыДляПеремещения(ЗаказНаПриемкуXDTO, РазмещениеЯчейкаСкладСсылка);
	СтруктураИсхТаблиц = ПолучитьИсходныеТаблицыДляПеремещения(ДокСсылка, ТребуетсяОчисткаТЧ);
	
	Если ТребуетсяОчисткаТЧ Тогда 
		Дельта = СтруктураТребТаблиц.Товары;
		Дельта2 = СтруктураТребТаблиц.ТоварыПоСтрокамЗаявок;
		Возврат Истина;
	КонецЕсли;
	
	НужноМенятьТЧ = Не РаботаСПоследовательностямиКлиентСервер.ТаблицыИдентичныНовое(СтруктураИсхТаблиц.Товары, СтруктураТребТаблиц.Товары, Дельта, "КоличествоПлан");
	НужноМенятьТЧ2 = Не РаботаСПоследовательностямиКлиентСервер.ТаблицыИдентичныНовое(СтруктураИсхТаблиц.ТоварыПоСтрокамЗаявок, СтруктураТребТаблиц.ТоварыПоСтрокамЗаявок, Дельта2, "КоличествоПлан");
	
	Если Не НужноМенятьТЧ Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПеремещениеТоваровТовары.НомерСтроки
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		               |	И ПеремещениеТоваровТовары.Количество <> ПеремещениеТоваровТовары.КоличествоПлан";
		Запрос.УстановитьПараметр("Ссылка",  ДокСсылка);
		НужноМенятьТЧ = Не Запрос.Выполнить().Пустой();
	КонецЕсли;
	
	Возврат НужноМенятьШапку Или НужноМенятьТЧ Или НужноМенятьТЧ2;
	
КонецФункции

Функция ПолучитьТребуемуюТаблицу(ЗаказНаПриемкуXDTO, РазмещениеЯчейкаСкладСсылка)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ПолучитьТребуемуюТаблицу";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ТоварыXDTO = ЗаказНаПриемкуXDTO.Товары.ПолучитьСписок("СтрокаТовары");
	СоотвSSID = ОбменДаннымиКлиентСервер.СоответствиеСтрокЗаявокИSSID(ТоварыXDTO); 
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	Товары.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
	Товары.Колонки.Добавить("КоличествоПлан", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
		Если Не ПустаяСтрока(РазмещениеЯчейкаСкладСсылка) И РазмещениеЯчейкаСкладСсылка <> СтрокаТовары.РазмещениеЯчейкаСкладСсылка Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Товары.Добавить();
		
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.НоменклатураСсылка));
		НоваяСтрока.СтрокаЗаявки = ОбменДаннымиКлиентСервер.НайтиСтрокуЗаявкиВСоответствии(СоотвSSID, СтрокаТовары.SSID);
		Если ЗначениеЗаполнено(СтрокаТовары.SSID) И Не ЗначениеЗаполнено(НоваяСтрока.СтрокаЗаявки) Тогда 
			ВызватьИсключение "Не найдена строка заявки с IDSite = " + СтрокаТовары.SSID;
		КонецЕсли;
		НоваяСтрока.КоличествоПлан = СтрокаТовары.КоличествоРазмещено;
	КонецЦикла;
	
	Возврат Товары;
	
КонецФункции

Функция ПолучитьИсходнуюТаблицу(ДокСсылка, ТребуетсяОчисткаТЧ)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ПолучитьИсходнуюТаблицу";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокСсылка, "Проведен, СтатусДокумента");	
	
	ТребуетсяОчисткаТЧ = Не Реквизиты.Проведен Или Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровНовый;
	
	Запрос = Новый Запрос;
	//Если ЭтоПоступление Тогда 
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПеремещениеТоваровТовары.Номенклатура,
	 	               |	ПеремещениеТоваровТовары.КоличествоПлан,
		               |	ПеремещениеТоваровТовары.СтрокаЗаявки
		               |ИЗ
		               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
		               |ГДЕ
		               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
		               |	И ПеремещениеТоваровТовары.Ссылка.Проведен
		               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента <> &СтатусДокументаНовый";
	//Иначе
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ПеремещениеТоваровТовары.Номенклатура,
	//	               |	ПеремещениеТоваровТовары.КоличествоПлан
	//	               |ИЗ
	//	               |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	//	               |ГДЕ
	//	               |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	//	               |	И ПеремещениеТоваровТовары.Ссылка.Проведен
	//	               |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента <> &СтатусДокументаНовый";
	//КонецЕсли;
				   
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("СтатусДокументаНовый", Справочники.СтатусыДокументов.ПеремещениеТоваровНовый);	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ПолучитьТребуемыеТаблицыДляПеремещения(ЗаказНаПриемкуXDTO, РазмещениеЯчейкаСкладСсылка)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ПолучитьТребуемыеТаблицыДляПеремещения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	ТоварыXDTO = ЗаказНаПриемкуXDTO.Товары.ПолучитьСписок("СтрокаТовары");
	
	МассивSSID = Новый Массив;
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
		Если ЗначениеЗаполнено(СтрокаТовары.SSID) Тогда 
			МассивSSID.Добавить(СтрокаТовары.SSID);  
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ИдентификаторыСтрокЗаявок.Ссылка КАК СтрокаЗаявки,
	                |	ИдентификаторыСтрокЗаявок.IDSite КАК SSID,
	                |	ИдентификаторыСтрокЗаявок.Виртуальная КАК Виртуальная,
	                |	ИдентификаторыСтрокЗаявок.Заявка КАК Заявка
	                |ИЗ
	                |	Справочник.ИдентификаторыСтрокЗаявок КАК ИдентификаторыСтрокЗаявок
	                |ГДЕ
	                |	ИдентификаторыСтрокЗаявок.IDSite В(&МассивSSID)";
	Запрос.УстановитьПараметр("МассивSSID", МассивSSID);
	
	СоотвSSID = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Структура = Новый Структура("СтрокаЗаявки,Виртуальная,Заявка");
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
		СоотвSSID.Вставить(Выборка.SSID, Структура);	
	КонецЦикла;
	
	ТоварыПоСтрокамЗаявок = Новый ТаблицаЗначений;
	ТоварыПоСтрокамЗаявок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура")); 
	ТоварыПоСтрокамЗаявок.Колонки.Добавить("СтрокаЗаявки", Новый ОписаниеТипов("СправочникСсылка.ИдентификаторыСтрокЗаявок"));
	ТоварыПоСтрокамЗаявок.Колонки.Добавить("КоличествоПлан", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("КоличествоПлан", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(15,3)));
	
	Для Каждого СтрокаТовары Из ТоварыXDTO Цикл 
		Если СтрокаТовары.РазмещениеЯчейкаСкладСсылка <> РазмещениеЯчейкаСкладСсылка Тогда 
			Продолжить;
		КонецЕсли;
		
		РеквизитыSSID = СоотвSSID[СтрокаТовары.SSID];
		
		Если ЗначениеЗаполнено(СтрокаТовары.SSID) И Не ЗначениеЗаполнено(РеквизитыSSID) Тогда 
			ВызватьИсключение "Не найдена строка заявки с IDSite = " + СтрокаТовары.SSID;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрокаТовары.SSID) Или РеквизитыSSID.Виртуальная Или Не ЗначениеЗаполнено(РеквизитыSSID.Заявка) Тогда 
			НоваяСтрока = Товары.Добавить();
		Иначе
			НоваяСтрока = ТоварыПоСтрокамЗаявок.Добавить();
			НоваяСтрока.СтрокаЗаявки = РеквизитыSSID.СтрокаЗаявки;
		КонецЕсли;
		
		НоваяСтрока.Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаТовары.НоменклатураСсылка));
		НоваяСтрока.КоличествоПлан = СтрокаТовары.КоличествоРазмещено;
	КонецЦикла;
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("Товары", Товары);
	СтруктураТаблиц.Вставить("ТоварыПоСтрокамЗаявок", ТоварыПоСтрокамЗаявок);
	
	Возврат СтруктураТаблиц;
	
КонецФункции

Функция ПолучитьИсходныеТаблицыДляПеремещения(ДокСсылка, ТребуетсяОчисткаТЧ)
	лКлючАлгоритма = "Документ_ПеремещениеТоваров_МодульМенеджера_ПолучитьИсходныеТаблицыДляПеремещения";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	////////////////////////////////////////////////	
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокСсылка, "Проведен, СтатусДокумента");	
	
	ТребуетсяОчисткаТЧ = Не Реквизиты.Проведен Или Реквизиты.СтатусДокумента = Справочники.СтатусыДокументов.ПеремещениеТоваровНовый;
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ПеремещениеТоваровТовары.Номенклатура,
	                |	ПеремещениеТоваровТовары.КоличествоПлан
	                |ИЗ
	                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                |ГДЕ
	                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	                |	И ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная, ИСТИНА
	                |				ИЛИ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка)
	                |	И ПеремещениеТоваровТовары.Ссылка.Проведен
	                |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента <> &СтатусДокументаНовый
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ПеремещениеТоваровТовары.Номенклатура,
	                |	ПеремещениеТоваровТовары.СтрокаЗаявки,
	                |	ПеремещениеТоваровТовары.КоличествоПлан
	                |ИЗ
	                |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	                |ГДЕ
	                |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	                |	И ЕСТЬNULL(НЕ ПеремещениеТоваровТовары.СтрокаЗаявки.Виртуальная, ИСТИНА
	                |				И НЕ ЕСТЬNULL(ПеремещениеТоваровТовары.СтрокаЗаявки.Заявка, &ПустаяЗаявка) = &ПустаяЗаявка)
	                |	И ПеремещениеТоваровТовары.Ссылка.Проведен
	                |	И ПеремещениеТоваровТовары.Ссылка.СтатусДокумента <> &СтатусДокументаНовый";
				   
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	Запрос.УстановитьПараметр("ПустаяЗаявка", Документы.ЗаявкаПокупателя.ПустаяСсылка());
	Запрос.УстановитьПараметр("СтатусДокументаНовый", Справочники.СтатусыДокументов.ПеремещениеТоваровНовый);	
	
	РезультатыЗапроса =  Запрос.ВыполнитьПакет();
	Товары = РезультатыЗапроса[0].Выгрузить();
	ТоварыПоСтрокамЗаявок = РезультатыЗапроса[1].Выгрузить();
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("Товары", Товары);
	СтруктураТаблиц.Вставить("ТоварыПоСтрокамЗаявок", ТоварыПоСтрокамЗаявок);
	
	Возврат СтруктураТаблиц;
	
КонецФункции

#КонецОбласти
