Процедура Добавить(Документ, ПричинаИзменения = "") Экспорт
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = Документ.Метаданные().Имя;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка.ДокументОснование КАК ДокументОснование,
		|	РеализацияТоваровУслугТовары.Ссылка КАК Документ,
		|	РеализацияТоваровУслугТовары.Ссылка.Проведен КАК Проведен,
		|	СУММА(РеализацияТоваровУслугТовары.Прибыль) КАК Прибыль,
		|	СУММА(РеализацияТоваровУслугТовары.Сумма) КАК Сумма,
		|	РеализацияТоваровУслугТовары.Ссылка.Дата КАК ДатаДокумента
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	РеализацияТоваровУслугТовары.Ссылка.ДокументОснование,
		|	РеализацияТоваровУслугТовары.Ссылка.Проведен,
		|	РеализацияТоваровУслугТовары.Ссылка.Дата,
		|	ВЫРАЗИТЬ(РеализацияТоваровУслугТовары.Ссылка.КомментарийПричинаИзменения КАК СТРОКА(1000))";
	
	Запрос.УстановитьПараметр("Ссылка", Документ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "РеализацияТоваровУслуг", ИмяТаблицы);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		МЗ 					= РегистрыСведений.ПричиныИзмененияДокументов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МЗ, Выборка);
		МЗ.Комментарий 		= ПричинаИзменения;
		МЗ.Период 			= ТекущаяДата();
		МЗ.Пользователь 	= ПараметрыСеанса.ТекущийПользователь;
		МЗ.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры