Процедура ПриЗаписи(Отказ)
	глЗначениеПеременнойУстановить("ДатаЗаявкиСоздаютсяВ83", Значение, Истина);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	СтароеЗначение = Константы.ДатаЗаявкиСоздаютсяВ83.Получить();
	Если Значение <> СтароеЗначение Тогда 
		//Меняем глобальную дату запрета и по организациям
		Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
		Набор.Отбор.Организация.Установить(Справочники.Организации.ПустаяСсылка());
		Запись = Набор.Добавить();
		Запись.ГраницаЗапретаИзменений = Значение - 24*60*60;
		Запись.Организация = Справочники.Организации.ПустаяСсылка();
		Набор.Записать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Организации.Ссылка КАК Организация
		               |ИЗ
		               |	Справочник.Организации КАК Организации";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл 
			Набор = РегистрыСведений.ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
			Набор.Отбор.Организация.Установить(Выборка.Организация);
			Запись = Набор.Добавить();
			Запись.ГраницаЗапретаИзменений = Значение - 24*60*60;
			Запись.Организация = Выборка.Организация;
			Набор.Записать();
		КонецЦикла;
		
		Сообщить("Обновлены границы запрета редактирования данных. Изменения вступят в силу после перезапуска");
	КонецЕсли;

КонецПроцедуры
