// + 20170301 Пушкин
Перем ЗарегистрироватьВОбмене_ДляСайта;
Перем мДопускНаВыгрузкуНаСайт;
// - 20170301 Пушкин
Перем ЗарегистрироватьВОбмене;

Перем ЗарегистрироватьВОбмене_ОбменПартКом83_77;

Процедура ПередЗаписью(Отказ)
	ЗарегистрироватьВОбмене = Ложь;
	Если ЭтоНовый() Тогда
		ЗарегистрироватьВОбмене = Истина;
	Иначе
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ТорговыеТочки.Владелец,
		|	ТорговыеТочки.Код,
		|	ТорговыеТочки.Наименование
		|ИЗ
		|	Справочник.ТорговыеТочки КАК ТорговыеТочки
		|ГДЕ
		|	ТорговыеТочки.Ссылка = &Ссылка"
		);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Результат = Запрос.Выполнить().Выбрать();
		Пока Результат.Следующий() Цикл
			Если Результат.Владелец <> Владелец
				ИЛИ Результат.Код <> Код
				ИЛИ ВРЕГ(СокрЛП(Результат.Наименование)) <> ВРЕГ(СокрЛП(Наименование)) Тогда
				ЗарегистрироватьВОбмене = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьВОбмене_ДляСайта = ОбменДаннымиКлиентСервер.НеобходимаРегистрацияИзменений(ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные(), ЭтотОбъект);
	
	Если ТекущаяДата() > Константы.ДатаЗаявкиСоздаютсяВ83.Получить() Тогда
		ЗарегистрироватьВОбмене_ОбменПартКом83_77 = Истина;
	КонецЕсли;
	
	
	Если НЕ ЭтоНовый() И ЗначениеЗаполнено(Владелец) И ОбщегоНазначения.СсылкаСуществует(Владелец) тогда
		лРеквизитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Владелец, "Код,ОсновнаяТорговаяТочка");
		Если (лРеквизитыВладельца.ОсновнаяТорговаяТочка = Ссылка) тогда
			Если (лРеквизитыВладельца.Код <> Код) тогда
				// надо изменить код контрагента, потому что изменился код основной торговой точки
				лОбъект = Владелец.ПолучитьОбъект();
				лОбъект.Код = Код;
				лОбъект.ОбменДанными.Загрузка = Истина;
				лОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	МаршрутыДоставки.Очистить();
	Если ЗначениеЗаполнено(МаршрутДоставки) Тогда
		нс = МаршрутыДоставки.Добавить();
		нс.МаршрутДоставки = МаршрутДоставки;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МаршрутДоставки2) Тогда
		нс = МаршрутыДоставки.Добавить();
		нс.МаршрутДоставки = МаршрутДоставки2;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(МаршрутДоставки3) Тогда
		нс = МаршрутыДоставки.Добавить();
		нс.МаршрутДоставки = МаршрутДоставки3;
	КонецЕсли;
	
	Если ЗарегистрироватьВОбмене Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьКОбменуБИТ(Ссылка, ОбменДанными.Отправитель);
	КонецЕсли;
	
	Если ЗарегистрироватьВОбмене_ДляСайта И мДопускНаВыгрузкуНаСайт тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, Метаданные.ПланыОбмена.ОбменПартКом83_Сайт);
	КонецЕсли;
	
	//Если ЗарегистрироватьВОбмене_ОбменПартКом83_77 И ЗначениеЗаполнено(ЭтотОбъект.Владелец) тогда
	//	ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект.Владелец.ПолучитьОбъект(), Метаданные.ПланыОбмена.ОбменПартКом83_77);
	//КонецЕсли;
	
	_Филиал = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Регион, "Филиал");
	
	Если ЗначениеЗаполнено(_Филиал) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ФилиалыТорговыхТочек.ТорговаяТочка,
		|	ФилиалыТорговыхТочек.Филиал
		|ИЗ
		|	РегистрСведений.ФилиалыТорговыхТочек КАК ФилиалыТорговыхТочек
		|ГДЕ
		|	ФилиалыТорговыхТочек.ТорговаяТочка = &ТорговаяТочка");
		Запрос.УстановитьПараметр("ТорговаяТочка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			
			МЗ = РегистрыСведений.ФилиалыТорговыхТочек.СоздатьМенеджерЗаписи();
			МЗ.ТорговаяТочка = Ссылка;
			МЗ.Филиал = _Филиал;
			МЗ.Записать();
			
		Иначе
			
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			_ФилиалВРегистре = Выборка.Филиал;
			
			Если _ФилиалВРегистре <> _Филиал Тогда
				
				МЗ = РегистрыСведений.ФилиалыТорговыхТочек.СоздатьМенеджерЗаписи();
				МЗ.ТорговаяТочка = Ссылка;
				МЗ.Филиал = _Филиал;
				МЗ.Записать();
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// + 20170301 Пушкин
Процедура ПередУдалением(Отказ)
	Если мДопускНаВыгрузкуНаСайт тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные());
	КонецЕсли;
	Если ЗарегистрироватьВОбмене_ОбменПартКом83_77 тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланыОбмена.ОбменПартКом83_77.ПолучитьМетаданные());
	КонецЕсли;
КонецПроцедуры

ЗарегистрироватьВОбмене_ДляСайта = Ложь;
мДопускНаВыгрузкуНаСайт = Ложь;

// - 20170301 Пушкин

// + 20180321 Пушкин
ЗарегистрироватьВОбмене_ОбменПартКом83_77 = Ложь;
// - 20180321 Пушкин