Функция ПолучитьТаблицуПриоритетов(Узел) Экспорт
	
	лОбъектыМетаданных = Новый ТаблицаЗначений;
	лОбъектыМетаданных.Колонки.Добавить("ОбъектМетаданных");
	лОбъектыМетаданных.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	лОбъектыМетаданных.Колонки.Добавить("Поток", Новый ОписаниеТипов("Число"));
	
	Если Не ЗначениеЗаполнено(Узел) Тогда
		Возврат лОбъектыМетаданных
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПриоритетВыгрузкиОбъектов.Объект,
	                      |	ПриоритетВыгрузкиОбъектов.Приоритет,
						  |	ПриоритетВыгрузкиОбъектов.Поток
	                      |ИЗ
	                      |	РегистрСведений.ПриоритетВыгрузкиОбъектов КАК ПриоритетВыгрузкиОбъектов
	                      |ГДЕ
	                      |	ПриоритетВыгрузкиОбъектов.Узел = &Узел");
	Запрос.УстановитьПараметр("Узел", Узел);
	Результат = Запрос.Выполнить();
		
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		лМетаданные = Метаданные.НайтиПоПолномуИмени(Выборка.Объект);
		Если Не лМетаданные = Неопределено Тогда
			НоваяСтрока = лОбъектыМетаданных.Добавить();
			НоваяСтрока.ОбъектМетаданных = лМетаданные;
			НоваяСтрока.Приоритет = Выборка.Приоритет;
			НоваяСтрока.Поток = Выборка.Поток;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат лОбъектыМетаданных
	
КонецФункции