Процедура ДобавитьДанныеИсторияЗаявокПокупателя(Список, НомерСообщения) Экспорт
	
	Если НЕ РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт","Выгружать историю строк заявок", Ложь) Тогда
		Возврат;
	КонецЕсли;

	ТипОбъектаXDTO = ФабрикаXDTO.Тип("http://ws-02.part-kom.ru/partkom83/hs/SiteExchange/XMLSchema", "ИсторияСтрокЗаявок");
	ВыборкаИсторииСтрокЗаявок = ВыборкаИсторииСтрокЗаявок();
	ТаблицаОтбора = "";
	
	Пока ВыборкаИсторииСтрокЗаявок.Следующий() Цикл
		
		ОбъектXDTO = ФабрикаXDTO.Создать(ТипОбъектаXDTO);
		ЗаполнитьЗначенияСвойств(ОбъектXDTO, ВыборкаИсторииСтрокЗаявок, "IDSite,Количество,НомерЗаявки,Артикул,Цена,ЗакупочнаяЦена");
		ОбъектXDTO.Состояние = ВыборкаИсторииСтрокЗаявок.Состояние.УникальныйИдентификатор();
		ОбъектXDTO.ВерсияДанных = ВыборкаИсторииСтрокЗаявок.Период;
		ОбъектXDTO.Склад = ВыборкаИсторииСтрокЗаявок.Склад.УникальныйИдентификатор();
		Список.Добавить(ОбъектXDTO);
		
		//Текст для отбора//
		xПериод = "dateadd(year,2000, '" + Формат(ВыборкаИсторииСтрокЗаявок.Период, "ДФ='yyyy-MM-dd HH:mm:ss'") + "')";
		xРегистратор =  ОбщегоНазначения.ПреобразоватьGUIDВФорматHEX(ВыборкаИсторииСтрокЗаявок.Регистратор.УникальныйИдентификатор());
		xНомерСтроки = Формат(ВыборкаИсторииСтрокЗаявок.НомерСтроки, "ЧН=; ЧГ=");
		xСтрокаЗаявки = ОбщегоНазначения.ПреобразоватьGUIDВФорматHEX(ВыборкаИсторииСтрокЗаявок.СтрокаЗаявки.УникальныйИдентификатор());
		xСтрокаПрихода = ОбщегоНазначения.ПреобразоватьGUIDВФорматHEX(ВыборкаИсторииСтрокЗаявок.СтрокаПрихода.УникальныйИдентификатор());
		xОтказ = ?(ВыборкаИсторииСтрокЗаявок.Отказ, "1", "0");
		xПорядок = Формат(ВыборкаИсторииСтрокЗаявок.Порядок, "ЧН=; ЧГ=");
		ТаблицаОтбора = ТаблицаОтбора + ?(ТаблицаОтбора = "", "", ",") + "(" + xПериод + "," + xРегистратор + "," + xНомерСтроки + "," + xСтрокаЗаявки + "," + xСтрокаПрихода + "," + xОтказ + "," + xПорядок + ")";
		
	КонецЦикла;
	
	ТаблицаОтбора = "(values" + ТаблицаОтбора + ") t (p,r,n,sz,sp,o,pr)";
	ОтметитьОтправленныеСтрокиВSQL(НомерСообщения, ТаблицаОтбора);
	
КонецПроцедуры
Функция ВыборкаИсторииСтрокЗаявок()
	
	КоличествоОбъектов = РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен (Общее)","Количество объектов в обмене", 1000);
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1234
	                      |	ИсторияЗаявокПокупателя.IDSite,
	                      |	ИсторияЗаявокПокупателя.Период КАК Период,
	                      |	ИсторияЗаявокПокупателя.СтрокаЗаявки.Заявка.Номер КАК НомерЗаявки,
	                      |	ИсторияЗаявокПокупателя.Склад,
	                      |	ИсторияЗаявокПокупателя.Количество,
	                      |	ИсторияЗаявокПокупателя.СтрокаЗаявки.Цена КАК Цена,
	                      |	ИсторияЗаявокПокупателя.СтрокаЗаявки,
	                      |	ИсторияЗаявокПокупателя.СтрокаЗаявки.ЦенаЗакупки КАК ЗакупочнаяЦена,
	                      |	ИсторияЗаявокПокупателя.Состояние,
	                      |	ИсторияЗаявокПокупателя.СтрокаПрихода,
	                      |	ИсторияЗаявокПокупателя.Отказ,
	                      |	ИсторияЗаявокПокупателя.Порядок,
	                      |	ИсторияЗаявокПокупателя.ДатаСобытия,
	                      |	ИсторияЗаявокПокупателя.Номенклатура,
	                      |	ИсторияЗаявокПокупателя.Регистратор,
	                      |	ИсторияЗаявокПокупателя.НомерСтроки,
	                      |	ЕСТЬNULL(ИсторияЗаявокПокупателя.Номенклатура.Артикул, """") КАК Артикул
	                      |ИЗ
	                      |	РегистрСведений.ИсторияЗаявокПокупателя КАК ИсторияЗаявокПокупателя
	                      |ГДЕ
	                      |	НЕ ИсторияЗаявокПокупателя.ПолученоСайтом");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "1234", Формат(КоличествоОбъектов, "ЧГ="));
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции
Процедура ОтметитьОтправленныеСтрокиВSQL(НомерСообщения, СтрокаОтбора)
	
	ТекстЗапросаSQL = ТекстЗапросаОтметкиОтправленного(НомерСообщения, СтрокаОтбора);
	
	Попытка
		СоединениеSQL  = Новый COMОбъект("ADODB.Connection");
		КомандаSQL     = Новый COMОбъект("ADODB.Command");
		ВыборкаSQL     = Новый COMОбъект("ADODB.RecordSet");
		
		СоединениеSQL.ConnectionString = DataExchangeModule.СтрокаСоединенияSQL();
		
		СоединениеSQL.ConnectionTimeout = 30;
		СоединениеSQL.CommandTimeout = 6000;
		
		СоединениеSQL.Open();
		КомандаSQL.ActiveConnection   = СоединениеSQL;
		КомандаSQL.CommandText = ТекстЗапросаSQL;
		КомандаSQL.Execute();
		
		СоединениеSQL.Close();
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры
Функция ТекстЗапросаОтметкиОтправленного(НомерСообщения, ТаблицаОтбора)
	
	Отказ = Ложь;
	ТекстЗапроса = "";
	СтруктураХранения = ПолучитьСтруктуруХраненияБазыДанных();
	ОписаниеТаблицы = СтруктураХранения.Найти("РегистрСведений.ИсторияЗаявокПокупателя", "ИмяТаблицы");
	Если ОписаниеТаблицы = Неопределено Тогда
		Отказ = Истина;
	Иначе
		ИмяТаблицыХранения = "_" + ОписаниеТаблицы.ИмяТаблицыХранения;
		ОписаниеПолей = ОписаниеТаблицы.Поля;
		
		ПолеСтрокаПериод = "_" + ИмяПоляТаблицы(ОписаниеПолей, "Период", Отказ);
		ПолеСтрокаРегистратор = "_" + ИмяПоляТаблицы(ОписаниеПолей, "Регистратор", Отказ) + "RRef";
		ПолеНомерСтроки = "_" + ИмяПоляТаблицы(ОписаниеПолей, "НомерСтроки", Отказ);
		ПолеСтрокаЗаявки = "_" + ИмяПоляТаблицы(ОписаниеПолей, "СтрокаЗаявки", Отказ) + "RRef";
		ПолеСтрокаПрихода = "_" + ИмяПоляТаблицы(ОписаниеПолей, "СтрокаПрихода", Отказ) + "RRef";
		ПолеОтказ = "_" + ИмяПоляТаблицы(ОписаниеПолей, "Отказ", Отказ);
		ПолеПорядок = "_" + ИмяПоляТаблицы(ОписаниеПолей, "Порядок", Отказ);
		ПолеНомерСообщенияОтправленного = "_" + ИмяПоляТаблицы(ОписаниеПолей, "НомерСообщенияОтправленного", Отказ);
		ПолеДатаОтправки = "_" + ИмяПоляТаблицы(ОписаниеПолей, "ДатаОтправки", Отказ);
		
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ДатаОтправкиПакета = "dateadd(year,2000, '" + Формат(ТекущаяДата(), "ДФ='yyyy-MM-dd HH:mm:ss'") + "')";
		Set = " set " + ПолеНомерСообщенияОтправленного + " = " + Формат(НомерСообщения, "ЧГ=") + ", " + ПолеДатаОтправки + " = " + ДатаОтправкиПакета + Символы.ПС;
		СтрокаСоединения = " on " + ПолеСтрокаПериод + " = t.p and " +
									ПолеСтрокаРегистратор + " = t.r and " +
									ПолеНомерСтроки + " = t.n and " +
									ПолеСтрокаЗаявки + " = t.sz and " +
									ПолеСтрокаПрихода + " = t.sp and " +
									ПолеОтказ + " = t.o and " +
									ПолеПорядок + " = t.pr";
									
		
		ТекстЗапроса =	"update " + ИмяТаблицыХранения + Set + "from " + ИмяТаблицыХранения + " inner join" + Символы.ПС + ТаблицаОтбора + Символы.ПС + СтрокаСоединения;
	Иначе
		ВызватьИсключение("Ошибка формирования текста запроса SQL");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ФиксацияПринятогоСообщения(НомерСообщения) Экспорт
	
	ТекстЗапросаФиксацииСообщения = ТекстЗапросаФиксацииСообщения(НомерСообщения);
	
	Попытка
		СоединениеSQL  = Новый COMОбъект("ADODB.Connection");
		КомандаSQL     = Новый COMОбъект("ADODB.Command");
		ВыборкаSQL     = Новый COMОбъект("ADODB.RecordSet");
		
		СоединениеSQL.ConnectionString = DataExchangeModule.СтрокаСоединенияSQL();
		
		СоединениеSQL.ConnectionTimeout = 30;
		СоединениеSQL.CommandTimeout = 6000;
		
		СоединениеSQL.Open();
		КомандаSQL.ActiveConnection   = СоединениеSQL;
		КомандаSQL.CommandText = ТекстЗапросаФиксацииСообщения;
		КомандаSQL.Execute();
		
		СоединениеSQL.Close();
		
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
КонецПроцедуры
Функция ТекстЗапросаФиксацииСообщения(НомерСообщения)
	
	Отказ = Ложь;
	ТекстЗапроса = "";
	СтруктураХранения = ПолучитьСтруктуруХраненияБазыДанных();
	ОписаниеТаблицы = СтруктураХранения.Найти("РегистрСведений.ИсторияЗаявокПокупателя", "ИмяТаблицы");
	Если ОписаниеТаблицы = Неопределено Тогда
		Отказ = Истина;
	Иначе
		ИмяТаблицыХранения = "_" + ОписаниеТаблицы.ИмяТаблицыХранения;
		ОписаниеПолей = ОписаниеТаблицы.Поля;
		ПолеПолученоСайтом = "_" + ИмяПоляТаблицы(ОписаниеПолей, "ПолученоСайтом", Отказ);
		ПолеНомерСообщенияОтправленного = "_" + ИмяПоляТаблицы(ОписаниеПолей, "НомерСообщенияОтправленного", Отказ);
		ПолеДатаОбработкиСайтом = "_" + ИмяПоляТаблицы(ОписаниеПолей, "ДатаОбработкиСайтом", Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Дата = "DATEADD(YEAR,2000, '" + Формат(ТекущаяДата(), "ДФ='yyyy-MM-dd HH:mm:ss'") + "')";
		ТекстЗапроса =	"UPDATE " + ИмяТаблицыХранения + " set " + ПолеПолученоСайтом + " = 1, " + ПолеДатаОбработкиСайтом + " = " + Дата + " " +
						"WHERE " + ПолеПолученоСайтом + " =  0 and (" +ПолеНомерСообщенияОтправленного + " between 1 and " + Формат(НомерСообщения, "ЧН=; ЧГ=") + ")";
	Иначе
		ВызватьИсключение("Ошибка формирования текста запроса SQL");
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ИмяПоляТаблицы(ОписаниеПолей, ИмяПоля, Отказ)
	
	ИмяПоляХранения = "";	
	Строка = ОписаниеПолей.Найти(ИмяПоля, "ИмяПоля");
	Если Строка = Неопределено Тогда
		Отказ = Истина;
	Иначе
		ИмяПоляХранения = Строка.ИмяПоляХранения;
	КонецЕсли;
	
	Возврат ИмяПоляХранения;
	
КонецФункции