
//ХудинВВ 11042019 XX-2294
Процедура ВыключитьАлгоритмыПоНомеруРелиза(НомерРелиза) Экспорт
	
	лКлючАлгоритма = "Справочник_Релизы_МодульМенеджера_ВыключитьАлгоритмыПоНомеруРелиза";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Алгоритмы.Ссылка,
		|	Алгоритмы.Представление КАК Представление,
		|	Алгоритмы.ПользовательДобавил.Представление КАК ПользовательДобавилПредставление
		|ИЗ
		|	Справочник.Алгоритмы КАК Алгоритмы
		|ГДЕ
		|	Алгоритмы.Релиз.Код = &Код
		|	И Алгоритмы.Активность";
	
	Запрос.УстановитьПараметр("Код", НомерРелиза);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл

		АлгоритмОбъект = Выборка.Ссылка.ПолучитьОбъект();
		АлгоритмОбъект.Активность = Ложь;
		АлгоритмОбъект.Записать();
		Сообщить("Отключен алгоритм: "+Выборка.Представление+", добавлен: "+Выборка.ПользовательДобавилПредставление);
		
	КонецЦикла;
	
КонецПроцедуры