
Процедура ПриЗаписи(Отказ)
	
	Если Не ОбменДанными.Загрузка И ТекущийРелиз Тогда
		Если ЭтоНовый() Тогда
			Запрос = Новый Запрос("Выбрать Ссылка Из Справочник.Релизы Где ТекущийРелиз"); 
		Иначе
			Запрос = Новый Запрос("Выбрать Ссылка Из Справочник.Релизы Где ТекущийРелиз И Ссылка <> &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.ОбменДанными.Загрузка = Истина;
			Объект.ТекущийРелиз = Ложь;
			Объект.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
