
Процедура ПередУдалением(Отказ)
	Отказ = Истина;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ПометкаУдаления Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если Ссылка = Справочники.НастройкиРеквизитовДляОбменов.ДатаНачалаРегистрацииОбъектовВТопЛог.Ссылка Тогда 
		Если ОбщегоНазначения.ЭтоРабочаяИнформационнаяБаза() Тогда 
			глЗначениеПеременнойУстановить("ДатаНачалаРегистрацииОбъектовВТопЛог", ДатаДляРабочейБазы, Истина);
		Иначе
			глЗначениеПеременнойУстановить("ДатаНачалаРегистрацииОбъектовВТопЛог", ДатаДляТестовойБазы, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
