Функция ПолучитьВидДня(Дата, Календарь = Неопределено) Экспорт
	
	Если Календарь = Неопределено Тогда
		Календарь = Справочники.Календари.Регламентированный
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДатыКалендарей.ВидДня
	                      |ИЗ
	                      |	РегистрСведений.ДатыКалендарей КАК ДатыКалендарей
	                      |ГДЕ
	                      |	ДатыКалендарей.Календарь = &Календарь
	                      |	И ДатыКалендарей.ДатаКалендаря = &ДатаКалендаря");
	Запрос.УстановитьПараметр("Календарь", Календарь);
	Запрос.УстановитьПараметр("ДатаКалендаря", Дата);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат Неопределено
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.ВидДня;
	КонецЕсли;
	
КонецФункции