
Процедура ПередЗаписью(Отказ, Замещение)
	// ЛНА http://jira.part-kom.ru/browse/XX-2439	
	Если Не Отказ Тогда
		ТекДата = ТекущаяДата();
		Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
			Если Не ЗначениеЗаполнено(СтрокаНабора.ПользовательПровел) Тогда
				СтрокаНабора.ПользовательПровел = ПараметрыСеанса.ТекущийПользователь;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СтрокаНабора.ДатаПроведения) Тогда
				СтрокаНабора.ДатаПроведения = ТекДата;
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
