
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументыПродажи.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
	ДокументыПродажи.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номенклатура);
	ДокументыПродажи.Параметры.УстановитьЗначениеПараметра("ВсяНоменклатура", Не ЗначениеЗаполнено(Параметры.Номенклатура));
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументыПродажиВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Закрыть(Значение);
КонецПроцедуры

