
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументыПродажи.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
	ДокументыПродажи.Параметры.УстановитьЗначениеПараметра("Номенклатура", Параметры.Номенклатура);
	ДокументыПродажи.Параметры.УстановитьЗначениеПараметра("ВсяНоменклатура", Не ЗначениеЗаполнено(Параметры.Номенклатура));
	
	Элементы.ДокументыПродажи.Период = Новый СтандартныйПериод(ДобавитьМесяц(НачалоДня(Параметры.ДатаОснования), -3), НачалоДня(Параметры.ДатаОснования));

КонецПроцедуры

&НаКлиенте
Процедура ДокументыПродажиВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	Закрыть(Значение);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры

