
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Заголовок = "Выбор регламентного задания";
	МассивРегл = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	Для Каждого Регл Из МассивРегл Цикл 
		НоваяСтрока = тРегламентныеЗадания.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Регл);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Если Элементы.РегламентныеЗадания.ТекущиеДанные <> Неопределено Тогда 
		Закрыть(Элементы.РегламентныеЗадания.ТекущиеДанные.УникальныйИдентификатор);
	КонецЕсли;
КонецПроцедуры
