

Процедура КонтрольВыгрузкиРТУВТоплог(Период,Событие)   Экспорт
	//Период - число дней от текущей даты	
	Если НЕ  Период = Тип("Число") или не ЗначениеЗаполнено(Период) тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю("Не корректно заполнен период");
	КонецЕсли;	
	
	ВыборкаДанных  = ПолучитьОшибкиВыгрузкиРТУ(Период,Событие);
	Пока ВыборкаДанных.Следующий() цикл 
	//КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(РегламентноеЗадание,СобытиеОшибки,ОписаниеОшибки,СтруктураПараметров);		
	КонецЦикла;	
	
КонецПроцедуры	


Функция ПолучитьОшибкиВыгрузкиРТУ(Период,Событие)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РеализацияТоваровУслуг.Ссылка КАК Документ,
		|	ВЫБОР
		|		КОГДА ИсторияОбменовПоОбъектам.Ошибка
		|			ТОГДА ""При выгрузке произошли Ошибки"" + ИсторияОбменовПоОбъектам.ТекстОшибки
		|		ИНАЧЕ ""Документ не выгружен""
		|	КОНЕЦ КАК ОписаниеОшибки,
		|	РеализацияТоваровУслуг.ТипДоставки
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияОбменовПоОбъектам КАК ИсторияОбменовПоОбъектам
		|		ПО РеализацияТоваровУслуг.Ссылка = ИсторияОбменовПоОбъектам.Объект
		|			И (ИсторияОбменовПоОбъектам.Узел = &УзелТоплог)
		|			И (ИсторияОбменовПоОбъектам.Исходящее = ИСТИНА)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугТовары.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КритическиеСобытияСистемы КАК КритическиеСобытияСистемы
		|		ПО РеализацияТоваровУслуг.Ссылка = КритическиеСобытияСистемы.ИсточникКритическогоСобытия
		|			И (КритическиеСобытияСистемы.Событие = &Событие)
		|ГДЕ
		|	(ИсторияОбменовПоОбъектам.Объект ЕСТЬ NULL
		|			ИЛИ ИсторияОбменовПоОбъектам.Ошибка)
		|	И РеализацияТоваровУслуг.Проведен = ИСТИНА
		|	И РеализацияТоваровУслуг.ЭтоМФП = ЛОЖЬ
		|	И РеализацияТоваровУслуг.флНеВыгружатьВТопЛог = ЛОЖЬ
		|	И РеализацияТоваровУслуг.Дата >= &НачалоПериода
		|	И НЕ РеализацияТоваровУслуг.СтатусДокумента = ЗНАЧЕНИЕ(Справочник.СтатусыДокументов.РеализацияТоваровУслугНовый)
		|	И РеализацияТоваровУслуг.Дата <= &КонецПериода
		|	И РеализацияТоваровУслуг.Склад.ОбменСTopLog = ИСТИНА
		|	И КритическиеСобытияСистемы.ИсточникКритическогоСобытия ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("КонецПериода", ТекущаяДата() - 600);  //10 минут временой лаг на выгрузку в топлог
	Запрос.УстановитьПараметр("НачалоПериода", ТекущаяДата() - Период * 24*60);
	Запрос.УстановитьПараметр("УзелТоплог", ПланыОбмена.ОбменПартКом83_TopLog_РТУ.ЭтотУзел());
	Запрос.УстановитьПараметр("Событие", Событие);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	
 Возврат РезультатЗапроса.Выбрать();
		
КонецФункции	

Процедура КонтрольСтатусовРТУ(Период,Событие) Экспорт
	
	
КонецПроцедуры	