
Процедура КонтрольВыгрузкиРТУВТоплог(Период,Событие) Экспорт
	
	лКлючАлгоритма = "Обработка_КонтрольОшибокВыпискиРТУ_МодульМенеджера_КонтрольВыгрузкиРТУВТоплог";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////	
	
	//Период - число дней от текущей даты	
	Если НЕ Типзнч(Период) = Тип("Число") или не ЗначениеЗаполнено(Период) тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю("Не корректно заполнен период");
	КонецЕсли;	
	
	ВыборкаДанных  = КонтрольДанныхКлиентСервер.ПолучитьОшибкиВыгрузкиРТУ(Период,Событие);
	Пока ВыборкаДанных.Следующий() цикл 
		КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(ВыборкаДанных.Документ,Событие,ВыборкаДанных.ОписаниеОшибки +"("+ВыборкаДанных.ТипДоставки+")");		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура КонтрольСтатусовРТУ(Период,Событие) Экспорт
	
	лКлючАлгоритма = "Обработка_КонтрольОшибокВыпискиРТУ_МодульМенеджера_КонтрольСтатусовРТУ";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	Если Типзнч(Период) = Тип("Число") или не ЗначениеЗаполнено(Период) тогда 
		ПериодОбработки = НачалоГода(ТекущаяДата());
	иначе
		ПериодОбработки  = Период.ДатаНачала;
	КонецЕсли;	
	
	ВыборкаДанных  = КонтрольДанныхКлиентСервер.ПолучитьОшибкиСтатусовРТУ(ПериодОбработки,Событие);
	Пока ВыборкаДанных.Следующий() цикл 
		СообщениеОшибки = "Не обработан статус у РТУ "+ СокрЛП(ВыборкаДанных.Документ) +"("+ВыборкаДанных.Контрагент +")" + ", тек.стататус: " + ВыборкаДанных.СтатусДокумента;  
		КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(ВыборкаДанных.Документ,Событие,СообщениеОшибки);		
	КонецЦикла;	
	
КонецПроцедуры	

Процедура КонтрольВыпискиVMIбезРасписания(Период,Событие) Экспорт
	
	лКлючАлгоритма = "Обработка_КонтрольОшибокВыпискиРТУ_МодульМенеджера_КонтрольВыпискиVMIбезРасписанияКонтрольВыпискиVMIбезРасписания";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////	
	
	Если Типзнч(Период) = Тип("Число") или не ЗначениеЗаполнено(Период) тогда 
		Период = новый СтандартныйПериод(ВариантСтандартногоПериода.Вчера);
	КонецЕсли;
	
	ВыборкаДанных  = КонтрольДанныхКлиентСервер.ПолучитьОшибкиВыпискиVMIбезРасписания(Период.ДатаНачала,Период.ДатаОкончания,Событие);
	Пока ВыборкаДанных.Следующий() цикл 
		СообщениеОшибки = "Не сформировано расписание для отчетов VMI "+ СокрЛП(ВыборкаДанных.Документ) +"("+ВыборкаДанных.Контрагент +")" + ", по орг.: " + ВыборкаДанных.Организация +" и скл.:" + ВыборкаДанных.Склад  ;  
		КритическиеСобытияСервер.ЗарегистрироватьКритическоеСобытие(ВыборкаДанных.Документ,Событие,СообщениеОшибки);		
	КонецЦикла;
		
КонецПроцедуры
