Функция ЗначениеПараметра(Подсистема, Параметр, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиПодсистем.Значение
	                      |ИЗ
	                      |	РегистрСведений.НастройкиПодсистем КАК НастройкиПодсистем
	                      |ГДЕ
	                      |	НастройкиПодсистем.Подсистема = &Подсистема
	                      |	И НастройкиПодсистем.Параметр = &Параметр");
	Запрос.УстановитьПараметр("Подсистема", Подсистема);
	Запрос.УстановитьПараметр("Параметр", Параметр);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Значение, ЗначениеПоУмолчанию);
	
КонецФункции