#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПутьКИК( пИК ) Экспорт
	
	Возврат СокрЛП( пИК.ПолныйКод() );
	
КонецФункции	//ПолучитьПутьКИК

Функция СтруктураКонстантАлгоритма(Алгоритм) Экспорт
	
	СтруктураКонстантАлгоритма = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	АлгоритмыПроцессовЛокальныеИменованныеКонстанты.Имя,
	|	АлгоритмыПроцессовЛокальныеИменованныеКонстанты.Значение
	|ИЗ
	|	Справочник.АлгоритмыПроцессов.ЛокальныеИменованныеКонстанты КАК АлгоритмыПроцессовЛокальныеИменованныеКонстанты
	|ГДЕ
	|	АлгоритмыПроцессовЛокальныеИменованныеКонстанты.Ссылка = &Алгоритм";
	
	Запрос.УстановитьПараметр("Алгоритм", Алгоритм);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураКонстантАлгоритма.Вставить(Выборка.Имя, Выборка.Значение);
	КонецЦикла;
	
	Возврат СтруктураКонстантАлгоритма;	
	
КонецФункции


#КонецЕсли