Процедура ЗадачиJira_УстановитьПараметрыСеанса() Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_ЗадачиJiraГлобальный_ЗадачиJira_УстановитьПараметрыСеанса";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивЗадач = Новый Массив;
	Если Константы.ИспользоватьЗадачиJira.Получить() = Истина Тогда		
		Запрос = Новый Запрос;		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗадачиJira.Ссылка,
		|	ЗадачиJira.Код,
		|	ЗадачиJira.Наименование
		|ИЗ
		|	Справочник.ЗадачиJira КАК ЗадачиJira
		|ГДЕ
		|	Активность = Истина";
		МассивЗадач = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	ПараметрыСеанса.АктивныеЗадачиJIRA = Новый ФиксированныйМассив(МассивЗадач);

КонецПроцедуры

Функция ЭтоАктивнаяЗадачаJirа(СсылкаНаЗадачу) Экспорт
	
	лКлючАлгоритма = "ОбщийМодуль_ЗадачиJiraГлобальный_ЭтоАктивнаяЗадачаJirа";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	Возврат ПараметрыСеанса.АктивныеЗадачиJIRA.Найти(СсылкаНаЗадачу) <> Неопределено;
	
КонецФункции


	