////////////////////////////////////////////////////////////////////////////////
// Подсистема "Работа с почтовыми сообщениями".
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает указан ли в учетной записи пароль или нет
//
// см. описание функции ЭлектроннаяПочта.ПарольЗадан.
//
Функция ПарольЗадан(УчетнаяЗапись) Экспорт
	
	Возврат ЭлектроннаяПочта.ПарольЗадан(УчетнаяЗапись);
	
КонецФункции

// Проверка учетной записи электронной почты.
//
// см. описание процедуры ЭлектроннаяПочта.ПроверитьВозможностьОтправкиИПолученияЭлектроннойПочты.
//
Процедура ПроверитьВозможностьОтправкиИПолученияЭлектроннойПочты(УчетнаяЗапись, ПарольПараметр, СообщениеОбОшибке, ДополнительноеСообщение) Экспорт
	
	ЭлектроннаяПочта.ПроверитьВозможностьОтправкиИПолученияЭлектроннойПочты(УчетнаяЗапись, ПарольПараметр, СообщениеОбОшибке, ДополнительноеСообщение);
	
КонецПроцедуры

// Возвращает Истина, если текущему пользователю доступна по меньшей мере одна учетная запись для отправки.
Функция ЕстьДоступныеУчетныеЗаписиДляОтправки() Экспорт
	Возврат ЭлектроннаяПочта.ПолучитьДоступныеУчетныеЗаписи(Истина).Количество() > 0;
КонецФункции

Процедура ЗагрузитьСообщениеОбмена(вхУзелОбмена) Экспорт
	
	лАдресВебСервиса = "http://exchange.part-kom.ru/exchange/wsdl";
	лМетаданныеПланаОбмена = Метаданные.ПланыОбмена.ОбменПартКом83_Сайт;
	лМенеджерПланаОбмена = ОбщегоНазначения.МенеджерОбъектаПоМетаданным(лМетаданныеПланаОбмена);
	
	лПолучатель = лМенеджерПланаОбмена.ЭтотУзел();
	лКодПолучателя = Число(лПолучатель.Код);
	лОтправитель = вхУзелОбмена;
	лКодОтправителя = Число(лОтправитель.Код);
	лНомерПринятого = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(лОтправитель, "НомерПринятого");
	
	лОпределения = Новый WSОпределения(лАдресВебСервиса);
	лПрокси = Новый WSПрокси(лОпределения, лОпределения.Сервисы[0].URIПространстваИмен,
	лОпределения.Сервисы[0].Имя, лОпределения.Сервисы[0].ТочкиПодключения[0].Имя);
	
	лОтветСервера = лПрокси.GetExchangeMessage(лМетаданныеПланаОбмена.Имя, лКодПолучателя, лНомерПринятого);
	лУпаковщик = DataExchangeПовтИсп.ПолучитьУпаковщик();
	лСообщениеОбмена = лУпаковщик.UnpackWideString(лОтветСервера);
	
	// без этого на сервере не работает почему то
	лТекстовыйДокумент = Новый ТекстовыйДокумент;
	лТекстовыйДокумент.УстановитьТекст(лСообщениеОбмена);
	лСообщениеОбмена = лТекстовыйДокумент.ПолучитьТекст();
	
	лМенеджерПланаОбмена.ЗагрузитьСообщениеОбмена(лСообщениеОбмена);
	лУпаковщик = Неопределено;
	
КонецПроцедуры

