//СтруктураПараметров.Объект - ссылка на документ, добавляем только перемещения
Процедура Добавить(СтруктураПараметров) Экспорт
	
	ВестиЛог = ОбщегоНазначенияПовтИсп.ЗначениеКонстанты("ИсторияОтложеннойОбработкиОбъектов");
	Если Не ВестиЛог Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(СтруктураПараметров.Объект) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Возврат;
	КонецЕсли;
	
	МЗ  = РегистрыСведений.ОтложеннаяОбработкаОбъектовИсторияОбработки.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, СтруктураПараметров);
	Если Не ЗначениеЗаполнено(МЗ.Период) Тогда
		МЗ.Период = ТекущаяДата();
	КонецЕсли;
	МЗ.Записать();
	
КонецПроцедуры