// Определяет текущую (системную) дату на компьютере сервера 1С:Предприятия.
//
// Возвращаемое значение:
//   Дата   - текущая (системная) дата
//
Функция ТекущаяДатаСервера() Экспорт

	Возврат ТекущаяДата();

КонецФункции 
 
// Установить начальное значение константы при обновлении версии ИБ.
//
Процедура ИнициализироватьПроверкуРазницыВремениССервером() Экспорт

	Константы.ПроверятьРазницуВоВремениССервером.Установить(Истина);

КонецПроцедуры

// + Пушкин 20181204 XX-1456
Функция ПолучитьРегиональноеВремя(пар_ДатаИВремя, пар_Склад) экспорт
	
	МестноеДатаВремя = пар_ДатаИВремя;
	
	Если ЗначениеЗаполнено(пар_ДатаИВремя) И ЗначениеЗаполнено(пар_Склад) тогда
		
		ПараметрыСклада = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(пар_Склад,"ВременнаяЗона,ФизическийСклад");
		
		л_ВременнаяЗона = ПараметрыСклада.ВременнаяЗона;
		Если НЕ ЗначениеЗаполнено(л_ВременнаяЗона) тогда
			л_Склад = ПараметрыСклада.ФизическийСклад;
			Если НЕ л_Склад = пар_Склад тогда
				л_ВременнаяЗона = ОбщегоНазначения.ПолучитьЗначениеРеквизита(л_Склад,"ВременнаяЗона");
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(л_ВременнаяЗона) тогда
			л_ВременнаяЗона_Отклонение_ч = ОбщегоНазначения.ПолучитьЗначениеРеквизита(л_ВременнаяЗона,"Отклонение");
			МестноеДатаВремя = пар_ДатаИВремя + (л_ВременнаяЗона_Отклонение_ч*3600);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МестноеДатаВремя;
КонецФункции
// - Пушкин 20181204 XX-1456
