
Функция ПолучитьУпаковщик() Экспорт
	Возврат (Новый COMОбъект("adoExchanger64.Pack"));
КонецФункции

Функция ПолучитьКодировщик() Экспорт
	Возврат (Новый COMОбъект("adoExchanger64.Base64"));
КонецФункции

Функция ПолучитьАрхиватор() Экспорт
	Возврат (Новый COMОбъект("adoExchanger64.Deflate"));
КонецФункции

Функция ПолучитьСервис() Экспорт
	Возврат (Новый COMОбъект("adoExchanger64.Util"));
КонецФункции

Функция ПолучитьСтрокуСМетодамиОбъекта(СтрокаИмяОбъекта) Экспорт
	
	МногоСтрока = СтрЗаменить(СтрокаИмяОбъекта, ".", Символы.ПС);
	ИмяМенеджера = СтрПолучитьСтроку(МногоСтрока, 1);
	ИмяОбъекта = СтрПолучитьСтроку(МногоСтрока, 2);
	Если ИмяМенеджера = "Обработки" Тогда
		Объект = Обработки[ИмяОбъекта].Создать();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	Возврат ПолучитьСервис().GetInterfaceInfo(Объект);
	
КонецФункции

