
Процедура ДобавитьСобытие(АктРассмотренияВозврата, СтатусДокумента, Ответственный = Неопределено, Описание = "") Экспорт
	
	МЗ = РегистрыСведений.СобытияАктовРассмотренияВозврата.СоздатьМенеджерЗаписи();
	МЗ.Период 					= ТекущаяДата();
	МЗ.АктРассмотренияВозврата 	= АктРассмотренияВозврата;
	МЗ.СтатусДокумента 			= СтатусДокумента;
	МЗ.Ответственный 			= ?(Ответственный = Неопределено, ПараметрыСеанса.ТекущийПользователь, Ответственный);
	МЗ.Описание 				= Описание;
	МЗ.Записать();
	
КонецПроцедуры