
Процедура ДобавитьСобытие(АктРассмотренияВозврата, ПараметрыСобытия) Экспорт
	
	МЗ = РегистрыСведений.СобытияАктовРассмотренияВозврата.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, ПараметрыСобытия);
	МЗ.Период 					= ТекущаяДата();
	МЗ.АктРассмотренияВозврата 	= АктРассмотренияВозврата;
	Если НЕ ЗначениеЗаполнено(МЗ.Ответственный) Тогда
		МЗ.Ответственный 			= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	МЗ.Записать();
	
КонецПроцедуры

Функция ИнициализироватьСтруктуруПараметровСобытия() Экспорт
	
	ПараметрыСобытия = Новый Структура;
	
	лМетаданныеРегистра = Метаданные.РегистрыСведений.СобытияАктовРассмотренияВозврата;
	Для Каждого лОбъектМетаданных Из лМетаданныеРегистра.Измерения цикл
		ПараметрыСобытия.Вставить(лОбъектМетаданных.Имя);
	КонецЦикла;
	
	Для Каждого лОбъектМетаданных Из лМетаданныеРегистра.Ресурсы цикл
		ПараметрыСобытия.Вставить(лОбъектМетаданных.Имя);
	КонецЦикла;
	
	Для Каждого лОбъектМетаданных Из лМетаданныеРегистра.Реквизиты цикл
		ПараметрыСобытия.Вставить(лОбъектМетаданных.Имя);
	КонецЦикла;
	
	Возврат ПараметрыСобытия;
		
КонецФункции