
Процедура ПередЗаписью(Отказ)
	
	Если Не ПометкаУдаления И Не Справочники.ПолитикиМФП.ПолитикаУникальна(Ссылка, Владелец, ПериодДействия) Тогда
		Отказ = Истина;
		Сообщить("Уже есть политика МФП для этой организации от "+Формат(ПериодДействия,"ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		ПередЗаписьюПроверитьЗаполненностьРеквизитов(Отказ);
	КонецЕсли;
	
	КолРегистраций = СобственныеОрганизацииРазрешенаПродажа.Количество();
	
	СобственныеОрганизацииРазрешенаПродажаСтрокой = ?(КолРегистраций = 0, "", "Разрешена продажа "+СобственныеОрганизацииРазрешенаПродажа.Количество()+" организациям");
	
	ПроверитьОрганизацииПродажи(Отказ);
	
КонецПроцедуры

Процедура ПроверитьОрганизацииПродажи(Отказ)
	
	Если СобственныеОрганизацииРазрешенаПродажа.Найти(Справочники.Организации.ПустаяСсылка(), "Организация") <> Неопределено Тогда
		Сообщить("Нельзя указывать в качестве организации продажи пустую организацию!");
		Отказ = Истина;
	КонецЕсли;
	
	Если СобственныеОрганизацииРазрешенаПродажа.Найти(Владелец, "Организация") <> Неопределено Тогда
		Сообщить("Нельзя указывать в качестве организации продажи, организацию-владельца политики!");
		Отказ = Истина;
	КонецЕсли;
	
	 ТЗ = СобственныеОрганизацииРазрешенаПродажа.Выгрузить();
	 ТЗ.Свернуть("Организация", "ПроцентНаценки");
	
	 Если ТЗ.Количество() <>  СобственныеОрганизацииРазрешенаПродажа.Количество() Тогда
		Сообщить("Проверьте дубли строк в организациях продажи");
		Отказ = Истина;
	 КонецЕсли;
	
КонецПроцедуры

Процедура 	ПередЗаписьюПроверитьЗаполненностьРеквизитов(Отказ)

	Если Не ЗначениеЗаполнено(ПериодДействия) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан период действия!", Отказ,, СтатусСообщения.Важное);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан собственный контрагент!", Отказ,, СтатусСообщения.Важное);
	КонецЕсли;
	
	Если  РазрешенаПродажаСобственнымОрганизациям И СобственныеОрганизацииРазрешенаПродажа.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Добавьте организации, либо уберите разрешение", Отказ,"Не указано ни одной собственной организации для продажи!", СтатусСообщения.Важное);
	КонецЕсли;
	
КонецПроцедуры

