Функция СкладMaxoptraДоступен(ТипДоставки, Склад) Экспорт 
	лКлючАлгоритма = "ОбщийМодуль_ФормированиеСлужебныхЗаданийКлиентСервер_СкладMaxoptraДоступен";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	
	СкладMaxoptraДоступен = ТипДоставки = Справочники.ТипыДоставки.ДоставкаВодителем И ЕстьСкладыMaxoptra(Склад);
	
	Возврат СкладMaxoptraДоступен;
КонецФункции

Функция ЕстьСкладыMaxoptra(Склад) Экспорт 
	лКлючАлгоритма = "ОбщийМодуль_ФормированиеСлужебныхЗаданийКлиентСервер_ЕстьСкладыMaxoptra";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Первые 1
	               |	МегаЛогист_СоответствиеСкладов1СИMaxoptra.Ссылка
	               |ИЗ
	               |	Справочник.МегаЛогист_СоответствиеСкладов1СИMaxoptra КАК МегаЛогист_СоответствиеСкладов1СИMaxoptra
	               |ГДЕ
	               |	МегаЛогист_СоответствиеСкладов1СИMaxoptra.Склад = &Склад
	               |	И &Склад <> ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)";
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции
