
Процедура ПередЗаписью(Отказ)
	
	Если Автоматически И НаКлиенте Тогда
		ВызватьИсключение "Признаки Автоматически и НаКлиенте не могут быть установлены одновременно!";
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
	
	Если НЕ НаКлиенте Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомандыПроцессовОбработчики.Обработчик.Алгоритм КАК ТекстАлгоритма,
		|	КомандыПроцессовОбработчики.Обработчик
		|ИЗ
		|	Справочник.КомандыПроцессов.Обработчики КАК КомандыПроцессовОбработчики
		|ГДЕ
		|	КомандыПроцессовОбработчики.Ссылка = &Ссылка";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			Если СтрНайти(нрег(Выборка.ТекстАлгоритма), "форма") > 0 Тогда
				Сообщить("Для команды, выполняемой на сервере, недоступна форма. Проверьте обработчик: "+Выборка.Обработчик);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
