Процедура СформироватьНаименование() Экспорт
	Дополнение = "";
	Если Выгрузка Тогда
		Дополнение = Дополнение + "выгрузка";
	КонецЕсли;
	Если Загрузка Тогда
		Если ПустаяСтрока(Дополнение) Тогда
			Дополнение = "загрузка";
		Иначе
			Дополнение = Дополнение + ", загрузка";
		КонецЕсли;
	КонецЕсли;
	
	Наименование = СокрЛП(ОбъектМетаданных) + 
	?(ПустаяСтрока(ФормаДокумента), "", ", " + СокрЛП(ФормаДокумента)) +
	?(ПустаяСтрока(Дополнение), "", " (" + Дополнение + ")");
			
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ПустаяСтрока(ОбъектМетаданных) Тогда
		Отказ = Истина;
	Иначе
		СформироватьНаименование();
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Контрагенты.Очистить();
	СоответствиеШапки.Очистить();
	СоответствияПолей.Очистить();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ОбъектКопирования.Контрагенты.Выгрузить(), Контрагенты);
		
КонецПроцедуры
