
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидСкидки = Перечисления.ВидыСкидок.СОграничениемПоОбщейСумме Тогда 
		ПроверяемыеРеквизиты.Добавить("МаксимальнаяСуммаСкидки");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Документы.УстановкаСкидокПоставщиковVMI.ВыполнитьПроведение(Ссылка, Отказ);
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	Документы.УстановкаСкидокПоставщиковVMI.ВыполнитьОтменуПроведения(Ссылка, Отказ);
КонецПроцедуры

