Перем мЗарегистрироватьИзмененияДляСайта;

Процедура ПередУдалением(Отказ)

	Если НЕ ЭтоГруппа И РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: Склады", Ложь) Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если мЗарегистрироватьИзмененияДляСайта И НЕ ЭтоГруппа Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: Склады", Ложь) И НЕ  ОбменДанными.Загрузка Тогда
		мЗарегистрироватьИзмененияДляСайта = ОбменДаннымиКлиентСервер.НеобходимаРегистрацияИзменений(ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные(), ЭтотОбъект);
	КонецЕсли;
	
	ВыполнитьПроверкиПередЗаписью(Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	//#PK83-742 Kalinin V.A. ( 2018-06-19 )
	МассивНепроверяемыхРеквизитов = новый Массив;
	Если не ВыгружатьНаСайт тогда 
	    МассивНепроверяемыхРеквизитов.Добавить("МаршрутДоставкиСамовывоза");
	КонецЕсли;	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
КонецПроцедуры

Процедура ВыполнитьПроверкиПередЗаписью(Отказ)
	
	Если ЗначениеЗаполнено(СкладХаб) И Не СкладХаб.Хаб Тогда
		ВызватьИсключение "В качестве склада хаба должен быть указан хаб!";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СкладХаб) И СкладХаб.Возвраты Тогда
		ВызватьИсключение "В качестве склада хаба нельзя указывать склад возвратов!";
	КонецЕсли;

	Если ЗначениеЗаполнено(СкладВозвратов) И НЕ СкладВозвратов.Возвраты Тогда
		 ВызватьИсключение "В качестве склада возвратов может быть указан только склад возвратов!";
	КонецЕсли;
	
КонецПроцедуры



мЗарегистрироватьИзмененияДляСайта = Ложь;
