Перем мЗарегистрироватьИзмененияДляСайта;

Процедура ПередУдалением(Отказ)

	Если НЕ ЭтоГруппа И РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: Склады", Ложь) Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если мЗарегистрироватьИзмененияДляСайта И НЕ ЭтоГруппа Тогда
		ОбменДаннымиКлиентСервер.ЗарегистрироватьОбъект(ЭтотОбъект, ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные());
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если РегистрыСведений.НастройкиПодсистем.ЗначениеПараметра("Обмен 1С-Сайт", "Справочник: Склады", Ложь) И НЕ  ОбменДанными.Загрузка Тогда
		мЗарегистрироватьИзмененияДляСайта = ОбменДаннымиКлиентСервер.НеобходимаРегистрацияИзменений(ПланыОбмена.ОбменПартКом83_Сайт.ПолучитьМетаданные(), ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры

мЗарегистрироватьИзмененияДляСайта = Ложь;
